export const ComfortAPI = [
    {
        "book_id": 1,
        "book_title": "پیَدایش",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "خُدا نے ابتدا میں زمین و آسمان کو پَیدا کیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور زمین ویران اور سُنسان تھی اور گہراو کے اُوپر اندھیرا تھا اور خُدا کی روُح پانی کی سطح پر جُنبش کرتی تھی ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور خُدا نے کہا کہ روشنی ہو جا اور روشنی ہو گئی۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور خُدا نے کہاکہ روشنی اچھی ہے اور خُدا نے روشنی کو تاریکی سے جُدا کیا",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور خُدا نے روشنی کو دن کہا اور تاریکی کو رات اور شام ہوئی اور صُبح ہوئی ۔ سو پہلا دن ہوا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خُد ا نے کہا کہ پانیوں کے درمیان فضا ہو تاکہ پانی پانی سے جُدا ہو جائے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "پس خُدا نے فضا کو بنایا اور فضا کے نیچے کے پانی کو فضا کے اُوپر کے پانی سے جُدا کیا اور ایسا ہی ہوا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور خُدا نے فضا کو آسمان کہا اور شام ہوئی اور صُبح ہوئی ۔ سو دُوسرا دن ہوا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور خُدا نے کہا کہ آسمان کے نیچے کا پانی ایک جگہ جمع ہو کر خُشکی نظر آئے اور اَیسا ہی ہوا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور خُدا نے خُشکی کو زمین کہا اور جو پانی جمع ہوگیا تھا اُسکو سمندر اور خُدا نے دیکھا کہ اچھا ہے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور خُدا نے کہا زمین گھاس اور بیج دار بوٹیوں کو اور پھلدار درختوں کو جو اپنی اپنی جنس کے موافِق پھلیں اور جو زمین پر اپنے آپ ہی میں بیج رکھیں اُگائے اور ایسا ہی ہوا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب زمین نے گھاس اور بوُٹیوں کو جو اپنی اپنی جِنس کے موافق بیج رکھیں اور پلدار درختوں کو جنکے بیج اُنکی جِنس کے مُوافِق اُن میں ہیں اُگیا اور خُدا نے دیکھا کہ اچھا ہے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور شام ہوئی اور صُبح ہوئی ۔ سو تیسرا دِن ہوا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": " اور خُدا نے کہا کہ فلک پر نیر ہوں کہ دِن کو رات سے الگ کریں اور وہ نشانوں اور زمانوں اور دِنوں اور برسوں کے اِمتیاز کے لئے ہوں ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور فلک پر انوار کے لئے ہوں کہ زمین پر روشنی ڈالیں اور اَیسا ہی ہوا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "خُدا نے دو بڑے نیر بنائے ۔ ایک نیر اکبر کہ دن کو حکم کرے اور ایک نیر اصغرکہ رات پر حکم کرے اور اُس نے ستاروں کو بھی بنایا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور خُدا نے اُنکوں فلک پر رکھا کہ زمین پر روشنی ڈالیں ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور دِن پر اور رات پر حکم کریں اور اُجالے کو اندھیرے سے جُدا کریں اور خُدا نے دیکھا کہ اچھا ہے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور شام ہوئی اور صُبح ہوئی۔ سو چوتھا دن ہوا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور خُدا نے کہا کہ پانی جانداروں کو کثرت سے پیدا کرے اور پرندے زمین کے اُوپر فضا میں اُڑیں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خُدا نے بڑے بڑے دریائی جانوروں کو اور ہر قسم کے جاندار کو جو پانی سے بکثرت پیدا ہوئے تھے اُنکی جنسِ کے موافِق اور ہر قسم کے پرندوں کو اُنکی جنس کے مُوافق پیدا کیا اور خُدا نے دیکھا کہ اچھا ہے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُدا نے اُنکو یہ کہکر برکت دی کہ پھلو اور بڑھو اور اِن سمندروں کے پانی کو بھر دو اور پرندے زمین پر بہت بڑھ جائیں ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور شام ہوئی اور صبح ہوئی ۔ سو پانچواں دِن ہوا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور خُدا نے کہا کہ زمین جانداروں کو اُنکی جِنسکے موافق چوپائے اور رینگنے والے جاندار اور جنگلی جانور اُنکی جِنس کے موافق پیدا کرے اور اَیسا ہی ہوا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور خُدا نے جنگلی جانوروں اور چوپایوں کو اُنکی جنِس کے موافق بنایا اور خُدا نے دیکھا کہ اچھا ہے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "پھر خُدا نے کہا کہ ہم اِنسان کو اپنی صُورت پر اپنی شبیہ کی مانند بنائیں اور وہ سمندر کی مچھلیوں اور آسمان کے پرندوں اور چوپایوں اور تمام زمین اور سب جانداروں پر جو زمین پر رینگتے ہیں اِختیار رکھیں ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور خُدا نے انسان کو اپنی صور ت پر پیدا کیا ۔ خُدا کی صورت پر اُسکو پیدا کیا ۔ نر و ناری اُنکو پیدا کیا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "خُدا نے اُنکو برکت دی اور کہا کہ پھلو اور بڑھو اور زمین کو معُمورو محکوم کرو اور سمندر کی مچھلیوں اور ہوا کے پرندوں اور کُل جانوروں پر جو زمین پر چلتے ہیں اِختیار رکھو ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور خُدا نے کہا کہ دیکھو میں تمام رُوی زمین کی کُل بیج دار سبزی اور ہر درخت جس میں اُسکا بیج دار زمین کی کُل بیج دار سبزی اور ہر درخت جس میں اُسکا بیج دار پھل ہو تمکو دیتا ہوں ۔ یہ تمہارے کھانے کو ہوں ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور زمین کے کل جانوروں کے لئے اور ہوا کے کُل پرندوں کے اور اُن سب کے لِئے جو زمین پر رینگنے والے ہیں جن میں زندگی کا دم ہے کُل ہری بوٹیاں کھانے کو دیتا ہوں اور اَیسا ہی ہوا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور خُدا نے سب پر جو اُس نے بنایا تھا نظر کی اور دیکھا کہ بہت اچھا ہے اور شام ہوئی اور صُبح ہوئی اور چھٹا دِن ہوا ۔",
                    },
                ],
            },
            {
                "chap_num": 2,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "سو آسمان اور زمین اور اُنکے کُل لشکر کا بنانا ختم ہُوا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور خُدا نے اپنے کام کوجِسے وہ کرتا تھا ساتویں دِن ختم کیا اور اپنے سارے کام سے جِسے وہ کررہا تھا ساتویں دِن فارغ ہُوا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور خُدا نے ساتویں دِن کو برکت دی اور اُسےمقُدس ٹھہرایا کیونکہ اُس میں خُدا ساری کائنات سے جسے اُس نے پَیدا کیا اور بنایا فارِغ ہُوا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "یہ ہے آسمان اور زمین کی پیدایش جب وہ خلق ہوئے جِس دِن خُداوند خُدا نے زمین اور آسمان کو بنایا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور زمین پر اب کھیت کا کوئی پَودا نہ تھا اور نہ مِیدان کی کوئی سبزی اب تک اُگی تھی کیونکہ خُداوند خُدا نے زمین پر پانی نہیں برسایا تھا اور نہ زمین جو تنے کو کوئی اِنسان تھا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "بلکہ زمین سے کُہر اُٹھتی تھی اور تمام رُویِ زمین کو سیراب کرتی تھی۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور خُداوند خُدا نے زمین کی مِٹی سے اِنسان کو بنایا اور اُسکے نتھنوں میں زِندگی کا دم پُھونکا تو اِنسان جیِتی جان ہُوا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور خُداوند خُدا نے مشِرق کی طرف عدنؔ میں ایک باغ لگایا اور اِنسان کو جِسے اُس نے بنایا تھا وہاں رکھّا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور خُدا وند خُدا نے ہر درخت کو جو دیکھنے میں خوشنما اور کھانے کے لئے اچھّا تھا زمین سے اُگایا اور باغ کے بیچ میں حیات کا درخت اور نیک وبد کی پہچان کا درخت بھی لگایا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور عدؔن سے ایک دریا باغ کے سیراب کرنے کو نِکلا اور وہاں سے چارندیوں میں تقسیم ہُوا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "پہلی کا نام فیسؔون ہے جو حِویلہ کی ساری زمین کو جہاں سونا ہوتا ہے گھیرے ہوئے ہے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اِس زمین کا سونا چوکھا ہے اور وہاں موتی اور سنگِ سُلیمانی بھی ہیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور دوسری ندی کا نام جیحوؔن ہے جو کُوؔش کی ساری زمین کو گھیرے ہوئے ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور تیسری ندی کا نام دِجلہؔ ہے جو اسؔور کے مشرِق کو جاتی ہے اور چَوتھی ندی کا نام فراؔت ہے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور خُداوند خُدا نے آدم کو لیکر باغِ عدنؔ میں رکھّا کہ اُسکی باغبانی اور نگہبانی کرے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور خُداوند خُدا نے آدمؔ کو حکُم دِیا اور کہا کہ تُو باغ کے ہر درخت کا پھل بے روک ٹوک کھا سکتا ہے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "لیکن نیک و بد کی پہچان کے درخت کا کبھی نہ کھانا کیونکہ جِس روز تُو نے اُس میں سے کھایا تُو مرا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور خُداوند خُدا نے کہا کہ آدمؔ کا ایکلا رہنا اچھّا نہیں ۔ میں اِس کے لِئے ایک مددگار اُسکی مانِند بناؤ نگا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور خُداوند خُدا نے کُل دشتی جانور اور ہوا کے کُل پرندے مٹی سے بنائے اور اُنکو آدمؔ کے پاس لایا کہ دیکھے کہ اُنکے کیا نام رکھتا ہے اور آدمؔ نے جِس جانور کو جو کہا وہی اُسکا نام ٹھہرا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور آدمؔ نے کُل چوپایوں اور ہوا کے پرندوں اور کُل دشتی جانوروں کے نام رکھّے پر آدمؔ کے لئے کوئی مدگار اُسکی مانِند نہ مِلا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خُداوند خُدا نے آدمؔ پر گہری نِیند بھیجی اور وہ سو گیا اور اُس نے اُسکی پسلیوں میں ایک کو نِکال لِیا اور اُسکی جگہ گوشت بھر دِیا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُداوند خُدا اُس پسلی سے جو اُس نے آدمؔ سے نکلالیِ تھی ایک عَورت بنا کر اُسے آدمؔ کے پاس لایا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور آدمؔ نے کہا کہ یہ تو اب میری ہڈیوں میں سے ہڈی اور مِیرے گوشت میں سے گوشت ہے اسلئے ناری کہلائیگی کیونکہ وہ نر سے نِکالی گئی ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اس واسطے مرد اپنے ماں باپ کو چھوڑیگا اور اپنی بیوی سے مِلا رہیگا اور وہ ایک تن ہونگے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور آدمؔ اور اُسکی بیوی دونوں ننگے تھے اور شرماتے نہ تھے۔",
                    },
                ],
            },
            {
                "chap_num": 3,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "سانپ کُل دشتی جانوروں سے جِنکو خُداوند خُدا نے بنایا تھا چالاک تھا اور اُس نے عَورت سے کہا کیا واقِعی خُدا نے کہا ہے کہ باغ کے کسی درخَت کا پھل تم نہ کھانا؟ ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "عَورت نے سانپ سے کہا کہ باغ کے درختوں کا پھل تو ہم کھاتے ہیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "پر جو درخت باغ کے بیچ میں ہے اُسکے پھل کی بابت خُدا نے کہا ہے کہ تُم نہ تو اُسے کھا نا اور نہ چھُونا ورنہ مر جاؤ گے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب سانپ نے عَورت سے کہا کہ تُم ہر گز نہ مرو گے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "بلکہ خُدا جانتا ہے کہ جس دِن تم اُسے کھاؤ گے تمہاری آنکھیں کُھل جائینگی اور تُم خُدا کے مانِند نیک و بد کے جاننے والے بن جاؤ گے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "عَورت نے جو دیکھا کہ وہ درخت کھانے کے لئے اچھا اور آنکھوں کو خُوشنما معلوم ہوتا ہے اور عقل بخشنے کے لئے خوب ہے تو اُسکے پھل میں سے لیا اور کھایا اور اپنے شوَہر کو بھی دِیا اور اُس نے کھایا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب دونوں کی آنکھیں کھل گئیں اور اُنکو معلوم ہُوا کہ وہ ننگے ہیں اور اُنہوں نے انجیر کے پتوں کو سی کر اپنے لِئے لُنگیاں بنائیں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اُنہوں نے خُداوند خُدا کی آواز جو ٹھنڈے وقت باغ میں پھرتا تھا سُنی اور آدمؔ اور اُسکی بیوی نے آپ کو خُداوند خُدا کے حضور سے باغ کے درختوں میں چھپایا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تب خُداوند خُدا نے آدمؔ کو پُکارا اور اُس سے کہا کہ تُوں کہاں ہے؟",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُس نے کہا میں نے باغ میں تیری آواز سُنی اور میں ڈرا کیونکہ میں ننگا تھا اور میں نے اپنے آپ کو چھپایا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اُس نے کہا تجھے کس نے بتایا کہ تُو ننگا ہے ؟ کیا تُو نے اُس درخت کا پھل کھایا جِسکی بابت میں نے تجھکو حُکم دیا تھا کہ اُسے نہ کھانا؟۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "آدمؔ نے کہا جِس عورت کو تُو نے میرے ساتھ کیا ہے اُس نے مجھے اُس درخت کا پھل دِیا اور میں نے کھایا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب خُدا وند خُدا نے عَورت سے کہا کہ تُو نے یہ کیا کِیا ؟ عَورت نے کہا کہ سانپ نے مجھکو بہکایا تو میں نے کھایا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور خُداوند خُدا نے سانپ سے کہا اِسلئے کہ تُونے یہ کیا تُو سب چوپایوں اور دشتی جانوروں میں ملعوُن ٹھہرا ۔ تُو اپنے پیٹ کے بل چلیگا اور اپنی عمُر بھر خاک چاٹیگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور مِیں تیرے اور عَورت کے درمیان اور تیری نسل اور عَورت کی نسل کے درمیان عداوت ڈالونگا۔ وہ تیرے سر کو کُچلیگا اور تُو اُسکی ایٹری پر کاٹیگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "پھر اُس نے عَورت سے کہا کہ میں تیرے دردِحمل کو بہت بڑھاؤنگا ۔ تُو درد کے ساتھ بچے جنیگی اور تیری رغبت اپنے شوہر کی طرف ہوگی اور وہ تجھ پر حکومت کریگا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور آدمؔ سے اُس نے کہا چُونکہ تُو نے اپنی بیوی کی بات مانی اور اُس درخت کا پھل کھایا جِسکی بابت میں نے تجھے حکم دیا تھا کہ اُسے نہ کھانا اِسلئے زمین تیرے سبب سے لعنتی ہُوئی ۔ مشقّت کے ساتھ تُو اپنی عُمر بھر اُسکی پَیداوار کھائیگا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور وہ تیرے لِئے کانٹے اور اُونٹکٹارے اُگائیگی اور تُو کھیت کی سبزی کھائیگا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تُو اپنے مُنہ کے پسینے کی روٹی کھائیگا جب تک کہ زمین میں تُو پھر لوٹ نہ جائے اِسلئے کہ تُو اُس سے نِکالا گیا ہے کیونکہ تو خاک ہے اور خاک میں پھر لوٹ جائیگا ۔ ",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور آدمؔ نے اپنی بیوی کا نام حّواؔ رکھا اِسلئے کہ وہ سب زِندوں کی ماں ہے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خُداوند خُدا نے آدمؔ اور اُسکی بیوی کے واسطے چمڑے کے کُرتے بنا کر اُنکو پہنائے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُداوند خُدا نے کہا دیکھو اِنسان نیک و بد کی پہچان مین ہم میں سے ایک کی مانِند ہو گیا ۔ اب کہیں اَیسا نہ ہو کہ وہ اپنا ہاتھ بڑھائے اور حیات کے درخت سے بھی کُچھ لیکر کھائے اور وہ ہمیشہ جیتا رہے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اِسلئے خُداوند خُدا نے اُسکو باغِ عدنؔ سے باہر کر دیا تا کہ وُہ اُس زمین کی جس میں سے وہ لیا گیا تھا کھیتی کرے۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "چنانچہ اُس نے آدمؔ کو نِکال دیا اور باغِ عدنؔ کے مشِرق کی طرف کروبیون کو اور چوگرد گُھومنے والی شعلہ زن تلوار کو رکھّا کہ وہ زندگی کے درخت کی راہ کی حِفاظت کریں۔",
                    },
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 4,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور آدمؔ اپنی بیوی حوّاؔ کے پاس گیا اور وہ حاملہ ہوئی اور اسکے قاؔئن پیدا ہوا ۔ تب اُس نے کہا مجھے خُداوند سے ایک مرد مِلا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "پھر قاؔئن کا بھائی ہابلؔ پیدا ہوا اور ہابلؔ بھیڑ بکریوں کا چرواہا اور قائِن کِسان تھا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "چند روز کے بعد یُوں ہوا کہ قاؔئِن اپنے کھیت کے پھل کا ہدیہ خُداوند کے واسطے لایا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور ہابل بھی اپنی بھیڑ بکریوں کے کُچھ پہلوٹھے بچوں کا اور کُچھ اُنکی چربی کا ہدیہ لایا اور خُداوند نے ہاؔبل کو اور اُسکے ہدیہ کو منظور کِیا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "پر قاؔئنِ کو اور اُسکے ہدیہ کو منظور نہ کیا اِسلئے قاؔئنِ نہایت غضبناک ہُوا اور اُسکا مُنہ بِگڑا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خُداوند نے قاؔئنِ سے کہا تُو کیوں غضبناک ہُوا ؟۔ اور تیرا مُنہ کیوں بگڑا ہُوا؟",
                    },
                    {
                        "verse_num": 7,
                        "text": "اگر تُو بھلا کرے تو کیا مقبول نہ ہوگا؟ اور اگر تُو بھلا نہ کرے تو گُناہ دروازہ پر دبکا بیٹھا ہے اور تیرا مُشتاق ہے پار تُو اُس پر غالب آ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور قاؔئنِ نے اپنے بھائی ہاؔبل کو کُچھ کہا اور جب وہ دونوں کھیت میں تھے تو یُوں ہوا کہ قاؔئنِ نے اپنے بھائی ہاؔبل پر حملہ کِیا اور اُسے قتل کر ڈالا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تب خُداوند نے قاؔئن سے کہا کہ تیرا بھائی ہابل کہا ہے؟ اُس نے کہا مجھے معلوم نہیں ۔ کیا میں اپنے بھائی کا مُحافظ ہُوں؟",
                    },
                    {
                        "verse_num": 10,
                        "text": "پھر اُس نے کہا تو نے کیا کِیا ؟ تیرے بھائی کا خون زمین سے مجھکو پُکارتا ہے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اب تُوزمین کی طرف سے لعنتی ہُوا۔ جس نے اپنے مُنہ پسارا کہ تیرے ہاتھ سے تیرے بھائی کا خُون لے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور زمین کو جوتے گا تو ہو اب تجھے اپنی پَیداوار نہ دیگی اور زمین پر تُو خانہ خراب اور آوارہ ہوگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب قاؔئن نے خُداوند سے کہا کہ میری سزا برداشت سے باہر ہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "دیکھ آج تُو نے مجھے رُویِ زمین سے نِکل دیا ہے اور مَیں تیرے حضور سے رُوپوش ہوجاءنگا اور زمین پر خانہ خراب اور آوارہ رہونگا اور ایسا ہوگا کہ جو کوئی مجھے پائیگا قتل کر ڈالیگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب خُداوند نے اُسے کہا نہیں بلکہ جو قاؔئِن کو قتل کرے اُس سے سات گُنا بدلہ لیا جائیگا اور خُداوند نے قاؔئِن کے لئِے ایک نِشان ٹھہرایا کہ کوئی اُسے پاکر مار نہ ڈالے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "سو قاؔئِن خُداوند کے حضور سے نِکل گیا اور عدؔن کے مشرق کی طرف نُود کے علاقہ میں جا بسا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور قاؔئِن اپنی بیوی کے پاس گیا اور وہ حاملِہ ہوئی اور اُسکے حؔنوک پَیدا ہوا اور اُس نے ایک شہر بسایا اور اُسکا نام اپنے بیٹے کے نام پر حؔنوک رکھا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور حؔنوک سے عؔیراد پَیدا ہوا اور عیؔراد سے محؔویا ایل پَیدا ہوا اور محؔویاایل سے متؔوساایل پَیدا ہوا اور متؔوساایل سے لمکؔ پیدا ہوا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور لمؔک دو عورتیں بیاہ لایا۔ ایک کا نام عدؔہ اور دُوسری کا نام ضِلّہ تھا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور عدہؔ کے یاؔبل پَیدا ہوا ۔ وہ اُن کا باپ تھا جو خیموں میں رہتےاور جانور پالتے ہیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُسکے بھائی کا نام یوؔبل تھا ۔ وہ بین اور بانسلی بجانے والوں کا باپ تھا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور ضِلّہ کے بھی توؔبلقائِن پَیدا ہوا جو پیتل اور لوہے کے سب تیز ہتھیاروں کا بنانے والاتھا اور نمعؔہ توؔبلقائِن کی بہن تھی ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور لمؔک نے اپنی بیویوں سے کہا کہ اَے عدؔہ اور ضِلؔہ میری بات سُنواَے لمؔک کی بیویو یرے سخن پر کان لگائو۔مِیں نے ایک مرد کو جس نے مجھے زخمی کیا مار ڈالا اور ایک جوان کو جس نے میرے چوٹ لگائی قتل کر ڈالا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اگر قؔائِن کا بدلہ سات گُنا لیا جائیگا تو لمؔک کا سترّ اور سات گُنا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور آدمؔ پھر اپنی بیوی کے پاس گیا اور اُسکے ایک اَور بیٹا ہُوا اور اُسکا نام سیؔت رکھاّ اور وہ کہنے لگی کہ خُدا نے ہاؔبل کے عِوض جسکو قاؔئنِ نے قتل کیا مجھے دُوسرا فرزند دیا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور سیّت کے ہاں بھی ایک بیٹا پیدا ہُوا جِسکا نام اُس نے اؔنُوس رکھاّ۔ اُس وقت سے لوگ یہوؔواہ کا نام لیکر دُعا کرنے لگے۔",
                    }, 
                ],
            },
            {
                "chap_num": 5,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "یہ آدمؔ کا نسب نامہ ہے ۔ جِس دِن خُدا نے آدمؔ آدم کو پیدا کیا تو اُسے اپنی شبِیہ پر بنایا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "نر اور ناری اُنکو پیدا کیا اور اُنکو برکت دی اور جس روز وہ خلق ہوءے اُنکا نام آدمؔ رکھا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "آدم ایک سوَ تیس برس کا تھا جب اُسکی صورت و شبِیہ کا ایک بیٹا اُسکے ہاں پیداہُوا اور اُس نے اُس نام سیت رکھاّ ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور سیؔت کی پیدایش کے بعد آدمؔ آٹھ سَو برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور آدمؔ کی کُل عمر نوَ سَو تیس برس کی ہوئی۔ تب وہ مرا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور سؔیت ایک سوَپانچ برس کا تھا جب اُس سے اُنوسؔ پیدا ہُوا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور انوُسؔ کی پیدایش کے بعد سیؔت آٹھ سو سات برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور سیؔت کی کُل عمر نَو سَو بارہ برس کی ہوئی ۔ تب وہ مرا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اُنوسؔ نوّے برس کا تھا جب اُس سے قیناؔن پَیدا ہُوا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور قِینان کی پیدایش کے بعد اُنوؔس آٹھ سو پندرہ برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُنؔوس کی کُل عُمر نَو سَو پانچ برس کی ہوئی ۔ تب وہ مرا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور قِیناؔن سترّبرس کا تھا جب اُس سے محلؔل ایل پیدا ہوا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اورمحلؔل ایل کی پَیدایش کے بعد قیؔنان آٹھ سَو چالیس برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور قیؔنان کی کُل عمر نَو سَو دس بر س کی ہوئی تب وہ مرا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور محلؔل ایل پینسٹھ برس کا تھا جب اُس سے یارؔد پَیدا ہوا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور یاؔرد کی پیدایش کے بعد محلؔل ایل آٹھ سُو تیس برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور محلؔل ایل کی عمر آٹھ سَو پچانوے برس کی ہوئی ۔ تب وہ مرا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور یارؔد ایک سُو باسٹھ برس کا تھا جب اُس سے حؔنوک پیدا ہوا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور حؔنوک کی پیدایش کے بعد یارؔد آٹھ سو برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یارؔد کی کُل عمر نَو سو باسٹھ برس کی ہوئی ۔ تب وہ مرا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور حِنوؔک پینسٹھ بر کا تھا جب اُس سے متوسلحِ پَیدا ہوا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور متؔوسِلح کی پیدایش کے بعد حؔنوک تین سو برس تک خُدا کے ساتھ ساتھ چلتا رہا اور اُس سے بیٹے اور بیٹیاں پیَدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور حؔنوک کی کُل عمر تین سَو پَینسٹھ بر س کی ہوئی ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور حؔنوک خُدا کے ساتھ ساتھ چلتا رہا اور غائِب ہو گیا کیونکہ خُدا نے اُسے اُٹھا لیا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور متؔوسِلح ایک سَو ستاسی برس کا تھا جب اُس سے لمؔک پیدا ہوا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور لؔمک کی پَیدایش کے بعد متوسِلحِ سات سو بیاسی برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور متوسلِح کی کُل عمر نو سَو اُنہتر برس کی ہوئیں ۔تب وہ مرا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور المؔک ایک سَو بیاسی برس کا تھا جب اُس سے ایک بیٹا پیدا ہوا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور اُس نے اُس کا نام نُوح رکھاّ اور کہا کہ یہ ہمارے ہاتھوں کی محنت اور مشقّت سے جو زمین کے سبب سے ہے جِس پر خُد نے لعنت کی ہے ہمیں آرام دیگا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور نُوح کی پَیدایش کے بعد لمؔک پانچ سوَو پچانوے برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پیَدا ہوئیں۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور لمؔک کی کُل عمر سات سو ستہتر برس کی ہوئی۔ تب وہ مرا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور نؔوح پانچ سوَ برس کا تھا جب اُس سے سؔم حاؔم اور یافت پیدا ہوئے۔",
                    },
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 6,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "جب رُویِ زمین پر آدمی بہت بڑھنے لگے اور اُنکے بیٹیاں پَیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تو خُدا کے بیٹوں نے آدمی کی بیٹیوں کو دیکھا کہ وہ خوبصورت ہیں اور جِنکو اُنہوں نے چُنا اُن سے بیا کر لیِا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "خُداوند نے کہا کہ میری رُوح اِنسان کے ساتھ ہمیشہ مزاحمت نہ کرتی رہیگی کیونکہ وہ بھی تو بشر ہے تَوبھی اُسکی عمُر ایک سَو بیس برس کی ہوگی ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اُن دِنوں میں زمین پر جبّار تھے اور بعد میں جب خُدا کے بیٹے اِنسان کی بیٹیوں کے پاس گئے تو اُنکے لِئےاُن سے اَولاد ہوئی ۔ یہی قدیم زمانہ کے سُورما ہیں جو بڑے نامور ہوئےہیں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب خُداوند زمین پر انسان کو پَیدا کرنے سے ملُول ہوا اور دِل میں غم کِیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور خُداوند نے کہا کہ مَیں اِنسان کو جِسے مَیں نے پَیدا کیا رُویِ زمین پر سے مِٹا ڈالونگا۔ اِنسان سے لیکر حیوان اور رینگنے والے جاندار اور ہوا کے پرندوں تک کیونکہ میں اُنکے بنانے سے ملُول ہوں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "مگر نُوح خُداوند کی نظر میں مقبول ہوا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "نُوح کا نسب بامہ یہ ہے ۔ نُوح مرچ راستباز اور اپنے زمانہ کے لوگوں میں بے عَیب تھا اور نُوحؔ خُدا کے ساتھ ساتھ چلتا رہا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس سے تین بیٹے سؔم حؔام اور یاؔفت پَیدا ہوئے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "پر زمین خُدا کے آگے ناراست ہوگئی اور وہ ظلم سے بھری تھی۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خُدا نے زمین پر نظر کی اور دیکھا کہ وہ ناراست ہوگئی ہے کیونکہ ہر بشر نے زمین پر اپنا طریقہ بگاڑ لیا تھا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور خُدا نے نُوحؔ سے کہا کہ تمام بشر کا خاتمہ میرے سامنے آپہنچا ہے کیونکہ اُنکے سبب سے زمین ظلم سے بھر گئی ۔ سو دیکھ مِیں زمین سمیت اُنکو ہلاک کرونگا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تُو گو پھر کی لکڑی کی ایک کشتی اپنے لئےبنا۔ اُس کشتی میں کوٹھریاں تیار کرنا اور اُسکے اندر اور باہر رال لگانا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اَیسا کرنا کہ کشتی کی لمباءی تین سَو ہاتھ ۔ اُسکی چَوڑائی پچاس ہاتھ اور اُسکی اُونچائی تیس ہاتھ ہو۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس کشتی میں ایک روشندان بنانا اور اُوپر سے ہاتھ بھر چھوڑ کر اُسے ختم کر دینا اور اُس کشتی کا دروازہ اُسکے پہلُو میں رکھنا اور اُس میں تین درجے بنانا ۔ نِچلا۔ دُوسرا اور تِیسرا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور دیکھ مَیں خود زمین پر پانی کا طُوفان لانے والا ہوُں تاکہ ہر بشر کو جِس میں زندگی کا دم ہے دُنیا سے ہلاک کر ڈالوں اور سب جو زمین پر ہیں مر جائینگے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "پر تیرے ساتھ مَیں اپنا عہد قائِم کرونگا اور تُو کشتی میں جانا۔ تُو اور تیرے ساتھ تیرے بیٹے اور تیری بیوی اور تیرے بیٹوں کی بیویاں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور جانوورں کی ہر قِسم میں سے دو دو اپنے ساتھ کشتی میں لے لینا کہ وہ تیرے ساتھ جیتے بچیں۔ وہ نر و مادہ ہوں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور پرندوں کی ہر قِسم میں سے اور چرندوں کی ہر قِسم میں سے اور زمین پر رینگنے والوں کی ہر قسم میں سے دو دو تیرے پاس آئیں تاکہ وہ جیتے بچیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور تُو ہر طرح کی کھانے کی چیز لیکر اپنے پاس جمع کر لینا کیونکہ یہی تیرے اور اُنکے کھانے کو ہوگا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور نُوحؔ نے یوُں ہی کِیا ۔ جَیسا خُدا نے اُسے حُکم دیا تھا وَیسا ہی عمل کیا۔",
                    },
                ],
            },
            {
                "chap_num": 7,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُدا وند نے نُوحؔ سے کہا کہ تُو اپنے پُورے خاندان کے ساتھ کشتی میں آ کیونکہ مَیں نے تجھی کو پنے سامنے اِس زمانہ میں راستباز دیکھا ہے ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "کُل پاک جانوروں میں ساتھ سات نر اور اُنکی مادہ اور اُن میں جو پاک نہیں ہیں دو دو نر اور اُنکی مادہ اپنے ساتھ لے لینا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور ہوا کے پرندوں میں سے بھی سات سات نر اور مادہ لینا تاکہ زمین پر اُنکی نسل باقی رہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "کیونکہ سات دِن کے بعد مَیں زمین پر چالیس دِن اور چالیس رات پانی برساوٗں گااور ہر جاندار شے کو جِسے مَیں نے بنایا زمین پر سے مِٹا ڈالُونگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور نُوحؔ نے وہ سب جیَسا خُداوند نے اُسے حکم دیا تھا کِیا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور نُوحؔ چھ سَوبرس کا تھا جب پانی کا طوفان زمین پر آیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب نُوحؔ اور اُسکے بیٹے اور اُسکی بیوی اور اُسکے بیٹوں کی بیویاں اُسکے ساتھ طُوفان کے پانی سے بچنے کے لئے کشتی میں گئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور پاک جانوروں میں سے اور اُن جانوروں میں سے جو پاک نہیں اور پرندوں میں سے اور زمین پر کے ہر رینگنے والے جاندار میں سے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "دو دو نر اور مادہ کشتی میں نوُحؔکے پاس گءے جَیسا خُدا نے نُوحؔ کو حُکم دیا تھا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور سات دِن کے بعد اَیسا ہوا کہ طُوفان کا پانی زمین پر آگیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "نُوحؔ کی عمُر چھ سواں سال تھا کہ اُس کے دُوسرے مہینے کی ٹِھیک سترھویں تاریخ کو بڑے سمندر کے سب سوتے پُھوٹ نِکلےاور آسمان کی کِھڑکیاں کُھل گئیں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "چالیس دِن اور چالیس رات زمین پر بارش ہوتی رہی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اُسی روز نُوحؔ اور نُوحؔ کے بیٹے سؔم اور حؔام اور یافؔت اور نُوحؔ کی بیوی اور اُسکے بیٹوں کی تینوں بیویاں۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور ہر قِسم کا جانور اور ہر قِسم کا چوپایہ اور ہر قسم کا زمین پر کارینگنے والا جاندار اور ہر قِسم کا پرندہ اور ہر قِسم کی چڑیا یہ سب کشتی میں داخِل ہوئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جو زندگی کا دم رکھتے ہیں اُن میں سے دو دو کشتی میں نُوحؔ کے پاس آئے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور جواندر آئے وہ جَیسا خُدا نے اُسے حُکم دیا تھا سب جانوروں کے نر و مادہ تھے۔ تب خُدا وند نے اُسکو باہر سے بند کر دیا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور چالیس دِن تک زمین پر طُوفان رہا اور پانی بڑھا اور اُس نے کشتی کو اُوپراُٹھا دِیا۔سو کشتی زمین پر سے اُٹھ گئی۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور پانی زمین پر چڑھتا ہی گیا اور بہت بڑھا اور کشتی پانی کے اُوپر تیرتی رہی۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور پانی زمین پر بہت ہی زیادہ چڑھا اور سب اُونچے پہاڑ جو دُنیا میں ہیں چھپ گئے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "پانی اُن سے پندرہ ہاتھ اَور اُوپر چڑھا اور پہاڑ ڈوب گئے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور سب جانور جو زمین پر چلتے تھے پرندے اور چوپائے اور جنگلی جانور اور زمین پر کے سب رینگنے والے جاندار اور سب آدمی مر گئے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُشکی کے سب جاندار جنکے نتھنوں میں زندگی کا دم تھا مرگئے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "بلکہ ہر جاندار شَے جو رُویِ زمین پر تھی مر مِٹی ۔ کیا اِنسان کیا حَیوان ۔ کیا رینگنے والا جاندار کیا ہوا کا پرندہ یہ سب کے سب زمین پر سے مرمِٹے ۔ فقط ایک نُوحؔباقی بچیا وہ جو اُسکے ساتھ کشتی میں تھے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور پانی زمین پر ایک سَو پچاس دِن تک چڑھتا رہا۔",
                    }, 
                ],
            },
            {
                "chap_num": 8,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر خُدا نے نُوحؔ کو اور کُل جانداروں اور کُل چوپایوں کو جو اُسکے ساتھ کشتی میں تھے یاد کِیا اور خُدا نے زمین پر ایک ہوا چلائی اور پانی رُک گیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور سمندر کے سوتے اور آسمان کے دریچے بند کئے گءے اور آسمان سے جو بارِش ہورہی تھی تھم گئی۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور پانی زمین پر سے گھٹتے گھٹتے ایک سو پچاس چِن کے بعدکم ہُوا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور ساتویں مہینے کی سترھویں تاریخ کو کشتی ارؔارط کے پہاڑوں پر ٹِک گئی ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور پانی دسویں مہینے تک برابر گھٹتا رہا اور دسویں مہینے کی پہلی تاریخ کو پہاڑوں کی چوٹیا نظر آئیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور چالیس دِن کے بعد یُوں ہوا کہ نُوحؔ نے کشتی کی کھڑکی جو اُس نے بنائی تھی کھولی۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے ایک کوّے کو اُڑا دِیا۔ سو وہ نِکلا اور جب تک زمین پر سے پانی سُکھ نہ گیا اِدھر اُدھر پِھرتا رہا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پھر اُس نے ایک کبُوتری کو اپنے پاس سے اُڑا دی تاکہ دیکھے کہ زمین پر پانی گھٹا یا نہیں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "پر کُبوتری نے پنجہ ٹیکنے کی جگہ نہ پاءی اور اُنکے پاس کشتی کو لَوٹ آئی کیونکہ تمام رُویِ زمین پر پانی تھا ۔ تب اُس نے ہاتھ بڑھا کر اُسے لے لِیا اور پنے پاس کشتی میں رِکھّا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور سات دِن ٹھہر کر اُس نے اُس کُبوتری کو پھر کشتی سے اُڑا دیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور وہ کُبوتری شام کے وقت اُسکے پاس لَوٹ آئی اور دیکھا تو زَیتون کی ایک تازہ پتّی اُسکی چونچ میں تھی۔ تب نُوحؔ نے معلوم کِیا کہ پانی زمین پر سے کم ہوگیا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب وہ سات دِن اور ٹھہرا۔ اِسکے بعد پھر اُس کبُوتری کو اُڑایا پر وہ اُسکے پاس پھر کبھی نہ لَوٹی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور چھ سَو پہلے برس کے پہلے مہینے کی پہلی تارِیخ کو یُوں ہوا کہ زمین پر سے پانی سُکھ گیا اور نوُحؔ نے کشتی کی چھت کھولی اور دیکھا کہ زمین کی سطح سُکھ گئی ہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور دُوسرے مہینے کی ستائیسوں تاریک کو زمین بالکل سُوکھ گئی۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب خُدا نے نُوحؔ سے کہا کہ ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "کشتی سے باہر نِکل آ۔ تُو اور تیرے ساتھ تیری بیوی اور تیرے بیٹے اور تیرے بیٹوں کی بیویاں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اُن جانداروں کو بھی باہر نِکال لا جو تیرے ساتھ ہیں کیا پرندے کیا چَوپائے کِیا زمین کے رینگنے والے جاندار تاکہ وہ زمین پر کثرت سے بچےّ دیں اور بارورہوں اور زمین پر بڑھ جائیں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب نُوحؔ اپنی بیوی اور اپنے بیٹوں اور اپنے بیٹوں کی بیویوں کے ساتھ باہر نِکلا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور سب جانور سب رینگنے والے جاندار۔ سب پرندے اور سب جو زمین پر چلتے ہیں اپنی اپنی جِنس کے ساتھ کشتی سے نِکل گئے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب نُوحؔ نے خُداوند کے لِئے ایک مذبح بنایا اور سب پاک چَوپایوں اور پاک پرندوں میں سے تھوڑے سے لیکر اُس مذبح پر سوُختنی قربانیاں چڑھائیں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خُداوند نےاُنکی راحت انگیز خوشُبولی اور خُداوند نے اپنے دل میں کہا کہ اِنسان کے سبب سے مَیں پھر کبھی زمین پر لعنت نہیں بھیجوُنگا کیونکہ اِنسان کے دِل کا خیال لڑکپن سے بُر اہے اور نہ پھر سب جانداروں کو جَیسا اب کیا ہے مارونگا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "بلکہ جب تک زمین قائمِ ہے بیج بونا اور فصل کاٹنا ۔ سردی اور تپش ۔ گرمی اور جاڑا دِن اور رات موقوف نہ ہونگے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 9,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُدا نے نُوحؔ اور اُسکے بیٹوں کو برکت دی اور اُنکو کہا کہ بارور ہو اور بڑھو اور زمین کو معمور کرو ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اورزمین کے کُل جانداروں اور ہوا کے کُل پرندوں پر تمہاری دہشت اور تمہارا رُعب ہو گا۔ یہ اور تمام کیڑے جِن سے زمین بھر پڑی ہے اور سمندر کی کُل مچھلیاں تمہارے ہاتھ میں کی گئیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "ہر چلتا پھرتا جاندار تمہارے کھانے کو ہوگا۔ ہری سبزی کی طرح میں نے سب کا سب تُم کو دیدیا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "مگر تُم گوشت کے ساتھ خون کو جو اُسکی جان ہے نہ کھانا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "مَیں تمہارے خون کا بدلہ ضرور لوُنگا ۔ ہر جانور سے اُسکا بدکہ لُونگا ۔آدمی کی جان کا بدلہ آدمی سے اور اُسکے بھائی کے بھائی بند سے لُونگا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "جو آدمی کا خون کرے اُسکا خون آدمی سے ہوگا کیونکہ خُدا نے اِنسان کو اپنی صورت پر بنایا ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور تُم بارورہون اور بڑھو اور زمین پر خُوب اپنی نسل بڑھاؤ اور بہت زیادہ ہو جاؤ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور خُدا نے نُوحؔ اور اُسکے بیٹوں سے کہا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "دیکھو مَیں خود تُم سے اور تمہارے بعد تمہاری نسل سے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور سب جانداروں سے جو تمہارے ساتھ ہیں کیا پرندے کیا چوپائے کیا زمین کے جانور یعنی زمین کے اُن سب جانوروں کے بارے میں جو کشتی سے اُترے عہد کرتا ہوں۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "مَیں اِس عہد کو تمارے ساتھ قائم رکھُونگاکہ سب جاندار طُوفان کے پانی سے پھر ہلاک نہ ہونگے اور نہ کبھی زمین کو تباہ کرنے کے لِئے پھر طوُفان آئیگا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خُدا نے کہا کہ جو عہد مَیں اپنے اور تمہارے درمیان اور سب جانداروں کے درمیان جو تمہارے ساتھ ہین پُشت در پُشت ہمیشہ کے لِئے کرتا ہوں اُسکا نِشان یہ ہے کہ ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "مَیں اپنی کمان کو بادل میں رکھتا ہوں ۔ وہ میرے اور زمین کے درمیان عہد کا نِشان ہوگی۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اَیسا ہوگا کہ جب مَیں زمین پر بادل لاؤنگا تو میری کمان بادل میں دِکھائی دیگی۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور میں پنے عہد کو جو میرے اور تمہارے اور ہر طرح کے جاندار کے دریمانن ہے یاد کرونگا اور تمام جانداروں کی ہلاکت کے لِئے پانی کا طوُفان پھِر نہ ہوگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور کمان بادل میں ہوگی اور مَیں اُس پر نِگاہ کرونگا تاکہ اُس ابدی عہد کو یاد کروں جو خُدا کے اور زمین کے سب طرح کے جاندار کے درمیان ہے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "پس خُدا نے نُوحؔسے کہا کہ یہ اُس عہد کا نِشان ہے جو مَیں اپنے اور زمین کے کُل جانداروں کے درمیان قائمِ کرتا ہوں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "نوُحؔ کے بیٹے جو کشتی سے نکلے سِؔم حاؔم اور یافؔت تھے اور حاؔم کنعاؔن کا باپ تھا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "یہی تینوں نُوحؔ کے بیٹے تھے اور اِن ہی کی نسل ساری زمین پر پَھیلی۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور نُوحؔ کاشتکاری کرنے لگا اور اُس نے ایک انُگور کا باغ لگایا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُس نے اُسکی مَے پی اور اُسے نشہ آیا اور وہ اپنے ڈیرے میں برہنہ ہوگیا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور کنعؔان ے باپ حاؔم نے اپنے باپ کو برہنہ دیکھا اور پانے دونوں بھائیوں کو باہر آکر خبر دی۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب سِؔم ور یاؔفت نے ایک کپڑا لیا اور اُسے اپنے کندھوں پر دھرا اور پیچھے کو اُلٹے چل کر گئے اور اپنے باپ کی برہنگی ڈھانکی ۔ سو اُنکے مُنہ اُلٹی طرف تھے اور اُنہوں نے اپنے باپ کی برہنگی نہ دیکھی۔",
                    },
                    {
                        "verse_num":24,
                        "text": "جب نُوحؔ اپنے مَے کے نشہ سے ہوش میں آیا تو جو اُسکے چھوٹے بیٹے نے اُسکے ساتھ کیا تھا اُسے معلوم ہوا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اُس سے کہا کہکنعؔان ملعُون ہو۔وہ اپنے بھائیوں کے غلاموں کا غلام ہوگا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "پھر کہا خُداوند سِؔم کا خُدا مبارک ہو اورکنعؔان سِؔم کا غلام ہو۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "خُدا یافؔت کو پھیلائےکہ وہ سِؔم کے ڈیروں میں بسے اور کنعؔان اُسکا غلام ہو۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور طوُفان کے بعد نُوحؔ ساڑھے تین سَو برس اَور جیتا رہا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور نُوح کی کُل عمُر ساڑھے نَو سَو برس کی ہوئی ۔ تب اُس نے وفات ",
                    },
                    
                ],
            },
            {
                "chap_num": 10,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "نُوحؔ کے بیٹوں سِمؔ حامؔ اور یافؔت کی اُولاد یہ ہیں۔ طوُفان کے بعد اُنکے ہاں بیٹے پیدا ہوئے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "بنی یاؔفت یہ ہیں ۔ حُمرؔ اور ماجوؔجاور ماؔدی اور یاوؔاناور تؔوبل اور مؔسکاور تِیراس۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "جمُرؔ کے بیٹے اشکناز اور رِیفتؔ اور تجرؔمہ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور یاوؔان کے بیٹے اِلیؔسہ اور تؔرسیس کِتؔیّ اور دوؔدانی۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "قوموں کے جزیرے اِن ہی کی نسل میں بٹ کر ہر ایک کی زبان اور قبیلہ کے مطُابق مختلف مُلک اور گروہ ہوگئے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور بنی حامؔیہ ہیں۔ کُوشؔ اور مصرؔ اور فُوطؔ اور کنعؔان ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور بنی کُوشؔ یہ ہیں ۔ سباؔ اور حوِؔیلہ اور سبؔتہ اور عؔمارہ اور سبتیکہ اور بنی رؔعماہ یہ ہیں۔ سباؔ اور دوانؔ ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور کُوشؔ سے نمُروؔد پیَدا ہوا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "وہ رُویِ زمین پر ایک سُورما ہوُا ہے اِسلئے یہ مثل چلی کہ خُداوند کے سامنے نمُؔرود سا شکاری سُورما ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس کی بادشاہی کی اِبتدا مُلک سنعؔار میں باؔبل اور اؔرک اور اکؔاد اور کلؔنہ سے ہوئی۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اُسی مُلک سے نِکل کر وہ اؔسور میں آیا اور نینوؔہ اور رؔحوبوت عیر اور کلح ؔکو۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور نیِنوہ اور کلح کے درمیان رؔسن جو بڑا شہر ہے بنایا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور مِصر سے لؔودی اور عؔنامی اور لہؔابی اور نفتوحی۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور فُتروسی اور کؔسلوحی (جن سے فؔلستی نِکلے ) اور کفؔتوری پیَدا ہوئے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور کنعؔان سے صیدؔا جو اُسکا پہلوٹھا تھا اور حِتؔ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "یبوسی اور اموری اور جِجاسی۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور حّوی اور عرقی اور سینی۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اروادی اورصمارمی اور حماتی پَیدا ہوئے اور بعد میں کنعانی قبیلے پھَیل گئے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور کنعانیوں کی حّدیہ ہے ۔ صیؔدا سے غزّؔہ تک جو جؔرار کے راستے پر ہے۔ پھر وہاں سے لسؔع تک جو صدؔوم اور عؔمورہ اور اؔدمہ اور ضِبیاؔن کی راہ پر ہے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "سو بنی حؔام یہ ہیں ۔ جو اپنے اپنے مُلک اور گروہوں میں اپنے قبیلوں اور اپنی زبانوں کے مُطابق آباد ہیں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور سِؔم کے ہاں بھی جو تمام بنی عَبرؔ کا باپ اور یاؔفت کا بڑا بھائی تھا اَولاد ہوئی۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "بنی سِؔم یہ ہیں ۔ عَیلام اور اؔسور اور ارفکَؔسداور لُودؔ اور ارؔام۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور بنی ارؔام یہ ہیں ۔ عُوضؔ اور حُوؔ ل اور جتؔر اور مؔس۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور ارؔفکسَد سے سِلحؔ پَیدا ہوا۔ اور سِلحؔ سے عِبر۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور عِبرؔ کے ہاں دو بیٹے پَیدا ہوئے ۔ ایک کا نام فؔلج تھا کیونکہ زمین اُسکے ایام میں بٹی اور اُسکے بھائی کا نام یُقطؔان تھا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اوریقطان سے الموؔداد اور سلؔف ورحصؔار ماوت اور اِراخ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور ہدؔورام اور اوؔزال اور دِقلہؔ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور عؔوبل اور ابؔی مائیل اور سِباؔ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور اؔوفیر اور حؔویلہ اور یُوباب پَیدا ہوئے۔ یہ سب بنی یُقطان تھے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور اِن کی آبادی میؔسا سے مشرق کے ایک پہاڑ سؔفار کی طرف تھی۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "سو بنی سِؔم یہ ہیں جو اپنے اپنے مُلک اور گروہوں میں اپنے قِبیلوں اور اپنی زبانوں کے مُطابق آباد ہیں۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "نُوحؔ کے بیٹوں کے خاندان اُنکی گروہوں اور نسلوں کے اِعتبار سے یہی ہیں اور طُوفان کے بعد جو قومیں زمین پر جا بجا مُنقسم ہوئیں وہ اِن ہی میں سے تھیں۔",
                    },
                    
                ],
            },
            {
                "chap_num": 11,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور تمام زمین پر ایک ہی زبان اور ایک ہی بولی تھی۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اَیسا ہوا کہ مشرق کی طرف سفر کرتے کرتے اُنکو مُلکِ سِنعاؔر میں ایک میدان مِلااور وہ وہاں بس گئے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُنہوں نے آپس میں کہا آؤ ہم اِینٹیں بنائیں اور اُنکو آگ میں خُوب پکائیں ۔ سو اُنہوں نے پتھر کی جگہ اینٹ سے اور چُونے کی جگہ گارے سے کام لِیا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "پھر وہ کہنے لگے کہ آؤ ہم اپنے واسطے ایک شہر اور ایک بُرج جِسکی چوٹی آسمان تک پہنچے بنائیں اور یہاں اپنا نام کریں ۔ اَیسا نہ ہو کہ ہم تمام رُویِ زمین پر پرگندہ ہوجائیں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور خُداوند اِس شہر اور بُرج کو جِسے بنی آدم بنانے لگے دیکھنے کو اُترا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خُداوند نے کہا دیکھو یہ لوگ سب ایک ہیں اور اِن سبھوں کی ایک ہی زبان ہے۔ وہ جو یہ کرنے لگے ہیں تو اب کُچھ بھی جسکا وہ اِرادہ کریں اُن سے باقی نہ چُھوٹیگا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "سو آؤ ہم وہاں جا کر اُنکی زان میں اِختلاف ڈالیں تاکہ وہ ایک دُوسرے کی بات سمجھ نہ سکیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پس خُداوند نے اُنکو وہاں سے تمام رُویِ زمین پر پراگندہ کِیا سو وہ اُس شہر کے بانے سے باز آئے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اسلئے اُسکا نام بابؔل ہُوا کیونکہ خُداوند نے وہاں سے خُداوند نے اُنکو تمام رویِ زمین پر پراگندہ کیا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "یہ سِمؔ کا نسب نامہ ہے۔ سِمؔ ایک سَو برس کا تھا جب اُس سے طوُفان کے دو برس بعد ارفؔکسد پَیدا ہوا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور ارفؔکسد کی پَیدایش کے بعد سِمؔ پانچ سوَ برس جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "جب ارفؔکسد پَینتیس برس کا ہُوا تو اُس سے سِؔلح پیدا ہوا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور سَؔلح کی پَیدایش کے بعد ارفؔکسد چار سَو تین برس اَور جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "سِؔلح جب تیس برس کا ہُوا تو اُس سے عِبؔر پَیدا ہوُا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور عَبرؔ کی پَیدیش کے بعد سِؔلح چار سَو تین برس اَور جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جب عِؔبر چَونتیس برس کا تھا تو اُس سے فلجؔ پیدا ہوا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جلج کی پَیدایش کے بعد عِؔبر چار سَو تیس برس اَور جیتا رہا اور اُس سے بیٹے اور بیٹیاں پیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "فلج تیس برس کا تھا جب اُس سے رؔعو پیدا ہُوا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "رؔعو کی پَیدایش کے بعد جلج دو سَو نَو برس اَور جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور رؔعوبتیس برس کا تھا جب اُس سے سرؔوج پَیدا ہوا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور سؔروج کی پَیدایش کے بع رؔعو دو سَو سات برس اَور جیتا رہا اور اپس سے بیٹے اور بیٹیاں پَیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور سؔروج تیس برس کا تھا جب اُس سے نُؔحور پَیدا ہُوا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "او ر نؔحُور کی پَیدایش کے بعد سؔروج دو سَو برس اَور جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "نؔحُور اُنتیس برس کا تھا جب اُس سے تارؔح پیدا ہوا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "تارؔح کی پَیدایش کے بعد نؔحُور ایک سَو اُنیس برس اور جیتا رہا اور اُس سے بیٹے اور بیٹیاں پَیدا ہوئیں ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور تؔارح ستر برس کا تھا جب اُس سے ابؔرام اور نؔحُور اور حاؔران پَیدا ہوئے۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور یہ تاؔرح سےابرؔام اور نؔحُور اور حؔاران پَیدا ہوئے اور حؔاران سے لُوطؔ پَیدا ہوُا ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور حؔاران اپنے باپ تاؔرح کے آگے اپنی زادبُوم یعنی کسدیوں کے اُورؔ میں مرا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور ابرؔام اور نؔحُور نے اپنا اپنا بیاہ کر لِیا۔ اَبرام کی بیوی کا نام سؔاری اور نؔحُور کی بیوی کا نام مَلکؔہ تھاجو حارؔان کی بیٹی تھی۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "وہی ملَکہ کا با اور اَسؔکہ کا باپ تھا۔ اور ساؔرَی بانجھ تھی۔ اُسکے کوءی بال بچہّ نہ تھا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تاؔرح نے اپنے بیٹے اؔبرام کو اور اپنے پوتے لُوطؔ کو جو حاؔران کا بیٹا تھا اور اپنی بہو سؔارَی کو جو اُسکے بیٹے ابرؔام کی بیوی تھ ساتھ لِیا اور اوہ سہب کسدیوں کے اُورؔ سے روانہ ہوئے کہ کنعؔان کے مُلک میں جائیں اور وہ حؔاران تک آئے اور وہیں رہنے لگے۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور تارؔح کی عمر دو سَو پانچ برس کی ہوئی اور اُس نے حاراؔن میں وفات پائی۔",
                    },
                ],
            },
            {
                "chap_num": 12,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے اؔبرام سے کہا کہ تُو اپنے وطن اور اپنے ناتے داروں کے بیچ سے اور اپنے باپ کے گھر سے نِکل کر اُس مُلک میں جاجو مَیں تجھے دِکھاؤنگا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور میں تجھے ایک بڑی قَوم بناؤنگا اور برکت دُونگا اور تیرا نام سرفراز کرونگا۔ سو تُو باعثِ برکت ہوا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "جو تجھے مبارک کہیں اُنکو میں برکت دُونگا اور جو تُجھ پر لعنت کرے اُس پر مَیں لعنت کرونگا اور زمین کے سب قبیلے تیرے وسیلہ سے برکت پائینگے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "سو ابؔرام خُداوند کے کہنے کے مُطابق چل پڑا اور لُوطؔ اُس کے ساتھ گیا اور ابرؔام پچھتر برس کا تھا جب وہ حاؔران سے روانہ ہوا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور ابراؔم نے اپنی بیوی سارَؔی اور پانے بتیجے لُوطؔ کو اسور سب ما کو جو اُنہوں نے جمع کیا تھا اور اُن آدمیوں کو جو اُنکو حارؔان میں مَل گئے تھے ساتھ لِیا اور وہ مُلک ِ کنعاؔن کو روانہ ہوئے اور مُلکِ کنعؔان میں آئے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور ابرؔام اُس مُلک مین سے گُزرتا ہوا مقامِ سِؔکم میں مؔورہ کے بلوط تک پہنچا۔ اُس وقت مُلک میں کنعانی رہتے تھے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب خُداوند نے ابرؔام کو دِکھائی دیکر کہا کہ یہی مُلک مَیں تیری نسل کو دُونگا اور اُس نے وہاں خُداوند کے لِئے جو اُسے دِکھائی دیا تھا ایک قُربان گاہ بنائی ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور وہاں سے کُوچ کر کے اُس پہار کی طرف گیا جو بیتؔ ایل کے مشرق میں ہے اور اپنا ڈیرا اَیسے لگایا کہ بیت ایل مغرب میں عُؔی مشرق میں ہے پڑا اور وہاں اُس نے خُداوند کے لئے ایک قُربان گاہ بنائی اور خُداوند سے دُعا کی۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور ابراؔم سفر کرتا کرتا جنوب کی طرف بڑھ گیا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس مُلک میں کال پڑا اور ابرؔام مؔصر کو گیا کہ ہواں ٹِکا رہے کیونکہ مُلک میں سخت کال تھا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اَیسا ہوا کہ جب وہ مؔصر میں داخِل ہونے کو تھا تو اُس نے اپنی بیوی ساؔرَی سے کہا کہ دیکھ مَیں جانتا ہوں کہ تُو دیکھنے میں خوبصورت عورت ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور یوں ہوگا کہ مصری تجھے دیکھ کر کہینگے کہ یہ اُسکی بیوی ہے۔ سو وہ مجھے توہ مار ڈالینگے۔ مگر تجھے زندہ رکھ لینگے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "سو تُو یہ کہہ دینا کہ مَیں اِسکی بہن ہوں تا کہ تیرے سبب سے میری خَیر ہواور میری جان تیری بدولت بچی رہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور یُوں ہُوا کہ جب ابرؔام مؔصر میں آیا تو مصریوں نے اُس عورت کو دیکھا کہ وہ نہایت خوبصور ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور فؔرعون کے اُمرا نے اُسے دیکھ کر فرعؔون کے حضور میں اُسکی تعریف کی اور وہ عورت فرعؔون کے گھر میں پہنچائی گئی۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس نے اُسکی خاطر ابؔرام پر اِحسان کِیا اور بھیڑ بکریاں اور گائے بیل اور گدھے اور غلام اور لَونڈیاں اور گدھیاں اور اُونٹ اُسکے پاس ہوگئے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "پر خُداوند نے فرؔعون اور اُسکے خاندان پر ابرؔام کی بیوی سارَؔی کے سبب سے بڑی بلائیں نازِل کیِں ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب فرعؔون نے ابراؔم کو بُلا کر اُس سے کہا کہ تُو نے مجھ سے یہ کِیا کیا ؟ تُو نے مجھے کیون نہ بتایا کہ یہ تیری بیوی ہے ؟",
                    },
                    {
                        "verse_num": 19,
                        "text": "یہ کیوں کہا کہ وہ میری بہن ہے۔ ؟ اِسی لِئے مَیں نے اُسے لیا کہ وہ میری بیوی بنے۔ سو دیکھ تیری بیوی حاضر ہے۔ اُسکو لے اور چلا جا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور فرعؔون نے اُسکے حق میں اپنے آدمیوں کو ہدایت کی اور اُنہوں نے اُسے اور اُسکی بیوی کو اُسکے سب مال کے ساتھ روانہ کر دیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 13,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور ابرؔام مؔصر سے اپنی بیوی اور اپنے سب مال اور لوُطؔ کو ساتھ لیکر کنعؔان کے جنوب کی طرف چلا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور ابرؔام کے پاس چَوپائے اور سونا چاندی بکثرت تھا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور وہ کنعؔان کے جنوب سے سفر کرتا ہوا بیتؔ ایل میں اُس جگہ پہنچا جہاں پہلے بیتؔایل اور عؔی کے درمیان اُسکا ڈیرا تھا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "یعنی وہ مقام جہاں اُس نے شروع میں قربان گاہ بنائی تھی اور وہاں ابرؔام نے خُداوند سے دُعا کی۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور لوُطؔ کے پاس بھی جو ابراؔم کا ہم سفر تھع بھیڑ بکریاں گائے بیل اور ڈیرے تھے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اُس مُلک میں اِتنی گنایش نہ تھی کہ وہ اِکٹھے رہیں کیونکہ اُنکے پاس اِتنا مال تھا کہ وہ اِکٹھے نہیں رہ سکتے تھے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور ابراؔم کے چرواہوں اور لوُطؔ کے چرواہوں میں جھگڑا ہوا اور کنعانی اور فرزأی اُس وقت مُلک میں رہتے تھے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب ابراؔم نے لُوطؔ سے کہا کہ میرے اور تیرے درمیان اور میرے چرواہوں اور تیرے چرواہوں کے درمیان جھگڑانہ ہُوا کرے کیونکہ ہم بھائی ہیں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "کیا یہ سارا مُلک تیرے سامنے نہیں ؟ سو تُو مجھ سے الگ ہو جا۔ اگر تُو بائیں جائے تو مَیں دہنے جاؤنگا اور اگر تُو دہنے جاٖئے تو میں بائیں جاؤنگا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب لوُطؔ نے آنکھ اُٹھا کر یرؔدن کی ساری ترائی پر جو ضُغؔر کی طرف ہے نظر دَوڑائی کیونکہ وہ اِس سے پیشتر کہ خُداوند نے سؔدوم اور عمؔورہ کو تباہ کیا خُداوند کے باغ اور مؔصر کے مُلک کی مانند خوب سیراب تھی۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "سو لُوطؔ نے یرؔدن کی ساری ترائی کو اپنے لِئے چُن لِیا اور وہ مشرق کی طرف چلا اور وہ ایک دُوسرے سے جُدا ہوگئے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "ابراؔم تو مُلک کنعان میں رہا اور لُوطؔ نے ترائی کے شہروں میں سکونت اِختیار کی اور سؔدوم کی طرف اپنا ڈیرا لگایا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور سؔدوم کے لوگ خُداوند کی نظر میں نہایت بدکار اور گنہگار تھے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور لُوطؔ کے جُدا ہو جانے کے بعد خُداوند نے ابراؔم سے کہا کہ اپنی آنکھ اُٹھا اور جِس جگہ تُو ہے وہاں سے شِمال اور جنوب اور مشرق اور مغرب کی طرف نظر دَوڑا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "کِیونکہ یہ تمام مُلک جو تُو دیکھ رہا ہے مَیں تجھ کو اور تیری نسل کو ہمیشہ کے لئے دُونگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور میں تیری نسل کو خاک کے ذرّوں کی ماند بناؤنگا اَیسا کہ اگر کوئی شخص خاک کے ذرّوں کو گِن سکے تو تیری نسل بھی گِن لی جائیگی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُٹھ اور اِس ملک کے طُول و عرض میں سَیر کر کیونکہ مَیں ااِسے تجھ کو دُونگا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور ابراؔم نے اپنا ڈیرا اُٹھایا اور ممؔزے کے بلُوطوں میں جو حبؔون میں ہیں جا کر رہنے لگا اور وہاں خُداوند کے لِئے ایک قُربان گاہ بنائی ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 14,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور سؔنعار کے بادشاہ امرؔافل اور اؔلاسر کے بادشاہ اریوؔک اور عؔیلام کے بادشاہ کِرؔلاعمر اور جؔوئیم کے بادشاہ تؔدعال کے ایام میں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "یوُں ہوا کہ اُنہوں نے سؔدوم کے بادشاہ برَعؔ اور عمؔورہ کے بادشاہ برؔشع اور ادمؔہ کے بادشاہ سنؔی اب اور ضبوئیم کے بادشاہ شؔمیبر اور باؔلع یعنی ضُغر کے بادشاہ سے جنگ کی۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "یہ سب سیّؔدم یعنی دریایِ شور کی وادی میں اِکٹھے ہوئے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "بارہ برس تک وہ کِدرؔ لا عمر کے مُطیع رہے پر تیرھوین برس اُنہوں نے سر کشی کی۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور چودھویں برس کؔدر لعطر اور اُسکے ساتھ کے بادشاہ آءے اور رفاؔئیم کو عستارات قرنیم میں اور زوزیوں کو ہاؔم میں اور اییمؔکو سَوِٰ قریتیم میں۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور حوریوں کو اُنکے کوہِ شعیرؔ میں مارتے مارتے ایلؔ فاران تک جو بیابان سے لگا ہوُا ہے آئے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "پھر وہ لَوٹ کر عَین مصفات یعنی قاؔدِس پہنچے اور عمالیقیوں کے تمام مُلک کو اور اموریوں کو جو حصیصون تمر میں رہتے تھے مارا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب سؔدوم کا بادشاہ اور عؔمورہ کا بادشاہ اور اؔدمہ کا بادشاہ اور ضؔبوئیم کا بادشاہ اور باؔلع یعنی ضُغر کا بادشاہ نِکلے اور اُنہوں نے سیؔدّیم کی وادی میں معرکہ آراءی کی ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تاکہ عیلؔام کے بادشاہ کِدر لاعمر اور جؔئیم کے بادشاہ تدعال اور سؔنعار کے بادشاہ امرؔافل اور اؔلاّسر کے بادشاہ ارؔیوک سے جنگ کریں۔ یہ چار بادشاہ اُن پانچوں کے مقابلہ میں تھے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "سؔدّیم کی وادی میں جا بجا نفت کے گڑے تھے اور سؔدوم عؔمورہ کے بادشاہ بھاگتے بھاگتے وہاں گِرے اور جو بچے پہاڑ پر بھاگ گئے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب وہ سؔدوم اور عؔمورہ کا سب ما ل اور وہاں کا سب اناج لیکر چلے گئے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اؔبراکے بھتیجے لُوطؔ کو اور اُسکے مال کو بھی لیگئے کیونکہ وہ سؔدوم میں رہتا تھا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب ایک نے جو بچ گیا تھا جاکر اؔبرام عِبرائی کو خبر دی جو اِسکال اور عؔانیر کے بائی ممرے اموری کے بلوؔطوں میں رہتا تھا اور یہ ابؔرام کے ہم عہد تھے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "جب ابؔرام نے سُنا کہ اُسکا بھائی گرفتار ہُوا تو اُس نے اپنے تین سَو اٹھارہ مشاّق خانہ زادوں کو لیکر دؔان تک اُنکا تعاقب کیِا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور رات کو اُ س نے اور اُسکے خادموں نے غول غول ہو کر اُن پر دھاوا کیا اور اُنکو مارا اور خؔوبہ تک جو دمؔشق کے بائیں ہاتھ ہے اُنکا پیچھا کِیا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ سارے مال کو اور اپنے بھائی لوُطؔ کو اور اُسکے مال اور عورتوں کو بھی اور اَور لوگوں کو واپس پھیر لایا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جب وہ کِدؔرلاعمر اور اُسکے ساتھ کے بادشاہوں کو مار کر پھا تو سؔدوم کا بادشاہ اُسکے اِستقبال کو سِؔوی کی وادی تک جو بادشاہی وادی ہے آیا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور مَلکِ صدؔق سؔالم کا بادشاہ روٹی اور مَے لایا اور وہ خُدا تعالےٰ کا کاہن تھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "او ر اُس نے اُسکو برکت دیکر کہا کہ خُدا تعالےٰکی طرف سے جو آسمان اور زمین کا مالِک ہے ابراؔم مبارک ہو۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور مبارک ہے خُدا تعالےٰ جس نے تیرے دُشموں کو تیرے ہاتھ میں کر دیا ۔ تب ابؔرام نے سب کا دسواں حصّہ اُسکو دیا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور سؔدوم کے بادشاہ نے ابرؔام سے کہا کہ آدمیوں کو مجھُے دیدے اور مال اپنے لئِے رکھ لے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "پر ابرؔام نے سؔدوم کے بادشاہ سے ککہا کہ مَیں نے خُداوند خُدا تعالےٰ آسمان اور زمین کے مالک کی قَسم کھائی ہے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "کہ مَیں نہ تو کوئی دھاگا نہ جُوتی کا تسمہ نہ تیری اَور کوئی چیز لُون تاکہ تویہ نہ کہے سکے کہ مَیں نے ابرؔام کو دَولتمند بنا دیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "سِو اُسکے جو جوانوں نے کھا لِیا اور اُن آدمیوں کے حصِّے کے جو میرے ساتھ گئے۔ سو عؔانیر اور اؔسکال اور مؔمرے اپنا اپنا حصہِ لے لیں ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 15,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اِن باتوں کے بعد خُداوند کا کلام رویا میں ابرؔام پر نازِل ہوا اور اُس ن ے فرمایا اَے ابراؔم تو مت ڈر۔ مَیں تیری سپر اور تیرا بہت بڑا اجر ہُوں۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "ابرؔام نے کہا اَے خُداوند خُدا تُو مجھے کیا دیگا؟ کیونکہ مَیں تو بے اَولاد جاتا ہُوں اور میرے گھر کا مُختار دمشقی الِیؔعز ہے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "پِھر ابرؔام نے کہا دیکھ تُو نے مجُھے کوئی اَولاد نہیں دی اور دیکھ میرا خاِنہ زاد میرا وارِث ہوگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب خُداوند کا کلام اُس پر نازِل ہُوا اور اُس نے فرمایا یہ تیرا وارِث نہ ہوگا بلکہ وہ جو تیرے صُلب سے پَیدا ہوگا وُہی تیرا وارِث ہوگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ اُسکو باہر لے گیا اور کہا کہ اب آسمان کی طرف نگاہ کر اور اگر تُو ستاروں کو گِن سکتا ہے توگِن اور اُس سے کہا کہ تیری اَولاد اَیسی ہی ہوگی۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور وہ خُداوند پر ایمان لایا اور اِسے اُس نے اُسکے حق میں راستبازی شمار کیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے اُس سے کہا کہ مَیں خُداوند ہُوں جو تُجھے کسدیوں کے اُؔور سے نِکال لیا کہ تُجھکو یہ مُلک میراث میں دُوں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اُس نے کہا اَے خُداوند خُدا ! مَیں کیونکر جانُوں کہ مَیں اُسکا وارِث ہُونگا؟",
                    },
                    {
                        "verse_num": 9,
                        "text": "اُس نے اُس سے کہا کہ میرے لئے تین برس کی ایک بچھیا اور تین برس کا ایک بکری اور تین برس کا ایک میڈھا اور ایک قُمری اور ایک کبُوتر کا بچہّ لے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُس نے اُن سبھوں کو لِیا اور اُنکو بیچ سے دو ٹُکڑے کِیا اور ہر ٹُکڑے کو اُسکے ساتھ کے دُوسرے ٹُکڑے کے بقابل رکھاّ مگر پرندوں کے ٹُکڑے نہ کِئے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب شکاری پرنِدے اُن ٹکڑوں پر جپٹنے لگے پر ابرؔام اُنکو ہٹکاتا رہا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "سُورج ڈُبتے وقت ابرؔام پر گہری نِیند غالِب ہوئی اور دیکھو ایک بڑی ہَولناک تاریکی اُس پر چھا گئی ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اُس نے ابراؔم سے کہا یقین جان کہ تیری نَسل کے لوگ اَیسے مُلک میں جو اُنکا نہیں پردیسی ہونگے اور وہاں کے لوگوں کی غلامی کرینگے اور وہ چار سَو برس تک اُنکو دُکھ دینگے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "لیکن مَیں اُس قوم کی عدالت کرونگا جِسکی وہ غلامی کرینگے اور بعد میں بڑی دَولت لیکر وہاں سے نِکل آئینگے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور تُو صحیح سلامت اپنے باپ دادا سے جامِلیگا اور نہایت پِیری میں دفن ہوگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ چَوتھی پُشت میں یہاں لَوٹ آئینگے کیونکہ اموریوں کے گُناہ اب تک پُورے نہیں ہُوئے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جب سُورج ڈُوبا اور اندھیرا چھا گیا تو ایک تنوُر جِس میں سے دُھواں اُٹھتا تھا دِکھائی دِیا اور ایک جلتی مشعل اُن ٹکڑوں کے بیِچ میں سے ہو کر گُذری۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اُسی روز خُداوند نے ابراؔم سے عہد کِیا اور فرمایا کہ یہ مُلک دریایِ مصؔر سے لیکر اُس بڑے دیرا یعنی دریایِ فراؔت تک۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "قینیوں اور قنیزیوں اور قدمُونیوں۔ ",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور حِتّیوں اور فِرزیوں اور فائیم۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اموریوں اور کنعانیوں اور جرجاسِیوں اور یبوسیوں سمیت میں نے تیری اَولاد کو دِیا ہے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 16,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور ابراؔم کی بِیوی ساؔری کے کوئی اَولاد نہ ہُوئی۔ اُسکی ایک مصری لوَنڈی تھی جِسکا نام ہاؔجرہ تھا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور ساؔرَی نے ابرؔام سے کہا کہ دیکھ خُداوند نے مجھے تو اَولاد سے محروم رکھا ہے سو تُو میری لَونڈی کے پاس جا شاید اُس سے میرا گھر آباد ہو اور ابؔرام نے ساؔرَی کی بات مانی۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور ابرؔام کو مُلک کنعاؔن میں رہتے دس برس ہوگئے تھے جب اُسکی بیوی سؔارَی نے اپنی مصری لَونڈی اُسے دی کہ اُسکی بیوی بنے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور وہ ہاجرہ کے پاس گیا اور وہ حامِلہ ہو گئی تو اپنی بی بی کو حقیر جاننے لگی ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب ساؔرَی نے ابرؔام سے کہا کہ جو ظُلم مجھ پر ہُوا وہ تیری گردن پر ہے۔ مَیں نے اپنی لَونڈی تیرے آغوش میں دی اور اب جو اُس نے آپ کو حامِلہ دیکھا تو مَیں اُسکی نظر میں حقیر ہوگئی۔ سو خُداوند میرے اور تیرے درمیان انصاف کرے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "ابراؔم نے سؔارَی سے کہا کہ تیری لَونڈی تیرے ہاتھ میں ہے جو تجھے بھلا دِکھا۴ی دے سو اُسکے ساتھ کر ۔ تب ساؔرَی اُ س پر سختی کرنے لگی اور وہ اُکے پاس سے بھاگ گئی۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور وہ خُداوند کے فرشتہ کو بیابان میں پانی کے ایک چشمہ کے پاس مِلی۔ یہ وہی چشمہ ہے جو شؔور کی راہ پر ہے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اُس نے کہا اَے ساؔرَی کی لَونڈی ہاؔجرہ تُو کہا سے آئی اور کِدھر جاتی ہے؟ اُس نے کہا کہ مَیں اپنی بی بی ساؔرَی کے پاس سے بھاگ آئی ہُوں۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "خُداوند کے فرشتہ نے اُس سے کہا کہ مَیں تیری اَولاد کو بہت بڑھاؤنگا یہاں تک کہ کثرت کے سبب سے اُسکا شمار نہ ہوسکیگا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور خُداوند کے فرشتہ نے اُس سے کہا کہ تُو حامِلہ ہے اور تیرے بیٹا ہوگا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اُس کا نام اسِمعیٰل رکھتا اِسلئے کہ خُداوند نے تیر دُکھ سُن لِیا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "وہ گرخر کی طرح آزاد مرد ہوگا۔ اُسکا ہاتھ سب کے خِلاف اور سب ہاتھ اُسکے خِلاف ہونگے اور وہ اپنے سب بھائیوں کے سامنے بسا رہیگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور ہاؔجرہ نے خُداوند کا جِس نے اُس سے باتیں کیِں اتاؔایل روٹ نام رکھاّ یعنی اَے خُدا تو بصیر ہے کیونکہ اُس نے کہا کیا مَیں نے یہاں بھی اپنے دیکھنے والے کو جاتے ہوئے دیکھا؟",
                    },
                    {
                        "verse_num": 14,
                        "text": "اَسی سبب سے اُس کُوئیں کا نام بیرؔلحی روٹی پڑ گیا۔ وہ قاؔدِس اور بؔرِد کے درمیان ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور ابرؔام سے ہاجرؔہ کے ایک بیٹا ہُوا اور ابراؔم نے اپنے اُس بیٹے کا نام جو ہاؔجرہ سے پَیدا ہُوا اِسمعٰیل رکھا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور جب ابرام سے ہاؔجرہ کے اِسمٰعیل پَیدا ہُوا تب ابرؔام چھیاسی برس کا تھا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 17,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "جب ابرؔام نِنانوے برس کا ہُوا تب خُداوند ابراؔم کو نظر آیا اور اُس سے کہا کہ مَیں خُدایِ قادِر ہُوں ۔ تو میرے حضور میں چل اور کامِل ہو۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور میں اپنے اور تیرے درمیان عہد باندھونگا اور تجھے بہت زیادہ بڑھاؤنگا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تب ابراؔم سرنگو ہوگیا اور خُدا نے اُس سے ہمکلام ہو کر فرمایا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "کہ دیکھ میرا عہد تیرے ساتھ ہے اور تو سب قوموں کا باپ ہوگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور تیرا نام پِھر ابراؔم نہیں کہلائیگا بلکہ تیرا نام ابرؔہام ہوگا کیونکہ مَیں تجھے بہت قوموں کا باپ ٹھہرا دیا ہے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور مَیں تجھے بہت برومند کرونگا اور قومیں تیری نسال سے ہونگی اور بادشاہ تیری اَولاد میں سے برپا ہونگے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اورمَیں اپنے اور تیرے درمیان اور تیرے بعد تیری نسال کے درمیان اُنکی سب پُشتوں کے لئے اپنا عہد جو ابدی عہد ہوگا باندھُونگا تاکہ مَیں تریا اور تیرے بعد تیری نسال کا خُدا رہُوں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور مَیں تجھ کو اور تیرے بعد تیری نسل کو کنؔعان کا تمام مُلک جِس میں تُو پردیسی ہے اَیسا دُونگا کہ وہ دائمی مِلکیت ہو جائے اور مَیں اُنکا خُدا ہُونگا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "پِھر خُدانے ابرؔہام سے کہا کہ تُو میرے عہد کو ماننا اور تیرے بعد تیری نسل پُشت در پُشت اُسے مانے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور میرا عہد جو میرے اور تیرے درمیان اور تیرے بعد تیری نسل کے دریمان ہے اور جِسے تم مانو گے سو یہ ہے کہ تُم میں سے ہر ایک فرزند ِ نرینہ کا ختنہ کِیا جائے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور تُم اپنے بدن کی کھلڑی کا ختنہ کِیا کرنا۔ اور یہ اُس عہد کا نِشان ہوگا جو میرے اور تمہارے درمیان ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پُشت در پُشت ہر لڑکے کا ختنہ جب وہ آٹھ روز کا ہو کِیا جائےخواہ وہ گھر میں پیدا ہو خواہ اُسے کِسی پردیسی سے خریدا ہو جو تیری نسل سے نہیں۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "لازم ہے کہ تیرے خانہ زاد اور تیرے زر خرید کا ختنہ کِیا جائے اور میرا عہد تمہارے جِسم میں ابدی عہد ہوگا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور وہ فرزندِ نرینہ جِسکا ختنہ نہ ہُوا جِسکا ختنہ نہ ہُوا ہو اپنے لوگوں میں سے کاٹ ڈالا جائے کیونکہ اُس نے میرا عہد توڑا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور خُدا نے ابرؔام سے کہا کہ ساؔرَی جو تیری بیوی ہے سو اُسکو ساؔرَی نہ پُکارنا۔ اُسکا نام ساؔرہ ہوگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اورمَیں اُسے برکت دُونگا اور اُس سے بھھی تجھے ایک بیٹا بخشونگا ۔ یقیناً مَیں اُسے برکت دونگا کہ قَومیں اُسکی نسل سے ہونگی اور عالم کے بادشاہ اُس سے پَیدا ہونگے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب ابرہؔام سرنگو ہُوا اور ہنس کر چِل میں کنہے لگا کہ کیا سَو برس کے بُڈّھے سے کوئی بچہّ ہوگا اور کیا ساؔرہ کے جو نوّے برس کی ہے اولاد ہوگی؟",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور ابرؔہام نے خُدا سے کہا کہ کاش اِسمٰعیل ہی تیرے حضور جیتا رہے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تب خُدا نے فرمایا کہ بیشک تیری بیوی ساؔرہ کے تجھ سے بیٹا ہوگا تُو اُسکا نام اِضؔحاق رکھنا اور مَیں اُس سے اور پھر اُسکی اولاد سے اپنا عہد جو ابدی عہد ہے باندھُونگا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اِسؔمعیل کے حق میں بھی میں نے تیری دُعا سُنی ۔ دیکھ مَیں اُسے برکت دُونگا اور اُسے برومند کرونگا اور اُسے بڑھاؤنگا اور اُس سے بارہ سردار پیَدا ہونگے اورمَیں اُسے بڑی قوم بناؤنگا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "لیکن مَیں اپنا عہد اِضؔحاق سے باندھُونگا جو اگلے سال اِسی وقت مُعیّن پر ساؔرہ سے پَیدا ہوگا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور جب خُدا ابرؔہام سے باتیں کر چُکا تو اُسکے پاس سے اُوپر چلا گیا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب ابرؔہام نے اپنے بیٹے اِسؔمٰعیل کو اور سب خانہ زادوں اور اپنے سب زرخریدوں کو عینی اپنے گھر کے سب مردوں کو لِیا اور اُسی روز خُدا کے حُکم کے مُطابق اُنکا ختنہ کیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "ابرؔہام نِناّنوے برس کا تھا جب اُسکا ختنہ ہُوا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور جب اُسکے بیٹے اِسؔمٰعیل کا ختنہ ہُوا تو وہ تیرہ برس کا تھا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "ابرؔہام اور اُسکے بیٹے اِسؔمٰعیل کا ختنہ ایک ہی دِن ہُوا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اُسکے گھر کے سب مردوں کا ختنہ خانہ زادوں اور اُنکا بھی جو پردیسیوں سے خریدے گئے تھے اُسکے ساتھ ہُوا۔",
                    },
                      
                ],
            },
            {
                "chap_num": 18,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پِھر خُداوند ممؔرے کے بلُوطوں مین اُسے نظر آیا اور وہ دِن کو گرمی کے وقت اپنے خیمہ کے دروازہ پر بیٹھا تھا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اُ نے اپنی آنکھیں اُٹھا کر نظر کی اور کِیا دیکھتا ہے کہ تین مرد اُسکے سامنے کھٹرے ہیں ۔ وہ اُنکو دیکھ کر خیمہ کے دروازہ سے اُن سے مِلنے کو دَوڑ ا اور زمین تک جُکا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور کہنے لگا کہ اَے میرے خُداند اگر مجھ پر آپ نے کرم کی نظر کی ہے تو اپنے خادِم کے پاس سے چلے نہ جائیں۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "بلکہ تھوڑا سا پانی لایا جائے اور آپ اپنے پاؤں دھو کر اُس درخت کے نیچے آرام کریں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "مَیں کچھ روٹی لاتا ہُوں ۔ آپ تازہ دم ہوجائیں ۔ تب آگے بڑھیں کیونکہ آپ اِسی لِئے اپنے خادِم کے ہاں آئے ہیں ۔ اُنہوں نے کہا جَیسا تُو نے کہا ہے وَیسا ہی کر۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور ابرؔہام ڈیرے میں ساؔرہ کے پاس دَوڑا گیا اور کہا کہ تین پَیمانہ باریک آٹا جلد لے اور اُسے گوندھ کر پُھلکے بنا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور ابرؔہام گلہّ کی طرف دَوڑا اور ایک موٹا تازہ بچھڑا لا کر ایک جوان کو دِیا اور اُس نے جلدی جلدی اُسے تیا کیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پَھر اُس نے مکھن اور دُودھ اور اُس بچھڑے کو جو اُس نے پکوایا تھا لیکر اُنکے سامنے رکھاّ اور آپ اُنکے پاس درخت کے نیچے کھڑا رہا اور اُنہوں نے کھایا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "پھر اُنہوں نے اُس سے پُوچھا کہ تیری بیوی سارؔہ کہا ہے؟ اُس نے کہا وہ ڈیرے میں ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب اُس نے کہا مَیں پھر موسمِ بہار میں تیرے پاس آؤنگا اوردیکھ تیری بیوی سارؔہ کے بیٹا ہوگا ۔ اُسکے پیچھے دیرے کا دروازہ تھا ۔ سارؔہ وہاں سے سُن رہی تھی۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور ابرؔہام اور سارؔہ ضعیف اور بڑی عمر کے تھے اور سارؔہ کی وہ حالت نہیں رہی تھی جو عورتوں کی ہوتی ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب سارؔہ نے اپنے دِل میں ہنس ہر کہا کِیا اِس قدر عُمر رسیدہ ہونے پر بھی میرے لئِے شادمانی ہو سکتی ہے حالانکہ میرا خاوند بھی ضیعف ہے ؟",
                    },
                    {
                        "verse_num": 13,
                        "text": "پِھر خُداوند نے ابرؔہام سے کہا کہ ساؔرہ کیوں یہ کہکر ہنسی کہ کیا میرے جو اَیسی بُڑھیا ہُوں واقعی بیٹا ہوگا؟",
                    },
                    {
                        "verse_num": 14,
                        "text": "کیا خُداوند کے نزدیک کوئی بات مُشکل ہے؟ موسمِ بہار میں مُعیّن وقت پر میں تیرے پاس پِھر آؤنگا اور ساؔرہ کے بیٹا ہوگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب ساؔرہ اِنکار کر گئی کہ مَیں نہٰن ہنسی کیونکہ وہ ڈرتی تھی ۔ پر اُس نے کہا نہیں تُو ضرور ہنسی تھی۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تب وہ مرد وہاں سے اُٹھے اور اُنہوں نے سؔدوم کا رُخ کیا اور ابراہام اُنکو رُخصت کرنے کو اُنکے ساتھ ہو لِیا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور خُدواند نے کہا کہ جو کُچھ مَیں کو ہوُں کِیا اُسے ابرؔہام سے پوشیدہ رکھُوّں؟",
                    },
                    {
                        "verse_num": 18,
                        "text": "ابراؔہام سے تو یقیناً ایک ؓری اور زبردست قَوم پَیدا ہوگی اور زمین کی سب قومیں اُسکے وسیلہ سے برکت پائینگی ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "کیونکہ مَیں جانتا ہُوں کہ وہ اپنے بیٹوں اور گھرانے کو جو اُسکے پیچھے رہ جائینگے وصِیت کریگا کہ وہ خُداوند کی رہ میں قائم رہ کر عدل اور اِنصاف کریں تا کہ جو کچھ خُداوند نے ابرؔہام کے حق میں فرمایا ہے اُسے پُورا کرے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "پِھر خُداوند نے فرمایا چونکہ سؔدوم اور عؔمورہ کا شور بڑھ گیا اور اُنک جُرم نہایت سنگین ہو گیا ہے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اِسلئے مَیں اب جا کر دیکھونگا کہ کیا اُنہوں نے سراسر وَیسا ہی کِیا ہے جَیسا شور میرے کان تک پہنچا ہے اور اگر نہیں کِیا تو مَیں معلوم کو لُونگا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "سو وہ مرد وہاں سے مُڑے اور سِؔدوم کی طرف چلے پر ابرؔہام خُداوند کے حضور کھڑا رہا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب ابرؔہام نے نزدیک جا کر کہا کیا تُو نیک کو بد کے ساتھ ہلاک کریگا؟",
                    },
                    {
                        "verse_num": 24,
                        "text": "شاید اُس شہر میں پچاس راستباز ہوں ۔ کیا تُو اُسے ہلاک کریگا اور اُن پچاس راستبازوں کی خاطر جو اُس میں ہوں اُس مقام کو نہ چھوڑیگا؟",
                    },
                    {
                        "verse_num": 25,
                        "text": "اَیسا کرنا تجھ سے بعید ہے کہ نیک کو بد کے ساتھ مار ڈالے اور نیک بد کے برابر ہو جائیں ۔ یہ تجھ سے بعید ہے ۔ کِیا تمام دُنیا کا اِنصاف کرنے والا اِنصاف نہ کریگا ؟",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور خُداوند نے فرمایا کہ اگر مُجھے سؔدُوم میں شہر کے اندر پچاس راستباز مِلیں تو مَیں اُنکی خاطر اُس مقام کو چھوڑ دُونگا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "تب ابرؔہام نے جواب دِیا اور کہا دیکھئے! مَیں نے خداوند سے بات کرنے کی جُرات کی اگرچہ مَیں خاک اور راکھ ہُوں۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "شاید پچاس راستبازوں میں پانچ کم ہوں ۔ کیا اُن پانچ کی کمی کے سبب سے تُو تمام شہر کو نیست کریگا؟ اُس نے کہا اگر مُجھے وہاں پَینتالیس مِلیں تو مَیں اُسے نیست نہیں کرونگا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "پِھر اُس نے کہا کہ شاید وہاں چالِیس مِلیں ۔ تب اُس نے کہا کہ مَیں اُن چالیس کی خاطر بھی یہ نہیں کرونگا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "پھر اُس نے کہا خُداوند ناراض نہ ہو تو مَیں کُچھ اَور عرض کرو۔ شاید وہاں تیس مَلیں۔ اُس نے کہا ۔ اگر مُجھے وہاں تیس بھی مِلیں تو بھی اَیسا نہیں کرونگا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "پِھر اُس نے کہا دیکھئے ! مَیں نے خُداوند سے بات کرنے کی جُراٗت کی ۔ شاید وہاں بیِس مِلیں ۔ اُس نے کہا مَیں بِیس کی خاطرِ ھی اُسے نیست نہیں کرونگا۔ تب اُس نے کہا مَیں بیِس کی خاطِر بھی اُسے نیست نہیں کرونگا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "تب اُس نے کہا خُداوند ناراض نہ ہو تو مَیں دس کی خاطِر بھی اپسے نیست نہیں کرونگا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "جب خُداوند ابرؔہام سے باتیں کر چُکا تو چلا گیا اور ابرؔہام اپنے مکان کو لَوٹا",
                    },
                    
                ],
            },
            {
                "chap_num": 19,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور وہ دونوں فرشتے شام کو سؔدُوم میں آئے اور لؔوُط سؔدُوم کے پھاٹک پر بَیٹھا تھا اور لؔوُط اُنکو دیکھ کر اُن کے اِستقبال کے لئے اُٹھا اور زمین تک جُھکا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور کہا اَے میرے خُداوند اپنے خادِم کے گھر تشریف لے چلئے اور رات بھر آرام کیجئے اور اپنے پاؤں دھوئیے اور صُبح اُٹھکر اپنی راہ لَیجئے اور اُنہوں نے کہا نہیں ہم چَوک ہی میں رات کاٹ لینگے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "لیکن جب وہ بہت بجِد ہُوا تو وہ سُسکے ساتھ چل کر اُسکے گھر میں آئے اور اُس نے اُنکے لِئے ضیافت تیار کی اور بے خمیری روٹی پکائی اور اُنہوں نے کھایا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اِس سے پیشتر کہ وہ آرام کرنے کے لِئے لیتیں سؔدُوم شہر کے مردوں نے جوان سے لیکر بُڈھے تک سب لوگوں نے ہر طرف سے اُس گھر کو گھیر لیا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُنہوں نے لؔوُط کو پُکار کر اُس سے کہا وہ مرد جو آج رات تیرے ہاں آئے کہاں ہیں؟ اُنکو ہمارے پاس باہر لے آ تاکہ ہم اُن سے صحبت کریں۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب لؔوُط نِکل کر اُنکے پاس دروازہ پر گیا اور اپنے پیچھے کواڑ بند کر دیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور کہا کہ اَے بھائیو! اَیسی بدی تو نہ کرو۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "دیکھو! میری دوبیٹیان ہیں جو مرد سے واقف نہیں ۔ مرضی ہو تو مَیں اُنکو تمہارے پاس لے آؤں اور جو تُمکو بھلا معلوم ہو اُن سے کرو۔ مگر اِن مردوں سے کُچھ نہ کہنا کیونکہ وہ اِسی واسطے میری پناہ میں آئے ہیں۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اُنہوں نے کہا یہاں سے ہٹ جا۔ پِھر کہنے لگے کہ یہ شخص ہمارے درمیان قیام کرنے آیا تھا اور اب حکومت جتاتا ہے ۔ سو ہم تیرے ساتھ اُن سے زیادہ بدسلوکی کرینگے ۔ تب وہ اُس مرد یعنی لؔوُط پر پِل پڑے اور نزدیک آئے تاکہ کِواڑ توڑ ڈالیں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "لیکن اُن مردوں نے اپنے ہاتھ بڑھا کر لؔوُط کو اپنے پاس گھر میں کھینچ لیا اور دروازہ بند کردیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُن مردوں کو جو گھر کے دروازہ پر تھے کیا چھوٹے کیا بڑے اندھا کر دیا۔ سو وہ دروازہ ڈھونڈتے ڈھونڈتے تھک گئے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب اپن مردوں نے لؔوُط سے کہا کیا یہاں تیرا اور کوئی ہے ۔؟۔ داماد اور اپنے بیٹوں اور بیٹیوں اور جو کئی تیرا ِس شہر میں ہو سب کو اِس مقام سے باہر نِکال لے جا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "کیونکہ ہم اِس مقام کو نیست کرینگے اِسلئے کہ اُنکا شور خُداوند کے حضوربہت بلند ہُوا ہے اور خُداوند نے اُسے نیست کرنے کو ہمیں بھیجا ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب لؔوُط نے باہر جاکر اپنے دامادوں سے جنہوں نے اُسکی بیٹیاں بیاہی تھیں باتیں کیں اور کہا کہ اُٹھواور اِس مقام سے نِکلو کیونکہ خُداوند اِس شہر کو نیست کریگا۔ لیکن وہ اپنے دامادوں کی نظر میں مُضحِک سا معلوم ہُوا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "جب صُبح ہوئی تو فرشتوں نے لؔوُط سے جلدی کرائی اور کہا کہ اُٹھ اپنی بیوی اور اپنی دونوں بیٹیوں کو جو یہاں ہیں لے جا۔ اَیسا نہ ہو کہ تُو بھی اِس شہر کی بدی میں گرفتار ہو کر ہلاک ہو جائے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "مگر اُس نے دیر لگائی تو اُن مردوں نے اُسکا اور اُسکی بیوی اور اُسکی دونوں بیٹیوں کا ہاتھ پکڑا کیونکہ خُداوند کی مہربانی اُس پر ہوئی اور اُسے نِکال کی شہر سے باہر کر دیا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور یُوں ہُوا کہ جب وہ اپنکو باہر نِکال لائے تو اُس نے کہا اپنی جان بچانے کو بھاگ۔ نہ تو پیچھے مُڑ کر دیکھنا نہ کہیں مَیدان میں ٹھہرنا۔ اُس پہاڑ کو چلا جا۔ تانہ ہو کہ تو ہلاک ہو جائے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "لؔوُط نے اُن سے کہا کہ اَے میرے خُداوند اَیسا نہ کر۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "دیکھ تُو نے اپنے خادم پر کرم کی نظر کی ہے اور اَیسا فضل کِیا کہ میری جان بچائی ۔ مَیں پہاڑ تک جا نہیں سکتا۔ کہیں اَیسا نہ ہو کہ مجھ پر مُصیبت آپڑے اور مَیں مر جاؤں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "دیکھ یہ شہر اَیسا نزدیک ہے کہ وہاں بھاگ سکتا ہوُں اور یہ چھوٹا بھی ہے ۔ اِجازت ہو تو میں وہاں چلا جاؤں ۔ وہ چھوٹا سا بھی ہے ۔ اور میری جان بچ جائیگی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اُس نے اُس سے کہا کہ دیکھ مَیں اِس بات میں بھی تیرا لحاظ کرتا ہوں کہ اِس شہر کو جِسکا تو نے ذِکر کیا ہے غارت نہیں کرونگا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "جلدی کر اور وہاں چلا جا کیونکہ مَیں کچھ نہیں کر سکتا جب تک کہ تُو وہاں پہنچ نہ جائے۔ اَسی لئے اُس شہر کا نام ضُؔغر کہلایا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور زمین پر دُھوپ نِکل چُکی تھی جب لؔوُط ضُؔغر میں داخل ہُوا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب خُداوند نے اپنی طرف سے سؔدُوم اور عؔمورہ پر گندھک اور آگ آسمان سے برسائی۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اُس نے اُن شہر وں کو اور اُس ساری ترائی کو اور اُن شہروں کے سب رہنے والون کو اور سب کُچھ جو زمین سے اُگا تھا غارت کِیا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "مگر اُسکی بیوی نے اُسکے پیچھے سے مُڑ کر دیکھا اور وہ نمک کا سُتون بن گئی۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور ابرؔہام صبح سویرے اُٹھ کر اُس جگہ گیا جہاں وہ خُداوند کے حضور کھڑا ہوا تھا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اُس نے سؔدُم اور عؔمورہ اور اُس ترائی کی ساری زمین کی طف نظر کی اور کیا دیکھتا ہے کہ زمین پر سے دُھوان اِیسا اُٹھ رہا ہے جَیسے بھٹیّ کا دُھواں ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور یُوں ہُوا کہ جب خُدا نے اُس ترائی کے شہروں کو نیست کِیا تو خُدا نے ابرؔہام کو یاد کیا اور اُن شہروں کو جہاں لؔوُط رہتا تھا غارت کرتے وقت لؔوُط کو اُس بلا سے بچایا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور لؔوُط ضُغؔر سے نِکل کر پہاڑ پر جا بسا اور اُس کی دونوں بیٹیاں اُسکے ساتھ تھیں کیونکہ اُسے ضُؔغر میں بستے ڈرلگا اور وہ اور اُسکی دونوں بیٹیاں ایک غار میں رہنے لگے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب پہلوٹھی نے چھوٹی سے کہا کہ ہمارا باپ بُڈ ّھا ہے اور زمین پر کوئی مرد نہیں جو دُنیا کے دستور کے مُطابق ہمارے پاس آئے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "آؤ ہم اپنے باپ کو مِے پِلائیں اور اُس سے ہم آغوش ہوں تاکہ اپنے باپ سے نسل باقی رکھّیں ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "سو اُنہوں نے اُسی رات اپنے باپ کو مِے پِلائی اور پہلوٹھی اندر گئی اور اپنے باپ سے ہم آغوش ہوئی پر اُس نے نہ جانا کہ وہ کب لیتی اور کب اُٹھ گئی۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور دُوسرے روز یُوں ہُوا کہ پہلوٹھی نے چھوٹی سے کہ کہ دیکھ کل رات کو میں اپنے باپ سے ہم آغوش ہوئی۔آؤ آج رات بھی اُسکو مَے پِلائیں اور تُو بھی جا کر اُس سے ہم آغوش ہو تا کہ ہم اپنے باپ سے نسل باقی رکھّیں ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "سو اُس رات بھی اُنہوں نے اپنے باپ کو مَے پِلائی اور چھوٹی گئی اور اُس سے ہم آغوش ہوئی پر اُس نے نہ جانا کہ وہ کب لیٹی اور کب اُٹھ گئی ۔ ",
                    },
                    {
                        "verse_num": 36,
                        "text": "سو لؔوُط کی دو بیٹیاں اپنے باپ سے حاملہ ہُوئیں ۔ ",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور بڑی کے ایک بیٹا ہُوا اور اُس نے اُس کا نام مؔوآب رکھا۔ وُہی موآبیوں کا باپ ہے جو اب تک موجود ہیں ۔ ",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور چھوٹی کے بھی ایک بیٹا ہُوا اور اُس نے اُسکا نام بِن عمی رکھا۔ وہی بنی عمّون کا باپ ہے جو اب تک موجود ہیں",
                    },
                    
                ],
            },
            {
                "chap_num": 20,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور ابؔرہام وہاں سے جنوب کے مُلک کی طرف چلا اور قؔادِس اور شؔور کے درمیان ٹھہرا اور جؔرار میں قیام کیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اؔبرہام نے اپنی بیوی ساؔرہ کے حق میں کہا کہ وہ میری بہن ہے اور جؔرار کے بادشاہ اؔبی مَلک نے سارؔہ کو بُلوالیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "لیکن رات کو خُدا ابیؔ مَلِک کے پاس خواب میں آیا اور اُ سے کہا کہ دیکھ تُو اُس عورت کے سبب سے جِسے تُو نے لِیا ہے ہلاک ہو گا کیو نکہ وہ شوہر والی ہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "پر اؔبی مَلِک نے اُس سے صُحبت نہیں کی تھی۔ سو اُس نے کہا اَے خُداوند کیا تُو صادق قوم کو بھی ماریگا؟",
                    },
                    {
                        "verse_num": 5,
                        "text": "کیا اُس نے خُود مُجھ سے نہیں کہا کہ یہ میری بہن ہے؟ اور وہ آپ بھی یہی کہتی تھی کہ وہ میرا بھائی ہے۔ مَیں نے تو اپنے سّچے دِل اور پاکیزہ ہاتھو ں سے یہ کیا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خُدا نے اُسے خواب میں کہا ہاں میں جانتا ہوں کہ تُو نے اپنے سّچے دل سے یہ کیا اور مَیں نے بھی تجھے رہکا کہ تُو میرا گُنا نہ کرے۔ اِسی لِئے مَیں نے تجھے اُسکو چُھونے نہ دِیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اب تو اُس مرد کی بیوی کو واپس کر دے کیونکہ وہ نبی ہے اور تیرے لئےِ دُعا کریگا اور تُو جیتا رہیگا۔ پر اگر تُو اُسے واپس نہ کرے تو جان لے کہ تُو بھی اور جِتنے تیرے ہیں سب ضرور ہلاک ہونگے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب ابؔی مَلِک نے صُبح سویرے اُٹھ کر اپنے سب نوکروں کو بُلایا اور اُنکو یہ سب باتین کہ سُنائیں۔ تب وہ لوگ بہت ڈر گئے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور ابؔی مَلِک نے ابرؔہام کو بُلا کر اُس سے کہا کہ تُو نے ہم سے یہ کیا کِیا؟ اور مُجھ سے تیرا کیا قصُور ہُوا کہ تو مجھ پر اور میری بادشاہی پر ایک گُناہِ عظیم لایا؟ تُونے مجُھ سے وہ کام کِئے جن کا کرنا مُناسب نہ تھا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "ابؔی مَلِک نے ابرؔہام سے یہ بھی کہا کہ تُو نے کیا سمجھ کر یہ بات کی؟۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "ابرؔہام نے کہ کہ میرا خیال تھا کہ خُدا کا خوف تواِس جگہ ہرگز نہ ہوگا اور وُہ مُجھے میری بیوی کے سبب سے مار ڈالینگے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور فی الحقیقت وہ میری بہن بھی ہے کیونکہ وہ میرے باپ کی بیٹی ہے اگرچہ میری ماں کی بیٹی نہیں ۔ پھر وہ میری بیوی ہوئی۔ ",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور جب خُدا نے میرے باپ کے بھر سے مجھے آوارہ کِیا تو میں نے اِس سے کہا کہ مُجھ پر یہ تیری مہربانی ہوگی کہ جہاں کہیں ہم جائیں تُو میرے حق میں کہنا کہ یہ میرا بھائی ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب ابؔی مَلِک نے بھیڑ بکریاں اور گائے بَیل اور غلام اور لونڈیاں ابؔرہام کو دِیں اور اُسکی بیوی ساؔرہ کو بھی اُسے واپس کر دِیا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور ابؔی مَلِک نے کہا کہ دیکھ میرا مُلک تیرے سامنے ہے ۔ جہاں جی چاہے رہ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس نے ساؔرہ سے کہ کہ دیکھ مَیں نے تیرے بھائی کو چاندی کے ہزار سِکےّ دِئے ہیں ۔ وہ اُن سب کے سامنے جو تیرے ساتھ ہیں تیرے لئِے آنکھ کا پردہ ہے اور سب کے سامنے تیری داد رسی ہوگئی۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب ابرؔہام نے خُدا سے دُعا کی اور خُدا نے ابؔی مَلِک اور اُسکی بیوی اور اُسکی لونڈیوں کو شفا بخشی اور اُنکے اَولاد ہونے لگی۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "کیونکہ خُداوند نے ابرؔہام کی بیوی ساؔرہ کے سبب سے ابؔی مَلِک کے خاندان کے سب رَحِم بند کردِئے تھے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 21,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے جَیسا اُس نے فرمایا تھا ساؔرہ پر نظر کی اور اُس نے اپنے وعدہ کے مُطابق ساؔرہ سے کِیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "سو ساؔرہ حاملہ ہوئی اور ابرؔہام کے لئے اُسکے بڑھاپے میں اُسی مُعیّن وقت پر جِسکا ذِکر خُدا نے اُس سے کِیا تھا اُسکے بیٹا ہُوا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور ابؔرہام نے اپنے بیٹے کا نام جو اُس سے ساؔرہ کے پَیدا ہُوا اِؔضحاق رکھّا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور ابؔرہام نے خُدا کے حکُم کے مُطابق اپنے بیٹے اِضؔحاق کا ختنہ اُس وقت کِیا جب وہ آٹھ دِن کا ہُوا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور جب اُسکا بیٹا اِضؔحاق اُس سے پیدا ہُوا تو ابرؔہام سَو بر س کا تھا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور سارؔہ نے کہا کہ خُدا نے مجھے ہنسایا اور سب سُننے والے میرے ساتھ ہنسینگے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور یہ بھی کہ کہ بھلا کوئی ابرؔہام سے کہہ سکتا تھا کہ ساؔرہ لڑکوں کو دوُدھ پلائیگی ؟ کیونکہ اُس سے اُسکے بُڑھاپے میں میرے ایک بیٹا ہوا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور وہ لڑکا بڑھا اور اُسکا دُودھ چُھڑا یا گیا اور اِضؔحاق کے دُودھ چھُڑانے کے دِن ابرؔہام نے بڑی ضیافت کی ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور ساؔرہ نے دیکھا کہ ہاؔجرہ مصری کا بیٹا جو اُسکے ابرؔہام سے ہُوا تھا ٹھٹّھے مارتا ہے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب اُس نے ابرؔہام سے کہاکہ اِس لَونڈی کو اور اُسکے بیٹے کو نِکال دے کیونکہ اَس لَونڈی کا بیٹا میرے بیٹے اِضؔحاق کے ساتھ وارِث نہ ہوگا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "پر ابؔرہام کو اُسکے بیٹے کے باعِث یہ بات نہایت بُری معلوم ہوئی ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خُدا نے ابرؔہام سے کہا کہ تجھے اِس لڑکے اور اپنی لَونڈی کے باعِث بُرا نہ لگے ۔ جو کُچھ سارؔہ تجھ سے کہتی ہے تُو اُسکی بات مان کیونکہ اِضؔحاق سے تیری نسل کا نام چلیگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اَس لَونڈی کے بیٹے سے بھی مَیں ایک قوم پیدا کرونگا اِسلئے کہ وہ تیری نسل ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب ابرؔہام نے صبح سویرے اُٹھ کر روٹی اور پانی کی ایک مشک لی اور اپسے ہاؔجرہ کو دِیا بلکہ اُسے اُسکے کندھے پر دھر دیا اور لڑکے کو بھی اُسکے حوالہ کر کے اُسے رُخصت کی دیا۔ سو وہ چلی گئی اور بیر ؔسبع کے بیابان میں آوارہ پِھرنے لگی۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جب مشک کا پانی ختم ہوگیا تو اُس نے لڑکے کو ایک جھاڑی کے نِیچے ڈالدیا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور آپ اُسکے مقابل ایک تیِر کے ٹپّے پر دُور جا بِیٹھی اور کہنے لگی کہ مَیں اِس لڑکے کا مرنا تو نہ دیکھوں ۔ سو وہ اُسکے مُقابل بَیٹھ گئی اور چلاّ چِلاّ کر رونے لگی۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور خُدا نے اُس لڑکے کی آواز سُنی اور خُدا کے فرشتہ نے آسمان سے ہاجؔرہ کو پُکارا اور اُس سے کہا اَے ہاجرؔہ تجھ کو کیا ہُوا؟ مت ڈر کیونکہ خُدا نے اُس جگہ سے جہاں لڑکا پڑا ہے اُسکی آواز سُن لی ہے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اُسے اپنے ہاتھ سے سنبھال کیونکہ مَیں اُسکو ایک بڑی قوم بناؤنگا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "پِھر خُدانے اُسکی آنکھیں کھو لیں اور اُس نے پانی کا ایک کُوآں دیکھا اور جا کر مشک کو پانی سے بھر لِیا اور لڑکے کو پِلایا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور خُدا اُس لڑکے کے ساتھ تھا اور وہ بڑا ہُوا اور بیابان میں رہنے لگا اور تیر انداز بنا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور وہ فاؔران کے بیا بان میں رہتا تھا اور اُسکی ماں نے مُلکِ مصؔر سے اُسکے لِئے بیوی لی۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "پِھر اُس وقت یُوں ہوُا کہ ابیؔ مَلِک اور اُسکے لشکر کے سردار فِیکُل نے ابرؔہام سے کہا کہ ہر کام میں جو تُو کرتا ہے خُدا تیرے ساتھ ہے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اِسلِئے تو اب مجھ سے خُدا کی قسم کھا کہ تُو نہ مُجھ سے نہ میرے بیٹے سے اور نہ میرے پوتے سے دغاکریگا بلکہ جو مِہربانی مَیں نے تُجھ پر کی ہے وَیسی ہی تُو بھی مُجھ پر اور اِس مُلک پر جِس میں تُو نے قیام کیا ہے کریگا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب ابؔرہام نے کہامَیں قسم کھاؤنگا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور ابرؔہام نے پانی کے ایک کُوئیں کو وجہ سے جِسے ابؔی مَلِک کے نوکروں نے زبردستی چھین لِیا تھا ابؔی مَلِک کو جھڑکا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "ابیؔ مَلِک نے کہا مُجھے خبر نہٰن کہ کِس نے یہ کام کِیا اور تُو نے بھی مُجھے نہیں بتایا اور نہ مَیں نے آج سے پہلے اِسکی بابت کُچھ سُنا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "پِھر ابرؔہام نے بھیڑ بکریاں اور گائے بَیل لیکر ابؔی مَلِک کو دِئے اور دونوں نے آپس میں عہد کِیا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور ابرؔہام نے بھیڑ کے ساتھ مادہ بچوّں کو لیکر الگ رکھا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور ابیؔ مَلِک نے ابرؔہام سے کہا کہ بھیڑ کے اِن سات مادہ بچوں کو الگ رکھنے سے تیرا مطلب کیا ہے؟",
                    },
                    {
                        "verse_num": 30,
                        "text": "اُس نے کہا کہ بِھیڑ کے اِن ساتوں مادہ بچّوں کو تُو میرے ہاتھ سے لے تاکہ وہ میرے گواہ ہوں کہ مَیں نے یہ کُوآں کھودا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اِسی لئے اُس مقام کا نام بیرؔسبع رکھّاکیونکہ وہیں اُن دونوں نے قسم کھائی۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "سو اُنہوں نے بیرؔسبع میں عہد کِیا ۔ تب اؔبی مَلِک اور اُسکے لشکر کا سردار فِیکُل دونوں اُٹھ کھڑے ہوئے اور فلستیوں کے مُلک کو لَوٹ گئے۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "تب ابرؔہام بیرؔسبع میں جھاؤ کا ایک درخت لگایا اور وہاں اُس نے خُداوند سے جو ابدی خُدا ہے دُعا کی ۔ ",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور ابؔرہام بہت دِنوں تک فلستیوں کے مُلک میں رہا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 22,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اِن باتوں کے بعد یُوں ہُوا کہ خُدا نے ابرؔہام کو آزمایا اور اُسے کہا اَے ابرہام ! اُس نے کہا مَیں حاضِر ہُوں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تب اُس نے کہا کہ تُو اپنے بیٹے اِضؔحاق کو جو تیرا اِکلوتا ہے اور جِسے تُو پیار کرتا ہے ساتھ لیکر مؔوریا کے مُلک میں جا اور وہاں اُسے پہاڑوں میں سے ایک پہاڑ پر جَو میں تجھے بتاؤنگا سو ختنی قُربانی کے طَور پر چڑھا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تب اؔبرہام نے صبح سویرے اُٹھکر اپنے گدھے پر چارجامہ کسا اور پنے ساتھ دو جوانوں اور اپنے بیٹے اِضؔحاق کو لِیا اور سوختنی قُربانی کے لِئے لکڑیاں چیریں اور اُٹھ کر اُس جگہ کو جو خُدا نے اُسے بتائی تھی روانہ ہُوا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تِیسرے دِن ابرؔہام نے نِگاہ کی اور اُس جگہ کو دُور سے دیکھا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب ابرؔہام نے اپنے جوانوں سے کہا تم یہیں گدھے کے پاس ٹھہرو۔ مَیں اور یہ لڑکا دونوں زرا وہاں تک جاتے ہیں اور سِجدہ کرکے پھر تمہارے پاس لَوٹ آئینگے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور ابرؔہام نے سوختنی قُربانی کی لکڑیاں لیکر اپنے بیٹے اِضؔحاق پر رکھّیں اور آگ اور چُھری اپنے ہاتھ میں لی اور دونوں اِکٹھےّ روانہ ہُوئے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب اِضؔحاق نے اپنے باپ ابؔرہام سے کہااَے باپ ! اُس نے جواب دیا کہ اِے میرے بیٹے مَیں حاضِر ہُوں ۔ اُس نے کہا دیکھ آگ اور لکڑیاں تو ہیں پر سوختنی قرُبانی کے لئے برہ کہا ں ہے؟",
                    },
                    {
                        "verse_num": 8,
                        "text": "ابرؔہام نے کہا اَے میرے بیٹے خُدا آپ ہی اپنے واسطے سوختنی قُربانی کے لِئے برہّ مُہیا کرلیگا۔ سو وہ دونوں آگے چلتے گئے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اُس جگہ پہنچے جو خُدا نے بتائی تھی ۔ وہاں ابرؔہام نے قُربانگا بنائی اور اُس پر لکڑیاں چُنیں اور اپنے بیٹے اِضحاؔق کو باندھا اور اُسے قُربانگاہ پر لکڑیون کے اُوپر رکّھا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "ابرؔہام نے ہاتھ بڑھا کر چُھری لی کہ اپنے بیٹے کو ذبھ کرے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب خُداوند کے فرشتہ نے اُسے آسمان سے پُکارا کہ اَے ابرؔہام اَے ابرؔہام! اُس نے کا مَیں حاضِر ہُوں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پِھر اُس نے کہا کہ تُو اپنا ہاتھ لڑکے پر نہ چلا اور نہ اُس سے کُچھ کر کیونکہ مَیں اب جان گیا کہ تُو خُدا سے نہ ڈر تا ہے اَسلئے کہ تُو نے اپنے بیٹے کو بھی جو تیرا اِکلوتا ہے مُجھ سے دریغ نہ کِیا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور ابؔرہام نے نگاہ کی اور اپنے پیچھے ایک مینڈھا دیکھا جِسکے سِینگ جھاڑی میں اٹکے تھے۔ تب ابرؔہام نے جا کر اُس مینڈے کو پکڑا اور اپنے بیٹے کے بدلے سو ختنی قُربانی کے طَور پر چڑھایا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور ابرؔہام نے اُس مقام کا نام یہوؔواہ یری رکھا چنانچہ آج تک یہ کہاوت ہے کہ خُداوند کے پہاڑ پر مُہیا کا جائیگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور خُداوند کے فرشتہ نے آسمان سے دوبارہ ابرؔہام کو پُکارا اور کہا کہ ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "خُداوند فرماتا ہے چُونکہ تُو نے یہ کام کِیا کہ اپنے بیٹے کو بھی جو تیرا اِکلوتا ہے دریغ نہ رکّھااِسلئےمیں نے بھی اپنی ذات کی قسم کھائی ہے کہ ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "مَیں تجھے برکت پر برکت دُونگا اور تیری نسل کو بڑھاتے بڑھاتے آسمان کے تاروں اور سمندر کے کنارے کی ریت کی مانِند کر دُونگا اور تیری اَولاد اپنے دُشمنوں کے پھا ٹک کی مالِک ہوگی۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور تیری نسل کے وسیلہ سے زمین کی سب قومٰن برکت پائینگی کیونکہ تُو نے میری بات مانی۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تب ابرؔہام نے اپنے جوانوں کے پاس لَوٹ گیا اور وہ اُٹھے اور اِکٹھے بیرسؔبع کو گئے اور ابرؔہام بیرؔسبع میں رہا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اِن باتوں کے بعد یُوں ہُوا کہ ابرؔہام کو یہ خبر مِلی کہ مَکاؔہ کے بھی تیرے بھائی نؔحور سے بیٹے ہوئے ہیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "یعنی عُوضؔ جو اُسکا پہلوٹھا ہے اور اُسکا بھائی بُوز اور قمؔوایل ارؔام کا باپ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور کسؔد اور حؔزوُ اور فِلدؔاس اور اِدلان اور بتیوؔایل ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور بتیوؔایل سے رِبؔقہ پَیدا ہوئی۔ یہ آٹھوں ابؔرہام کے بائی نُحوؔر سے مِلکؔاہ کے پَیدا ہوئے۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُسکی حرم سے بھی جِسکا نام رُومؔہ تھا طِؔنج اور جاؔحم اور تخؔص اور مؔعکہ پَیدا ہوئے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 23,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور ساؔرہ کی عُمر اِیک سو ستائیس برس کی ہوئی ۔ ساؔرہ کی زندگی کے ا،تنے ہی سال تھے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور ساؔرہ نے قؔربت اربع میں وفات پائی۔ یہ کنعؔان میں ہے اور حؔبُرون بھی کہلاتا ہے اور ابرؔہام ساؔرہ کے لئِے ماتم اور نوحہ کرنے کو وہاں گیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "پھر ابرؔہام میت کے پاس سے اُٹھ کر بنی حِتؔ سے باتیں کرنے لگا اور کہا کہ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "مَیں تمہارے درمیان پردیسی اور غریب الوطن ہُوں۔ تم اپنے ہاں گورِستان کے لئے کوئی مِلکیت مُجے دو تا کہ مَیں اپنے مُردہ کو آنکھ کے سامنے سے ہٹا کر دفن کر دُوں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب بنی حِؔت نے ابرؔہام کو جواب دِیا کہ ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اَے خُداوند ہماری سُن ۔ تُو ہمارے درمیان زبردست سردار ہے ۔ ہماری قبروں میں جو سب سے اچّھی ہو اُس میں تُو اپنے مُردہ کو دفن کر ہم میں اَیسا کوئی نہیں جو تُجھ سے اپنی قبر کا اِنکار کرے تا کہ تُو اپنا مُردہ دفن نہ کر سکے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "ابرؔہام نے اُٹھ کر اور بنی حِتؔ کے آگے جو اُس مُلک کے لوگ ہیں آداب بجا لا کر۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اُن سے یُوں گفتگو کی کہ اگر تُمہاری مرضی ہو کہ مَیں اپنے مرُدہ کو آنکھ کے سامنے سے ہٹا کر دفن کردُو تو میری عرض سُنو اور صُحؔر کے بیٹے عِفرون سے میری سفارِش کرو۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "کہ وہ مکفیؔلہ کے غار کوجو اُسکا ہے اور اُسکے کھیت کے کنارے پر ہے اُسکی پُوری قیمت لیکر مجھے دیدے تا کہ وہ گورِستان کےلئے تُمہارے درمیان میری ملکیت ہو جائے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور عِفؔرون بنی حِؔت کے درمیان بیٹھا تھا۔ تب عؔفرون حِتّی نے بنی حِؔت کے سامنے اُن سب لوگوں کے رُو برو جو اُسکے شہر کے دروازہ سے دِاخل ہوتے تھے۔ ابرؔہام کو جواب دیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اِے میرے خُداوند یوُں نہ ہوگا بلکہ میری سُن ۔ مَیں یہ کھیت تجُھے دیتا ہُوں اور وہ غار بھی جو اُس میں ہے تُجھے دِئے دیتا ہُوں ۔ یہ مَیں اپنی قُوم کے لوگوں کے سامنے تُجھے دیتا ہوں تو پنے مُردہ کو دفن کر۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب ابرؔہام اُ س مُلک کے لوگوں کے سامنے جُھکا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "پِھر اُ س نے مُلک کے لوگوں کے سُنتے ہُوئے عِفؔرون سے کہاکہ اگر تُو دینا ہی چاہتا ہے تو میری سُن ۔ مَیں تجھے اُس کھیت کا دام دُونگا ۔ یہ تُو مجھ سے لے لے تومَیں اپنے مُردہ کو وہاں دفن کرونگا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "عفِؔرون نے ابؔرہام کو جواب دِیا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اَے میرے خُداوند میری بات سُن۔ یہ زمین چاندی کی چار سَو مثَقال کی ہے سو میرے اور تیرے درمیان یہ ہے کہ؟ پس اپنا مُردہ دفن کرونگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اورابرؔہام نے عِفرون نے ابرؔہام کی بات مان لی ۔ سو ابؔرہام نے عِفرون کو اُتنی ہی چاندی کی چار سَو مِثقال جو سَوداگروں میں رائج تھی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "سو عِؔفرون کا وہ کھیت جو مکؔفیلہ میں مؔمرے کے سامنے تھا اور وہ غار جو اُس میں تھا اور سب درخت جو اُس کھیت میں اور اُسکی چاروں طرف کی حُدود میں تھے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "یہ سب بنی حِؔت کے اور اُن سب کے رُوبرو جو اُسکے شہر کے دروازہ سے دخِل ہوتے تھے ابرؔہام کی خاص ملکیت قرار دِئے گئے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اَسکے بعد ابؔرہام نے اپنی بیوی ساؔرہ کو مکفیؔلہ کے کھیت کے غار میں جو مُلکِ کنعان میں مؔمرے یعنی حَبرُونؔ کے سامنے ہے دفن کِیا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "چنانچہ وہ کھیت اور وہ غٓر جو اُس میں تھا بنی حِتؔ کی طفر سے گورِستان کے لِئے ابرہؔام کی مِلکیت قرار دِئے گئے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 24,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور ابرؔہام ضعیف اور عُمر رسیدہ ہُوا اور خُداوند نے سب باتوں میں ابرؔہام کو برکت بخشی تھی ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "ابرؔہام نے اپنے گھر کے سالخوردہ نوکر سے جو اُسکی سب چیزوں کا مُختار تھا کہ ا تو اپنا ہاتھ ذرا میری ران کے نِیچے رکھ کہ",
                    },
                    {
                        "verse_num": 3,
                        "text": "میں تجھ سے خُداوند کی جو زمین و آسمان کا خُدا ہے قسم لُوں کہ تُو کنعانیوں کی بیٹیوں میں سے جِن میں مَیں رہتا ہُوں کِسی کو میرے بیٹے سے نہیں بیاہیگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "بلکہ تُو میرے وطن میں میرے رِشتہ داروں کے پاس جا کر میرے بیٹے اِضحاقؔ کے لئِے بیوی لائیگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اُس نوکر نے اُس سے کہا شاید وہ عورت اِس مُلک میں میرے ساتھ آنا نہ چاہے تو کیا مَیں تیرے بیٹے کو اُس مُلک میں جہاں سے تُو آیا پھِر لے جاؤں ؟",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب ابؔرہام نے اُس سے کہا خبردار تپو میرے بیٹے کو وہاں ہر گز نہ لے جانا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "خُداوند آسمان کا خُدا جو مجھُے میرے باپ کے گھر اور میری زاد بُوم سے نِکال لایا اور جِس نے مُجھ سے باتیں کیں اور قسم کھا کر مُجھ سے کہا کہ میَں تیری نسل کو یہ مُلک دُونگا وُہی تیرے آگے آگے اپنا فرشتہ بھیجیگا کہ تُو وہاں سے میرے بیٹے کے لئِے بیوی لائے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اگر وہ عورت تیرے ساتھ آنا نہ چاہے تو تُومیری اِس قسم سے چُھوٹٓ پر میرے بیٹے کو ہرگز وہاں نہ لے جانا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اُس نوکر نے اپنا ہاتھ اپنے آقا ابرؔہام کی ران کے نیچے رکھ کر اُس س اِس بات کی قِسم کھائی۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب وہ نوکر اپنے آقا کے اُنٹوں میں سے اُونٹ لیکر روانہ ہُوا اور اُسکے آقا کی اچھی اچھی چیزیں اُسکے پاس تھیں اور وہ اُٹھکر مسوؔپتامیہ میں نؔحور کے شہر کو گیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور شام کو جس وقت عورتیں پانی بھرنے آتی ہیں اُس نے اُس شہر کے باہر باؤلی کے پاس اُونٹوں کو بِٹھایا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور کہا اَے میرے خُداوند میرے آقا برؔہام کے خُد مَیں تیری مِنت کرتا ہُوں کہ آج تُومیرا کام بنا دے اور میرے آقا ابرؔہام پر کرم کر۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "دیکھ پانی کے چشمہ پر کھڑا ہُوں اور اِس شہر کے لوگوں کی بیٹیاں پانی بھرنے کو آتی ہیں۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "سو اَیسا ہو کہ جِس لڑکی سے مَیں کُہوں کہ تُو ذرا اپنا گھڑا جُھکا دے تو مَیں پانی پی لُوں اور وہ کہے کہ لے پی اور مَیں تیرے اُونٹوں کو بھی پلاؤنگی تو وہ وُہی ہو جِسے تُو نے اپنے بندہ اِضحاقؔ کے لِئے ٹھہرایا ہے اور اِسی سے مَیں سمجھ لوُنگا کہ تُو نے میرے آقا پر کرم کیا ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "وہ یہ کہہ ہی رہا تھا کہ رِبقؔہ جو ابرؔہام کے بھائی نؔحُور کی بیوی مِلؔکاہ کی بیٹے بیوؔایل سے پَیدا ہوئی تھی اپنا گھڑا کندے پر لئِے ہوءے نِکلی۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "وہ لڑکی نہایت خُو بصورت اور کنواری اور مرد سے ناواقفِ تھی۔ وہ نیچے پانی کے چشمہ کے پاس گئی اور اپنا گھڑا بھر کر اُوپر کو آئی۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب وہ نوکر اُس سے مِلنے کو دَوڑا اور کہا کہ ذرا اپنے گھڑے سے تھوڑٓ سا پانی مُجے پِلا دے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اُسنے کہا پِیجئے صاحب اور فوراً گھڑے کو ہاتھ پر اُتار اُسے پانی پِلایا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "جب اُسے پلا چُکی تو کہنے لگی کہ مَیں تیرے اُونٹوں کو بھی پانی بھر بھر لاؤنگی جب تک وہ پی نہ چُکیں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور فوراً اپنے گھڑے کو حَوض میں خالی کرکے پھر باؤلی کی طر پانی بھرنے دَوڑی گئی اور اُسکے سب اُونٹوں کے لئِے بِھرا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "وہ آدمی چُپ چاپ اُسے غور سے دیکھتا رہا تا کہ معلوم کرے کہ خُداوند نے اُسکا سفر مُبارک کیا ہے یا نہیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "جب اُونٹ پی چُکے تو اُس شخص نے نِصف مِثقال سونے کی ایک نتھ اور دس مِثقال سونے ے دو کڑے اُسکے ہاتھوں کے لئِے نِکالے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور کہا کہ ذرا مجھے بتا کہ تُو کِس کی بیٹی ہے؟ اور کیا تیرے باپ کے گھر میں ہمارے ٹکنے کی جگہ ہے؟",
                    },
                    {
                        "verse_num": 24,
                        "text": "اُس نے اُس سے کہا کہ میَں بیتوؔایل کی بیٹی ہوُں۔ وہ مِلکاؔہ کا بیٹا ہے جو نؔحُور سے اُسکے ہوا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور یہ بھی اُس سے کہا کہ ہمارے پاس بُھوسا اور چارا بہت ہے اور ٹِکنے کی جگہ بھی ہے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تب اُس آدمی نے جُھک کر خُداوند کو سِجدہ کیا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور کہا خُداوند میرے آقا ابرؔہام کا خُدا مُبارک ہو جس نے میرے آقا کو پانے کرم اور راستی سے محروم نہیں رکّھا اور مُجھے تو خُداوند ٹھیک راہ پر چلا کر میرے آقا کے بھائیو ں کے گھر لایا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "تب اُس لڑکی نے دَوڑ کر اپنی ماں کے گھر میں یہ سب حال کہہ سُنایا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور ربؔقہ کا ایک بھائی تھا جسکا نام لؔابن تھا ۔ وہ باہر پانی کے چشمہ کے پاس اُس آدمی کے پاس دَوڑا گیا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": " اور یُوں ہُوا کہ جب اُس نے وہ نتھ دیکھی اور وہ کڑے بھی جو اُُسکی بہن کے ہاتھوں میں تھے اور اپنی بہن رِبقہؔ کا بیان بھی سُن لیا کہ اُس شخص نے مجُھ سے اَیسی اَیسی باتیں کہیں تو وہ اُس آدمی کے پاس آیا اور دیکھا کہ وہ چشمہ کے نزدیک ے پاس کھڑا ہے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب اُس سے کہا اَے تو جو خُداوند کی طرف سے مبارک ہے اندر چل۔ باہر کیوں کھڑا ہے؟ میں نے گھر کو اور اُونٹوں کے لئِے بھی جگہ کو تیار کر لِیا ہے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "پس وہ آدمی گھر میں آیا اور اُس نے اُسکے اُونٹوں کو کھولا اور اُونٹوں کے لئِے بُھوسا اور چارا اور اُسکے اور اُسکے آدمیوں کے پاؤں بھی دُھونے کو پانی دِیا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور کھان اُسکے آگے رکّھا گیا پر اُس نے کہا کہ میں جب تک اپنا مطلب بیان نہ کر لُوں نہیں کھاؤنگا۔ اُس نے کہا اچّھا کہہ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "تب اُس نے کہا کہ مَیں اؔبرہام کا نوکر ہُوں ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور خُداوند نے میرے آقا کو بڑی برکت دی ہے اور وہ بہت بڑا آدمی ہو گیا ہے اور اُس نے اُسے بھیڑ بکریاں اور گائے بیل اور سونا چاندی اور لَونڈیاں اور غُلام اور اُونٹ اور گدھے بخشے ہیں ",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور میرے آقا کی بیوی ساؔرہ جب وہ بُڑھیا ہوگئی اُس سے ایک بیٹا ہوا۔ اُسی کو اُس نے اپنا سب کچھ دیدیاہے ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور میرے آقا نے مُجھے قسم دیکر کہا ہے کہ تُو کنعانیوں کی بیٹیوں میں سے جِنکے مُلک میں میَں رہتا ہوں کِسی کو میرے بیٹے سے نہ بیاہنا۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "بلکہ تُو میرے باپ کے گھر اور میرے رِشتہ داروں میں جانا اور میرے بیٹے کے لئِے بیوی لانا۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "تب میں نے اپنے آقا سے کہا شای وہ عورت میرے ساتھ آنا نہ چاہے ۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "تب اُس نے مُجھ سے کہا کہ خُداوند جِسکے حضور میں چلتا رہا ہوں اپنا فرشتہ تیرے ساتھ بھیجیگا اور تیرا سفر مُبارک کریگا۔ تو میرے رِشتہ داروں اور میرے باپ کے خاندان میں میرے بیٹے کے لئِے بیوی لانا۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور جب تُو میرے خاندان میں جا پہنچیگا تب میری قسم سے چھُوٹا ۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "سو مَیں آج پانی کے اُس چشمہ پر آکر کہنے لگا اَے خُداوند میرے آقا ابؔرہام کے خُدا اگر تو میرے سفر کو جو مَیں کر رہا ہوُں مُبارک کرتا ہے۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "تو دیکھ مَیں پانی کے چشمہ کے پاس کھڑا ہوتا ہوں اور اَیسا ہو کہ جو لڑکی پانی بھرنے نِکلے اور مَیں اُس سے کہوں کہ ذرا پنے گھڑے سے تھوڑا پانی مُجھے پِلا دے ۔",
                    },
                    {
                        "verse_num": 44,
                        "text": "اور وہ مجُھے کہے کہ تُو بھی پی اور مَیں تیرے اُونٹوں کے لئِے بھی بھردُونگی تو وہ ہی عورت ہو جِسے خُداوند نے میرے آقا کے بیٹے کے لئِے ٹھہرایا ہے ۔",
                    },
                    {
                        "verse_num": 45,
                        "text": "مَیں دِل میں یہ کہ ہی رہا تھا کہ ربقہ اپنا گھڑا کندھے پر لئِے ہوئے باہر نِکلی اور نیچے چشمہ کے پاس گئی اور پانی بھرا ۔ تب مَیں نے اُس سے کہا ذرا مجھے پانی پِلا دے ۔",
                    },
                    {
                        "verse_num": 46,
                        "text": "اُس نے فوراً اپنا گھڑا کندھے پر سے اُتارا اور کہا لے پی اور مَیں تیرے اُونٹوں کو بھی پلا دُونگی سَو میں نے پِیا اور اُس نے میرے اُونٹوں کو بھی پِلایا ۔",
                    },
                    {
                        "verse_num": 47,
                        "text": "پھر میں نے اُس سے پُوچھا کہ تُو کِس کی بیٹی ہے؟ اُس نے کہا میں بیتؔو ایل کی بیٹی ہوں ۔ وہ نؔحُور کا بیٹٓ ہے جو مِلکؔاہ سے پیدا ہوا۔ پھر میں نے اُسکی ناک میں نتھ اور اُسکے ہاتھ میں کڑے پہنا دِئے ۔",
                    },
                    {
                        "verse_num": 48,
                        "text": "اور مَیں نے جُھک کر خُداوند کو سِجدہ کیا اور خُداوند اپنے آقا ابرؔہام کے خُدا کو مُبارک کہا جِس نے مجھے ٹھیک رہ پر چلایا کہ اپنے آقا کے بھائی کی بیٹی اُسکے بیٹے کے واسطے لیجاؤں۔",
                    },
                    {
                        "verse_num": 49,
                        "text": "سو اب اگر تُم کرم اور راسی سے میرے آقا کے ساتھ پیش آنا چاہتے ہو تو مُجھے بتاؤ اور اگر نہیں تو کہدو تاکہ میں دہنی یا بائیں طرف پِھر جاؤں ۔",
                    },
                    {
                        "verse_num": 50,
                        "text": "تب لاؔبن اور بیؔتوایل نے جواب دِیا کہ یہ بات خُداوند کی طرف سے ہُوئی ہے ۔ ہم تجھے کُچھ بُرا یا بھلا نہیں کہہ سکتے ۔",
                    },
                    {
                        "verse_num": 51,
                        "text": "دیکھ رِبؔقہ تیرے سامنے مَوجود ہے ۔ اُسے لے اور جا اور خُداوند کے قول کے مُطابق اپنے آقا کے بیٹے سے اُسے بیاہ دے۔ ",
                    },
                    {
                        "verse_num": 52,
                        "text": "جب ابرؔہام کے نوکر نے اُنکی باتیں سُنیں تو زمین تک جُھک کر خُداوند کو سِجدہ کیا۔",
                    },
                    {
                        "verse_num": 53,
                        "text": "اور نوکر نے چاندی اور سونے کے زیور اور لباس نِکال کر رِبقؔہ کو دِئے اور اُسکے بھائی اور اُسکی ماں کو بھی قیمتی چیزیں دیں۔",
                    },
                    {
                        "verse_num": 54,
                        "text": "اور اُس نے اور اُسکے ساتھ کے آدمیوں نے کھایا پیا اور رات بھر وہیں رہے ۔صُبح کو وہ اُٹھے اور اُس نے کہا کہ مُجھے میرے آقا کے پاس روانہ کر دو۔",
                    },
                    {
                        "verse_num": 55,
                        "text": "رِؔبقہ کے بھائی اور ماں نے کہا کہ لڑکی کو کُچھ روز کم سے کم دس روز ہمارے پاس رہنے دے۔ اِسکے بعد وہ چلی جائیگی ۔",
                    },
                    {
                        "verse_num": 56,
                        "text": "اُس نے اُن سے کہا کہ مُجے نہ روکو کیونکہ خُداوند نے میرا سفر مُبارک کیا ہے ۔ مجھے رُخصت کر دو تا کہ مَیں اپنے آقا کے پاس جاؤں ۔",
                    },
                    {
                        "verse_num": 57,
                        "text": "اُنہوں نے کہا کہ ہم لڑکی کو بُلا کر پُوچھتے ہیں کہ وہ کیا کہتی ہے۔",
                    },
                    {
                        "verse_num": 58,
                        "text": "تب اُنہوں نے رِؔبقہ کو بُلا کر اُس سے پُوچھا کیا تُو اِس آدمی کے ساتھ جائیگی؟ اُس نے کہا جاؤنگی ۔",
                    },
                    {
                        "verse_num": 59,
                        "text": "تب اُنہوں نے اپنی بہن رِؔبقہ اور اُسکی دایہ اور ابؔرہام کے نوکر اور اُسکے آدمیوں کو رُخصت کِیا۔",
                    },
                    {
                        "verse_num": 60,
                        "text": "اور اُنہوں نے رِؔبقہ کو دُعا دی اور اُس سے کہا اے ہماری بہن تُو لاکھوں کی ماں ہو اور تیری نسل اپنے کینہ رکھنے والوں کے پھاٹک کی مالِک ہو۔",
                    },
                    {
                        "verse_num": 61,
                        "text": "اور رِؔبقہ اور اُسکی سہیلیاں اُٹھ کر اُونٹوں پر سوار ہُوٹیں اور اُس آدمی کے پیچھے ہولیں ۔ سو وہ آدمی رِؔبقہ کو ساتھ لیکر روانہ ہُوا۔",
                    },
                    {
                        "verse_num": 62,
                        "text": "اور اِضحاقؔ بیرؔلحی روٹی سے ہو کر چلا آرہا تھا کیونکہ وہ جنوب کے مُلک میں رہتاس تھا۔",
                    },
                    {
                        "verse_num": 63,
                        "text": "اور شام کے وقت اِؔضحاق سوچنے کو مَیدان میں گیا اور اُس نے جو اپنی آنکھیں اُٹھائیں اور نظرکی تو کیا دیکھتا ہے کہ اُونٹ چلے آرہے ہیں۔",
                    },
                    {
                        "verse_num": 64,
                        "text": "اور رِبؔقہ نے نگاہ اور اِضؔحاق کو دیکھ کر اُونٹ پر سے اُتر پڑی۔",
                    },
                    {
                        "verse_num": 65,
                        "text": "اور اُس نے نوکر سے پُوچھا کہ یہ شخص کون ہے جو ہم سے مِلنے کو مَیدان میں چلا آرہا ہے ؟اُس نوکر نے کہا یہ میرا آقا ہے ۔ تب اُس نے بُرق لیکر اپنے اُوپر ڈال لیا۔",
                    },
                    {
                        "verse_num": 66,
                        "text": "نوکر نے جو جو کِیا تھا سب اِؔضحاق کو بتایا۔",
                    },
                    {
                        "verse_num": 67,
                        "text": "اور اِؔضحاق رِؔبقہکو اپنی ماں سؔارہ کے ڈیرے میں لے گیا۔ تب اُس نے رِبؔقہ سے بیاہ کر لیا اور اُس نے محبت کی اور اِضحاق نے پانی ماں کے مرنے کے بعد تسلّی پائی۔",
                    },
                    
                ],
            },
            {
                "chap_num": 25,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور ابؔرہام نے پِھر ایک اَور بیوی کی جسکا نام قؔطُور تھا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اُس سے زمرؔان اور یُقسان اور مِؔدان اور مِؔدیان اور اِؔسباق اور سُخ پیدا ہُوئے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور دؔدان پَیدا ہوئے اور اور دؔدان کی اَولاد سے اُسوری اور لؔطونی اور لُومی تھے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور مِؔدیان کے بیٹے عیٖؔفاہ اور عِفؔر اور حؔنوک اور ابیداعؔ اور الؔدوعا تھے ۔ یہ سب بنی قؔطُورہ تھے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اؔبرہام نے اپنا سب کچھ اِضحاق کو دیا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اپنی حرموں کے بیٹوں کو ابرؔہام نے بہت کُچھ اِنعام دیکر اپنے جیتے جی اُنکو اپنے بیٹے اِضؔحاق کے پاس سے مشرق کی طرف یعنی مشرِق کے مُلک میں بھیج دِیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور ابرؔہام کی کُل عمر جب تک کہ وہ جیتا رہا ایک سَو پچھترّ برس کی ہوئی ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب ابرؔہام نے دم چھوڑ دِیا اور خُوب بُڑھاپے میں نہایت ضعیف اور پُوری عمر کا ہو کر وفات پائی اور اپنے لوگو میں جا مِلا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اُسکے بیٹے اِؔضحاق اور اِسؔمٰعیل نے مِکفیلؔہ کے غار میں جو ممؔرے کے سامنے حِتیؔ صُحر کے بیٹے عِفؔرون کے کھیت میں ہے اُسے دفن کیا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "یہ وہی کھیت ہے جِسے ابرؔہام نے بنی حِؔت سے خریدا تھا۔ وہیں اؔبرہام اور اُسکی بیوی ساؔرہ دفن ہوئے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور ابؔرہام کی وفات کے بعد خُدا نے اُسکے بیٹے اِضؔحاق کو برکت بخشی اور اِضؔحاق بیرلؔح روئی کے نزدیک رہتا تھا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "یہ نسب نامہ ابرہاؔم کے بیٹے اِسؔمعیل کا ہے جو ابؔرہام سے ساؔرہ کی لَونڈی ہاؔجرہ مصری کے بطن سے پَیدا ہوا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اِسؔمعیل کے بیٹوں کے نام یہ ہیں ۔ یہ نام ترتیب وار اُنکی پَیدایش کے مُطابق ہیں ۔ اَسؔمعیل کا پہلوٹھا نباؔیوت تھا ۔ پِھر قَؔیدار اور اؔوبئیل اور مَؔسبام ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور مشؔماع اور دُومؔہ اور مؔسّا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "حؔدد اور تَیماؔ اور یطُور اور نؔفیس اور قؔدِمہ ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "یہ اِسؔمعیل کے بیٹے ہیں اور اِن ہی کے ناموں سے اِنکی بستیاں اور چھاؤنیاں نامزد ہُوئیں اور یہی بارہ اپنے اپنے قبیلہ کے سردار ہُوئے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اِسؔمعیل کی کُل عُمر ایک سَو سینتیس برس کی ہُوئی تب اُس نے دم چوڑ دِیا اور وفات پائی اور اپنے لوگوں میں جا مِلا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اُسکی اَولاد حؔوِیلہ سے شؔور تک جو مِصر کے سامنے اُس راستہ پر ہے جِس سے اؔسُور کو جاتے ہیں آباد تھی ۔ یہ لوگ اپنے سب بھائیوں کے سامنے بسے ہوئے تھے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور ابؔرہام کے بیٹے اِؔضحاق کا نسب نامہ یہ ہے ۔ اؔبرہام سے اِضؔحاق پَیدا ہوا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اِضؔحاق چالیس برس کا تھا جب اُس نے رِؔبقہ سے بیاہ کیا جو فدّؔان ارام کے باشندہ بیتؔوایل ارامی کی بیٹی اور لؔابن ارامی کی بہن تھی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اِضؔحاق نے اپنی بیوی کے لئے خُداوند سے دُعا کی کیونکہ وہ بانجھ تھی اور خُداوند نے اُسکی دُعا قبول کی اور اُسکی بیوی رؔبقہ حامِلہ ہُوئی ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور اُسکے پیٹ میں دو لڑکے آپس میں مُزاحمت کرنے لگے ۔ تب اُس نے کہا اگر اَیسا ہی ہے تو مَیں جیتی کیوں ہُوں ؟ اور وہ خُداوند سے پوچھنے گئی۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "خُداوند نے اُسے کہا ۔ دو قومیں تیرے پیٹ میں ہیں ۔ اور دو قبیلے تیرے بطن سے نِکلتے ہی الگ الگ ہو جائینگے اور ایک قبیلہ دُوسرے قبیلہ سے زور آور ہوگا اور بڑا چھوٹے کی خدمت کریگا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور جب اُسکے وضع حمل کے دِن پوُرے ہوئے تو کیا دیکھتے ہیں کہ اُسکے پیٹ میں تَواٗم ہیں ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور پہلا جو پَیدا ہوا تو سُرخ تھا اور اُوپر سے ایسا جَیسے پشمینہ اور اُنہوں نے اُسکا نام عؔیسو رکھا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اُسکے بعد اُسکا بھائی پَیدا ہوا اور اُسکا ہاتھ عؔیسو کی ایڑی کو پکڑے ہوئے تھا اور اُسکا نام یعقوب رکّھا گیا۔ جب وہ رِؔبقہ سے پَیدا ہوئے تو اِضؔحاق ساٹھ برس کا تھا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور وہ لڑکے بڑھے اور عیؔسو شِکار میں ماہر ہوگیا اور جنگل میں رہنے لگا اور یعقؔوب سادہ مزاج ڈیروں میں رہنے والا آدمی تھا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور اِضؔحاق عؔیسو کو پیار کرتا تھا کیونکہ وہ اُسکے شکار کا گوشت کھاتا تھا اور رِؔبقہ یعؔقوب کو پیار کرتی تھی۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور یعؔقوب نے دال پکائی اور عؔیسو جنگل سے آیا اور بے دم ہو رہا تھا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور عؔیسو نے یعؔقوب سے کہا کہ جو لال لال ہے مُجھے کھلا دے کیونکہ مَیں بے دم ہو رہا ہوُں اِسی لئِے اُسکا نام ادؔوم بھی ہو گیا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب یعؔقوب نے کہا تُو آج اپنا پہلوٹھے کا حق میرے ہاتھ بیچ دے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "عیؔسو نے کہا دیکھ مَیں تو مرا جاتا ہُوں پہلوٹھے کا حق میرے کِس کام آئیگا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "تب یعؔقوب نے کہا کہ آج ہی مجھ سے قسم کھا۔ اُس نے اُس سے قسم کھائی اور اُس نے اپنا پہلوٹھے کا حق یعؔقوب کے ہاتھ بیچ دِیا ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "تب یعؔقوب نے عؔیسو کو روٹی اور مُسور کی دال دی ۔ وہ کھا پی کر اُٹھا اور چلا گیا ۔ یُوں عیؔسو نے اپنے پہلوٹھے کے حق کو ناچیز جانا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 26,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اُس مُلک میں اُس پہلے کال کے علاوہ جو ابؔرہام کے ایام میں پڑا تھا پھر کال پڑا۔ تب اِضؔحاق جؔرار کو فلستوں کے بادشاہ اؔبی مِلک کے پاس گیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور خُداوند نے اُس پر ظاہر ہو کر کہا کہ مِؔصر کو نہ جا بلکہ جو مُلک میں تجھے بتاؤں اُس میں رہ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تُو اِسی مُلک میں قیام رکھ اور مَیں تیرے ساتھ رہُونگا اور تجھے برکت بخشُونگا کیونکہ مَیں تجھے اور تیری نسل کو یہ سب مُلک دُونگا۔ اور مَیں اُس قسم کو جو مَیں نے تیرے باپ اؔبرہام سے کھائی پُورا کرونگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور مَیں تیری اَولاد کو بڑھا کر آسمان کے تاروں کی ما نِند کر دُونگا اور یہ سب مُلک تیری نسل کو دُونگا اور زمین کی سب قومیں تیری نسل کے وسیلہ سے برکت پائینگی ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اِسلئے کہ ابؔرہام نے میری بات مانی اور میری نصیحت اور میرے حُکموں اور قوانین و آئین پر عمل کِیا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "پس اِضؔحاق جؔرار میں رہنے لگا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور وہاں کے باشِندوں نے اُس سے اُسکی بیوی کی بابت پُوچھا اُس نے کہا وہ میری بہن ہے کیونکہ وہ اُسے اپنی بیوی بتانے سے ڈرا۔ یہ سوچ کر کہ کہیں رِؔبقہ کے سبب سے وہاں کے لوگ اُسے قتل نہ کر ڈالیں کیونکہ وہ خُوبصورت تھی ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "جب اُسے وہاں رہتے بہت دِن ہوگئے فلستیوں کے بادشاہ ابیؔ مِلک نے کِھڑکی میں جھانک کر نظر کی اور دیکھا کہ اِضؔحاق اپنی بیوی رؔبقہ سے ہنستی کھیل کر رہا ہے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تب ابیؔ مِلک نے اِؔضحاق کو بُلا کر کہ کہ وہ تو حقیت میں تیری بیوی ہے ۔ پِھر تُو نے کیونکر اُسے اپنی بہن بتایا؟ اِؔضحاق نے اُس سے کہا اِسلئے کہ مجھے خیال ہوا کہ کہیں مَیں اُسکے سبب سے مارا نہ جاؤں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اِبیؔ ملِک نے کہا ہم سے کیا کیا ؟ یوں تو آسانی سے اِن لوگوں میں کوئی تیری بِیوی کے ساتھ مُباشرت کر لیتا اور تُو ہم پر الزام لاتا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب اِبیؔ ملِک نے سب لوگوں کو یہ حُکم کیا کہ جو کوئی اِس مرد کو یا اُسکی بیوی کو چُھوئیگا سو مار ڈالا جائیگا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اِضؔحاق نے اُس مُلک میں کھیتی کی اور اُسی سال اپسے سَوگُنا پھل مِلا اور خُداوند نے اُسے برکت بخشی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور وہ بڑھ گیا اور اُسکی ترقی ہوتی گئی یہاں تک کہ وہ بہت بڑا آدمی ہوگیا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اُسکے پاس بھیڑبکریاں اور گائے بَیل اور بہت سے نوکر چاکر تھے اور فِلستیوں کو اُس پر رشک آنے لگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اُنہوں نے سب کُوئیں جو اُسکے باپ کے نوکروں نے اُسکے باپ اؔبرہام کے وقت میں کھودے تھے بند کر دِئے اور اُنکو مٹی سے بھِر دیا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اِبؔی مِلک نے اِضؔحاق سے کہا کہ تُو ہمارے پاس سے چلا جا کیونکہ تُو ہم سے زیادہ زور آور ہوگیا ہے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب اِؔضحاق نے وہاں سے جؔرار کی وادی میں جا کر اپنا ڈیرا لگایا اور وہاں رہنے لگا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اِؔضحاق نے پانی کے اُن کُوؤں کو جو اُسکے باپ اؔبرہام کے ایاّم میں کھو دے گئے تھے پِھر کُدوایا کیونکہ فَلستیوں نے ابؔرہام کے مرنے کے بعد اُنکو بند کر دیا تھا اور اُس نے اپنکے پھر وہی نام رکھّے جو اُسکے باپ نے رکھّے تھے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اِضؔحاق کے نوکروں کو وادی میں کھودتے کھودتے بہتے پانی کا یاک سو تامِل گیا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب جؔرار کے چرواہوں نے اِضؔحاق کے چرواہوں سے جھگڑا کیا اور کہنے لگے کہ یہ پانی ہمارا ہے اور اُس نے اُس کوئیں کا نام عِسؔق رکّھا کیونکہ اُنہوں نے اُس سے جھگڑا کِیا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُنہوں نے دُوسرا کوُآں کھودا اور اُسکے لِئے بھی وہ جھگڑنے لگے اور اُس نے اُسکا نام سِتؔنہ رکّھا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "سو وہ وہاں سے دُسوری جگہ چلا گیا اور ایک اَور کُوآں کھودا جِسکے لئِے اُنہوں نے جھگڑا نہ کیا اور اُس نے اُسکا نام رحؔوبوت رکّھا اور کہا کہ اب خُداوند نے ہمارے لئِے جگہ نِکالی اور ہم اِس مُلک میں برومند ہونگے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "وہاں سے وہ بیرؔسبع کو گیا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور خُداوند اُسی رات اُس پر ظاہر ہُوا اور کہا کہ مَیں تیرے باپ ابؔرہام کا خُدا ہوں ۔ مت ڈر کیونکہ میں تیرے ساتھ ہوں اور تجھے برکت دونگا اور اپنے بندہ ابؔرہام کی خاطِر تیری نسل بڑھاؤنگا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اُس نے وہاں مذبح بنایا اور خُداوند سے دُعا کی اور اپنا ڈیرا وہیں لگا لِیا اور وہاں اِؔضحاق کے نوکروں نے ایک کُوآں کھودا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تب اَبی مِلک اپنے دوست اخُورت اور اپنے سپہ سالارفیؔکُل کو ساتھ لیکر جؔرار سے اُسکے پاس گیا ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اِضؔحاق نے اُن سے کہا کہ تُم میرے پاس کیونکر آئے حالانکہ مجھ سے کینہ رکھتے ہو اور مُجھ کو اپنے پاس سے نِکال دیا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اُنہوں نے کہا ہم نے خُوب صفائی سے دیکھا کہ خُداوند تیرے ساتھ ہے سو ہم نے کہا کہ ہمارے اور تیرے دریمان قسم ہوجائے اور ہم تیرے ساتھ عید کریں۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "کہ جَیسے ہم نے تجھے چُھوا تک نہیں اور سِوا نیکی کے تجھ سے اَور کُچھ نہیں کِیا اور تجھ کو سلامت رُخصت کیا تُو بھی ہم سے کوئی بدی نہ کریگا کیونکہ تُو اب خُداوند کی طرف سے مُبارک ہے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "تب اُس نے اُنکے لئِے ضِیافت تیار کی اور اُنہوں نے کھایا پیا",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور وہ صُبح سویرے اُٹھے اور آپس میں قسم کھائی اور اِضؔحاق نے اُنکو رُخصت کیا اور وہ اُسکے پاس سے سلامت چلے گئے۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اُسی روز اِضؔحاق کے نوکروں نے آکر اُس سے اُس کُوئیں کا ذکر کِیا جسے اُنوں نے کھودا تھا اور کہا کہ ہمکو پانی مِل گیا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "سو اُس نے اُسکا نام سؔبع رکّھا اِسی لئِے وہ شہر آج تک بیرؔ سبع کہلاتا ہے۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "جب عؔیسو چالیس برس کا ہُوا تو اُس نے بیؔری ھتی کی بیٹی یؔہودِتھ اور اَؔیلون حتی کی بیتی بشاؔستھ سے بیاہ کیا۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور وہ اِضؔحاق اور رِؔبقہ کے لئِے وبال جان ہُوئیں ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 27,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "جب اِضؔحاق ضیعف ہوگیا اور اُسکی آنکھیں اَیسی دُھندلا گئیں کہ اُسے دِکھائی نہ دیتا تھا تو اُس نے اپنے بڑے بیتے عؔیسو کو بُلایا اور کہا اَے میرے بیٹے! اُس نے کہا مَیں حاضِر ہُوں۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تب اُس نے کہا دیکھ! مَیں تو صعیف ہو گیا اور مُجھے اپنی مَوت کا دِن معلوم نہیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "سو اب تُو ذرا اپنا ہتھیار اپنا ترکش اور اپنی کمان لیکر جنگل کو نِکل جا اور میرے لئِے شکار مار لا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور میری حسبِ پسند لذیذ کھانا میرے لئِے تیاّر کر کے میرے آگے لے آتا کہ مَیں کھاؤں اور اپنے مَرنے سے پہلے دِل سے تُجھے دُعا دوُں۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور جب اِضؔحاق اپنے بیٹے عؔیسو سے باتیں کر رہا تھا تو رِبؔقہ سُن رہی تھی اور عؔیسو جنگل کو نِکل گیا کہ شکار مار کر لائے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب رِبؔقہ نے اپنے بیٹے یعقؔوب سے کہا کہ دیکھ مَیں نے تیرے باپ کو تیرے بھائی عؔیسو سے یہ کہتے سُنا کہ ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "میرے لئَےشِکار مار کر لذید کھانا میرے واسطے تیار کر تا کہ مَیں کھاؤں اور اپنے مرنے سے پیشتر خُداوند کے آگے تجھے دُعا دُوں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "سو اَے میرے بیٹے اِس حُکم کے مُطابق جو مَیں تجھے دیتی ہُوں میری بات کو مان۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور جا کر ریوڑ میں سے بکری کے دو اچھّے اچھّے بچےّ مجھے لا دے اور مَیں اُنکو لیکر تیرے باپ کے لئِے اُسکی حسبِ پسند لزید کھانا تیاّر کر دُونگی ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور تُو اُسے اپنے باپ کے آگے لیجانا تا کہ وہ کھائے اور پنے مرنے سے پیشتر تجھے دُعا دے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب یعقؔوب نے اپنی ماں رِؔبقہ سے کہا دیکھ میرے بھائی عیؔسو کے جس پر بال لیں اور میرا جِسم صاف ہے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "شاید میرا باپ مجھے ٹٹولے تو مَیں اُسکی نظر میں ڈغا باز ٹھہر ؤنگا اور برکت نہیں بلکہ لعنت کماؤنگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اُسکی ماں نے اُسے کہا اَے میرے بیٹے ! تیری لعنت مجھ پر آئے ۔ تُو صِرف میری بات مان اور جا کر وہ بچے مجھے لادے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب وہ گیا اور اُنکو لا کر اپنی ماں کو دیا اور اُسکی ماں نے اُسکے باپ کی حسبِ پسند لذیذ کھانا تیار کیا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور رِؔبقہ نے اپنے بڑے بیٹے عؔیسو کے نفِیس لِباس جو اُسکے پاس گھر میں تھے لیکر اُنکو اپنے چھوٹے بیٹے یعقؔوب کو پہنایا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور بکری کے بچّوں کی کھالیں اُسکے ہاتھوں اور اُسکی گردن پر جہاں بال نہ تھے لپیٹ دیں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور وہ لِذیذ کھانا اور روٹی جو اُس نے تیاّر کی تھی اپنے بیٹے یعقؔوب کے ہاتھ میں دیدی۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب اُس نے باپ کے پاس آکر کہا اَے میرے باپ ! اُس نے کہا مَیں حاضرِ ہُوں ۔ تُو کون ہے میرے بیٹے؟۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "یعؔقوب نے اپنے باپ سے کہا مَیں تیرا پہلوٹھا بیٹا عؔیسوہُوں ۔ مَیں نے تیرے کہنے کے مُطابق کِیا ہے ۔ سو ذرا اُٹھ اور بیٹھ کر میرے شِکار کا گوشت کھا تا کہ تُو چِل سے مُجھے دُعا دے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب اِضؔحاق نے اپنے بیٹے سے کہا بیٹا! تُجھے یہ اِس قدر جلد کَیسے مل گیا؟ اُس نے کہا اَسلئِے کہ خُداوند تیرے خُدا نے میرا کام بنا دیا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تب اَضؔحاق نے یعقؔوب سے کہا اَے میرے بیٹے ذرا نزدیک آکہ مَیں تُجھے ٹٹولوں کہ تُو میرا بیٹا عؔیسو ہے یا نہیں",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور یعؔقوب اپنے باپ اِضؔحاق کے نزدیک گیا اور اُس نے اُسے ٹٹول کر کہا کہ آواز تو یعؔقوب کی ہے پر ہاتھ عؔیسو کے ہیں ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُس نے اُسے نہ پہچانا اِسلئِے کہ اُسکے ہاتھو ں پر اُسکے بھائی عؔیسو کے ہاتھوں کی طرح بال تھے۔ سو اُس نے اُسے دُعا دی۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُس نے پوچھا کہ کیا تو میرا بیٹا عؔیسو ہی ہے۔ اُس نے کہا مَیں وہی ہُوں۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "تب اُس نے کہا کھانا میرے آگے لے آ اور مَیں اپنے بیٹے کے شِکار کا گوشت کھاؤنگا تکہ دِل سے تجھے دُعا دُوں ۔ سو وہ اُسے اُسکے نزدیک لے آیا اور اُس نے کھایا اور وہ اُسکے لئِے مَے لایا اور اُس نے پی۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "پھر اُسکے باپ اِضؔحاق نے اُس سے کہا اَے میرے بیٹے ! اب پاس آکر مجھے چُوم ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اُس نے پاس جا کر اُسے چوُما۔ تب اُس نے اُسکے لباس کی خُوشُبو پائی اور اُسے دُعا دیکر کہا دیکھو ! میرے بیٹے کی مہک اُس کھیت کی مہک کی مانِند ہےجِسے خُداوند نے برکت دی ہو۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "خُدا آسمان کی اوس اور زمین کی فربہی اور بہت سا اناج اور مَے تجھے بخشے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "قَومیں تیری خدمت کریں اور قبیلے تیرے سامنے جُھکیں!تُو اپنے بھائیوں کا سردار ہواور تیری ماں کے بیٹے تیرے آگے جُھکیں !جو تُجھ پر لعنت کرے وہ خُد لعنتی ہواور جو مُجھے دُعا دے وہ برکت پائے!۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "جب اِضؔحاق یعقؔوب کو دُعا دے چُکا اور یعقؔوب اپنے باپ اِضؔحاق کے پاس سے نِکلا ہی تھا کہ اُسکا بھائی عؔیسو اپنے شِکار سے ۔لَوٹا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "وُہ بھی لذیذ کھانا پکا کر اپنے باپ کے پاس لایا اور اپس نے اپنے باپ سے کہا میرا باپ اُٹھ کر اپنے بیٹے کے شِکار کا گوشت کھائے تا کہ چِل سے مجھے دُعا دے۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اُسکے باپ اِضحاق نے اُس سے پُوچھا کہ تُو کَون ہے؟ اُس نے کہا مَیں تیرا پہلوٹھا بیٹا عؔیسو ہوُں۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "تب تو اَضحاؔق بشِدت کانپنے لگا اور اُس نے کہا پھر وہ کَون تھا جو شِکار مار کر میرے پاس لے آیا اور مَیں نے تیرے آنے سے پہلے سب میں سے تھوڑا تھوڑا کھایا اور اُسے دُعا دی ؟ اور مُبارک بھی وہی ہوگا۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "عؔیسو اپنے باپ کی باتیں سُنتے ہی بڑی بلند اور حسترناک آواز سے چِلاّ اُٹھا اور اپنے باپ سے کہا مُجھ کو بھی دُعا دے۔ اَے میرے باپ! مُجھ کو بھی۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اُس نے کہا تیرا بھائی دغا سے آیا اور تیری برکت لے گیا۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "تب اُس نے کہا کیا اُسکا نام یعؔقوب ٹھیک نہیں رکھّا گیا ؟کیونکہ اُس نے دوبارہ مُجھے اڑنگا مارا۔ اُس نے میرا پہلوٹھے کا حق تو لے ہی لِیا تھا اور دیکھ ! اب وہ میری برکت بھی لے گیا۔ پِھر اُس نے کہا کیا تُو نے میرے لئِے کوئی برکت نہیں رکھ چھوڑی ہے؟",
                    },
                    {
                        "verse_num": 37,
                        "text": "اِضؔحاق نے عؔیسو کو جواب دِیا کہ دیکھ مَیں نے اُسے تیرا سردار ٹھہرایا اور اُسکے سب بھائیوں کو اُسکے سپُرد کیا کہ خادم ہوں اور اناج اور مَے اُسکی پرورِش کے لئِے بتائی۔ اب اَے میرے بیٹے تیرے لئِے میں کیا کُروں ۔؟",
                    },
                    {
                        "verse_num": 38,
                        "text": "تب عؔیسو نے اپنے باپ سے کہا کیا تیرے پاس چِلاّ چِلاّ کر رویا۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "تب اُسکے باپ اِضؔحاق نے اُس سے کہا دیکھ! زرخیز زمیں میں تیرا مسک ہواور اُوپر سے آسمان کی شبنم اُس پر پڑے!۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "تیری اَوقات بسری تیری تلوار سے ہو اور تُو اپنے بھائی کی خِدمت کرے!اور جب تُو آزاد ہوتو اپنے بھائی کا جُوٗا اپنی گردن پر سے اُتار پھینکے۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور عؔیسو نے یعؔقوب سے اُس برکت کے سبب سے جو اُسکے باپ نے اُسے بخشی کینہ رکّھا اور عؔیسو نے اپنے دِل میںکہا کہ میرے باپ کے ماتم کے دِن نزدیک ہیں ۔ پھر مَیں اپنے بھائی یعؔقوب کو ما ڈالوُنگا۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "اور رِؔبقہ کو اُسکے بڑے بیٹے عؔیسو کی یہ باتیں بتائی گئیں ۔ تب اُس نے اپنے چھوٹے بیٹے یعقؔوب کو بُلوا کر اُس سے کہا کہ دیکھ تیرا بائی عؔیسو تجھے مار ڈالنے پر ہے اور یہی سوچ سوچ کر اپنے کو تسلی دے رہا ہے ۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "سو اَے میرے بیٹے تُو میری بات مان اور اُٹھ کر حاؔران کو میرے بائی لؔبن کے پاس بھاگ جا۔",
                    },
                    {
                        "verse_num": 44,
                        "text": "اور تھوڑے دِن اُسکے ساتھ رہ جب تک کہ تیرے بائی کی خفگی اُتر نہ جائے",
                    },
                    {
                        "verse_num": 45,
                        "text": "یعنی جب تک تیرے بھائی کا قہر تیری طرف سے ٹھنڈا نہ ہو اور وہ اُس بات کو جو تُو نے اُس سے کی ہے بھُول نہ جائے ۔ تب مَیں تجھے وہاں سے بُلوا بھیجونگی۔ مَیں ایک ہی دِن میں تُم دونوں کو کیوں کھو بَیٹھوں؟۔",
                    },
                    {
                        "verse_num": 46,
                        "text": "اور رِؔبقہ نے اِضؔحاق سے کہا مَیں حِتّی لڑکیوں کے سبب سے انی زندگی سے تنگ ہُوں ۔ سو اگر یعؔقوب حِتّی لڑکیوں میں سے جَیسی اِس مُلک کی لڑکیاں ہیں کِسی سے بیا ہ کر لے تو میری زندگی میں کیا لُطف رہیگا۔",
                    }, 
                ],
            },
            {
                "chap_num": 28,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب اِضؔحاق نے یعؔقوب کو بُلایا اور اُسے دُعا دی اور اُسے تاکید کی کہ تُو کنعانی لڑکیوں میں سے کِسی سے بیاہ نہ کرنا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تُ اُٹھ کر فِؔدان ارام کو اپنے ناننا بیتوؔایل کے گھر جا اور وہاں سے سے اپنے ماموں لؔابن کی بیٹیوں میں سے ایک کو بیاہ لا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور قادرِ مُطلق خُدا تجھے برکت بخشے اور تُجے برومند کرے اور بڑھائے کہ تُجھ سے قَوموں کے جتھے پَیدا ہوں۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور وہ ابرؔہام کی برکت تُجھے اور تیرے ساتھ تیری نسل کو دے کہ تیری مسافرت کی یہ سرزمین جو خُدا نے ابؔرہام کو دی تیری میراث ہو جائے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "سو اِضؔحاق نے یعؔقوب کو رُخصت کیا اور وہ فؔدان ارام میں لؔا بن کے پاس جو ارامی بیتؔوایل کا بیٹا اور یعؔقوب اور عؔیسو کی ماں رَبقؔہ کا بائی تھا یا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "پس جب عؔیسو نے دیکھا کہ اِضحاؔق نے یعقوب کو دُعا دیکر اُسے فؔدان ارام کو بیضا ہے تا کہ وہ ہواں سے بیوی بیاہ کر لائے اور اُسے دُعا دیتے وقت یہ تاکید بھی کی ہے کہ تُو کنعانی لڑکیوں میں سے کِسی سے بیاہ نہ کرنا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور یعؔقوب اپنے ماں باپ کی بات مان کر فَدّان ارام کو چلا گیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور عؔیسو نے یہ بھی دیکھا کہ کنعانی لڑکیاں اُسکے باپ اِضؔحاق کو بُری لگتی ہیں۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تو عؔیسو اِسؔمعیل کے پاس گیا اور مؔہلت کو جو اسمؔیعل بِن ابرؔہام کی بیٹی اور نِؔبایوت کی بہن تھ بیاہ کر اُسے اپنی اَور بیویوں میں شامل کیا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور یعؔقوب بیرؔسبع سے نِکل کر حاؔران کی طرف چلا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور ایک جگہ پہنچ کر ساری رات وہیں رہا کیونکہ سُورج ڈوب گیا تھا اور اُس نے اُس جگہ کے پتھروں میں سے ایک اُٹھا کر اپنے سرہانے دھر لیا اور اُسی جگہ سونے کو لیٹ گیا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خُواب میں کیادیکھتا ہے کہ ایک سیڑھی زمین پر کھڑی ہے۔ اور اُسکا سِرا آسمان تک پہنچا ہُوا ہے اور خُدا کے فرشتے اُس پر سے چڑھتے اُترتے ہیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور خُداوند اُسکے اُوپر کھڑا کہہ رہا ہے کہ مَیں خُداوند تیرے باپ اؔبرہام کا خُدا اور اِضؔحاق کا خُدا ہُوں ۔ مَیں یہ زمیں جس پر تُو لیٹا ہے تجھے اور تیری نسل کو دُونگا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور تیری نسل زمین کی گرد کے ذرّوں کی مانِند ہوگی اور تُو مشرق اور مغرب اور شمال اور جنوب میں پَھیل جائیگا اور زمین کے سب قبیلے تیرے اور تیری نسل کے وسیلہ سے برکت پائینگے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور دیکھ مَیں تیرے ساتھ ہُوں اور ہر جگہ جہاں کہیں تُو جائے تیری حِفاظت کرُونگا اور تجھ کو اِس مُلک میں پِھر لاؤنگا اور جو مَٰن نے تجھ سے کہا ہے جب تک اُسے پُورا نہ کر لُوں تجھے نہیں چوڑونگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تب یعؔقوب جاگ اُٹھا اور کہنے لگا کہ یقیناً خُداوند اِس جگہ ہے اور مُجھے معلوم نہ تھا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اُس نے ڈر کر کہا یہ کَیسی بھیانک جگہ ہے ! سو یہ خُدا کے گھر اور آسمان کے آستانہ کے سِوا اَور کُچھ نہ ہوگا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور یعقؔوب صبُح سویرے اُٹھا اور اُس پتھر کو جِسے اُس نے اپنے سرہانے دھرا تھا لیکر ستون کی طرح کھڑا کیا اور اُسکے سِرے پر تیل ڈالا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اُس جگہ کا نام بیؔت ایل رکھا لیکن پہلے اُس بستی کا نام لُوزؔ تھا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یعقوؔب نے مَنت مانی اور کہا کہ اگر خُدا میرے ساتھ رہے اور جو سفر مَیں کر رہا ہُوں اور اِس میں میری حفاظت کرے اور مُجھے کھانے کو روٹی اور پہننے کو کپڑا دیتا رہے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور میں اپنے باپ کے گھر سلامت لَوٹ آؤن تو خُداوند میرا خُدا ہوگا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور یہ پتھر جو مَیں نے ستون سا کھڑا کیا ہے خُدا کا گھر ہوگا اور جو کُچھ تُو مجھے دے اُسکا دسواں حصّہ ضرور ہی تُجھے دِیا کرُونگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 29,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یعؔقوب آگے چل کر مشرقی لوگوں کے مُلک میں پہنچا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": " اور اُس نے دیکھا کہ مَیدان میں ایک کُوآں ہے اور کُوئیں کے نزدیک بھیڑ بکریوں کے تین ریوڑ بیٹھے ہیں کیونکہ چرواہے اِسی کُوئیں سے ریوڑوں کو پانی پلاتے تھے اور کُوئیں کے مُنہ پر ایک بڑا پتھر دحرا رہتا تھا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": " اور جب سب ریوڑ وہاں اِکھٹے ہوتے تھے تب وہ اُس پتھر کو کوئیں کے مُنہ پر سے ڈھلکاتے اور بھیڑوں کو پانی پلا کر اُس پتھر کو پِھر اُسی جگہ کُوئیں کے مُنہ پر رکھ دیتے تھے ۔ ",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب یعؔقوب نے اُن سے کہا اَے میرے بھائیوں تُم کہاں کے ہو؟ اُنہوں نے کہا ہم حؔاران کے ہیں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "پھر اُس نے پُوچھا کہ تُم نؔحُور کے بیٹے لؔابن سے واقف ہوَ انُہوں نے کہا کہ ہم واقف ہیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اُس نے پُوچھا کیا وہ خیریت سے ہے ۔؟ اُنہوں نے کہا خَیریت سے ہے اور وہ دیکھ اُسکی بیٹی راؔخل بھیڑ بکریوں کے ساتھ چلی آتی ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے کہا دیکھو ابھی تو دِن بہت ہے اور چوپایوں کے جمع ہونے کا وقت نہیں ۔ تُم بھیڑ بکریوں کو پانی پلا کر پھر چرانے کو لے جاؤ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اُنہوں نے کہا ہم اَیسا نہیں کر سکتے جب تک کہ سب ریوڑ جمع نہ ہو جائیں ۔ تب ہم اُس پتھر ہم اُ س پتھر کو کُوئیں کے منہ پر سے ڈھلکاتے ہیں اور بھیڑ بکریوں کو پانی پلاتے ہیں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "وہ اُن سے باتیں کر ہی رہا تھا کہ رؔاخل اپنے باپ کی بھیڑ بکریوں کے ساتھ آئی کیونکہ وہ اُنکو چرایا کرتی تھی۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "جب یعقؔوب نے اپنے ماموں لؔابن کی بیٹی راؔخل کو اور اپنے ماموں لابؔن کے ریوڑ کو دیکھا تو وہ نزدیک گیا اور پتھر کو کُوئیں کے مُنہ پر سے ڈھلکا کر اپنے ماموں لؔابن کے ریوڑ کو پانی پلایا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور یؔعقوب نے راؔخل سے کو چُوما اور چِلاّ چِلّا کر رویا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور یعقؔوب نے راؔخل سے کہا کہ مَیں تیرے باپ کا رشتہ دار اور رِؔبقہ کا بیٹا ہوں ۔ تب اُس نے دَوڑ کر اپنے باپ کو خبر دی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "لؔابن اپنے بھانچے کی خبر پاتے ہی اُس سے مِلنے کو دَوڑا اور اُسکو گلے لگایا اور چُوما اور اُسے اپنے گھر لیا تب اُس نے لؔابن کو اپنا سارا حال بتایا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "لؔابن نے اُسے کہا کہ تُو واقعی میری ہڈّی اور میرا گوشت ہے ۔ سو وہ ایک مہینہ اُسکے ساتھ رہا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب لؔابن نے یعؔقوب سے کہا چونکہ تُو میرا رِشتہ دار ہے تو کیا اِسلئِے لازِم ہے کہ تُو میری خِدمت مفت کرے؟ سو مُجھے بتا کہ تیری اُجرت کیا ہوگی ؟",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور لؔابن کی دو بیٹیاں تھیں ۔ بڑی کا نام لؔیاہ اور چھوڑی کا نام رؔاخِل تھا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "لؔیاہ کی آنکھیں چُندھی تھیں پر رؔاخل حسین اور خوبصورت تھی۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور یعقوب رؔاخل پر فریفتہ تھا۔ سو اپس نے کہا کہ تیری چھوٹی بیٹی رؔاخل کی خاطر میں سات برس تیری خدمت کر دُونگا۔",
                    },
                    {
                        "verse_num": 19,
                        "text" : " لاؔبن نے کہا اُسے غیر آدمی کو دینے کی جگہ تو تجھی کو دینا بہتر ہے ۔ تُو میرے پاس رہ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "چُنانچہ یؔعقوب سات بر س تک راؔخل کی خاطر خدمت کرتا رہا پر وہ اُسے رؔاخل کی محّت کے سبب سے چند دِنوں کے برابر معلوم ہُوئے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور یعؔقوب نے لؔابن سے کہا کہ میری مُدّت پُوری ہو گئی ۔ سو میری بیوی مُجھے دے تا کہ مَیں اُسکے پاس جاؤں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "تب لؔابن نے اُس جگہ کے سب لوگوں کو بُلا کر جمع کیا اور اُنکی ضیافت کی۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور جب شام ہوئی تو اپنی بیٹی لؔیاہ کو اُسکے پاس لے آیا اور یعؔقوب اُس سے ہم آغوش ہُوا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور لؔابن نے اپنی لَونڈی زِؔلفہ اپنی بیٹی لؔیاہ کے ساتھ کر دی کہ اُسکی لَونڈی ہو۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "جب صُبح کو معلوم ہُوا کہ یہ تو لؔیاہ ہے تب اُس نے لؔابن سے کہ کہ تُو نے مُجھ سے یہ کیا کیا؟ کیا میں نے جو تیری خدمت کی وہا رؔاکل کی خاطر نہ تھی؟ پھر تُونے کیوں مجھے دُھوکا دیا ؟",
                    },
                    {
                        "verse_num": 26,
                        "text": "لؔابن نے کہا ہمارے مُلک میں یہ دستور نہیں کہ پہلوٹی سے پہلے چھوٹی کو بیاہ دیں ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "تُو اِسکا ہفتہ پُورا کر دے پِھر ہم دُوسری بھی تُجھے دیدینگے جِسکی خاطر تجھے سات برس اَور میری خدمت کرنی ہوگی۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "یؔعقوب نے اٰسا ہی کِیا کہ ۔ؔیاہ کا ہفتہ پُورا کیا تب لؔبن نے اپنی بیتی رؔاخِل بھی اُسے بیاہ دی۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور اپنی لَونڈی بِلؔہاہ اپنی بیٹی رؔاخِل کے ساتھ کر دی کہ اُسکی لَونڈی ہو۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "سو وہ رؔاخِل سے بھی ہم آغوش ہُوا اور وہ ۔ؔیاہ سے زیداہ رؔاخل کو چاہتا تھا اور ست برس اَور ساتھ رہ کر لؔابن کی خدمت کی۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور جب خُداوند نے دیکھا کہ لؔیاہ سے نفرت کی گئی تو اُس نے اُسکا رَحِم کھولا مگر رؔاخَل بانجھ رہی ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور لؔیاہ حامِلہ ہُوئی اور اُسکے بیٹا ہُوا اور اُس نے اُسکا نام رؔوبن رکھاّ کیونکہ اُس نے کہا کہ خُداوند نے میرا دُکھ دیکھ لیا سو میرا شوہر اب مُجھے پیرا کریگا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "وہ پھر حامِلہ ہوئی اور اُسکے بیٹا ہُوا ۔ تب اُس نے کہا کہ خُداوند نے سُنا کہ مُجھ سے نفرت کی گئی اِسلئِے اُس نے مُجھے یہ بھی بخشا۔ سو اُس نے اُسکا نام شمعؔون رکھا۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور وہ پِھر حاملہ ہوئی اور اُسکے بیٹا ہُوا۔ تب اُس نے کہا کہ اب اِس بار میرے شوہر کو مُجھ سے لگن ہوگی کیونکہ اُس سے میرے تین بیٹے ہوئے اِسلئِے اُسک انام لؔاوی رکّھا گیا۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور وہ پِھر حامِلہ ہوئی اور اُسکے بیٹا ہُوا ۔ تب اُس نے کہا کہ اب مَیں خُداوند کی ستایش کرونگی اِسلئے اُسکا نام یہؔوداہ رکھّا۔ پھر اُسکے اَولاد ہونے میں توقُف ہُوا۔",
                    },
                ],
            },
            {
                "chap_num": 30,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اَور جب رؔاخل نے دیکھا کہ یعؔقوب سے اُسکے اَولاد نہیں ہوتی تو راؔخل کو اپنی بہن پر رشک آیا سو وہ یعؔقوب سے کہنے لگی کہ مُجھے بھی اولد دے نہیں تو مَیں مر جاؤنگی ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اَور جب رؔاخل نے دیکھا کہ یعؔقوب سے اُسکے اَولاد نہیں ہوتی تو راؔخل کو اپنی بہن پر رشک آیا سو وہ یعؔقوب سے کہنے لگی کہ مُجھے بھی اولد دے نہیں تو مَیں مر جاؤنگی ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اُس نے کہا دیکھ میری لَونڈی بلؔہاہ حاضر ہے ۔ اُسکے پاس جا تاکہ میرے لئے اُس سے اَولاد ہو اور وہ اولاد میری ٹھہرے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُس نے اپنی لَونڈی بِلؔہاہ کو اُسے دیا کہ اُسکی بیوی بنے اور یعؔقوب اُسکے پاس گیا",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور بِلؔہاہ حامِلہ ہوئی اور یعقؔوب سے اُسکے بیٹا ہُوا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب رؔاخل نے کہا کہ خُدا نے میرا اِنصاف کِیا اور میری فریاد بھی سُنی اور مُجھ کو بیٹا بخشا اِسلئے اُس نے اُسکا نام دؔان رکھاّ ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور رؔاخل نے کی لَونڈی بلؔہاہ پھر حاملہ ہُوئی اور یعؔقوب سے اُسکے دُوسرا بیٹا ہُوا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب رؔاخل نے کہا مَیں اپنی بہن کے ساتھ نہایت زور مار مار کر کُشتی لڑی اور مَیں نے فتح پائی۔ سو اپس نے اُسکا نام نفؔتالی رکّھا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "جب لؔیاہ نے دیکھا کہ وہ جننے سے رہ گئی تو اُس نے اپنی لَونڈی زؔلفہ کو لیکر یعقؔوب کو دیا کہ اُسکی بیوی بنے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور لؔیاہ کی لَونڈی زِؔلفہ کے بھی یعؔقوب سے ایک بیٹا ہُوا۔ ",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب لؔیاہ کہا زہے قسمت ! سو اُس نے اُسکا نام جؔد رکھا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب لیؔاہ کی لَونڈی زِؔلفہ کے یعؔقوب سے پھر ایک بیٹا ہُوا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب لؔیاہ نے کہا کہ میں خُوش قِسمت ہُوں ۔ عورتیں مجھے خوش قسمت کہینگی اور اُس نے اُسکا نام آشؔر رکّھا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور رؔوبن گیہوں کاٹنے کے موسم میں گھر سے نِکلا اور اُسے کھیت میں مردُم گیاہ مِل گئے اور وہ اپنی ماں لؔیاہ کے پاس لے آیا۔ تب رؔاخل نے لؔیاہ سے کہا کہ اپنے بیٹے کے مردُم گیاہ میں سے مجھے بھی کُچھ دیدے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اُس نے کہا کیا یہ چھوٹی بات ہے کہ تُو نے میرے شوہر کو لے لیا اور اب کیا میرے بیٹے کے مردُم گیاہ بھی لینا چاہتی ہے؟ راؔخل نے کہا بس تو آج رات وہ تیرے بیٹے کے مردُم گیاہ کی خاطر تیرے ساتھ سوئیگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جب یعؔقوب شام کو کھیت سے آرہا تھا تو لؔیاہ آگے سے اُس سے مِلنے کو گئی اور کہنے لگی کہ تجھے میرے پاس آنا ہوگا کیونکہ مَیں نے اپنے بیٹے کے مردُم گیاہ کے بدلے تجھے اُجرت پر لیا ہے ۔ سو وہ اُس رات اُسی کے ساتھ سویا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور خُدا نے لِؔیاہ کی سُنی اور وہ حامِلہ ہوئی اور یعؔقوب سے اُسکے پانچواں بیٹا ہُوا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب لِؔیاہ نے کہا کہ خُدا نے میری اُجرت مُجھے دی کیونکہ مَیں نے اپنے شوہر کو اپنی لَونڈی دی اور اُس نے اُسکا نام ابؔشکا رکھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور لِؔیاہ پھر حامِلہ ہوئی اور یعؔقوب سے اُسکے چھٹا بیٹا ہُوا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب لؔیاہ نے کہا کہ خُد ا نے اچھا مہر مجھے بخشا ۔ اب میرا شہوہر میرے ساتھ رہیگا کیونکہ میرے اُس سے چھ بیتے ہو چکے ہیں ۔ سو اُس نے اُس کا نام زبلُون رکھّا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اِسکے بعد اُسکے ایک بیٹی ہوئی اور اُس نے اُسکا نام وؔینہ رکھا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُدا نے راؔخل کو یاد کیا اور خُدا نے اُسکی سُن کر اُسکے رَحم کو کھولا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور وہ حامِلہ ہوئی اور اُسکے بیٹا ہُوا۔ تب اُس نے کہا کہ خُدا نے مُجھ سے رُسوائی دُور کی ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُس نے اُسک انام یُوسؔف یہ کہہ کر رکّھا کہ خُداوند مُجھ کو ایک اور بیٹا بخشے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور جب رؔاخِل سے یوُسؔف پیدا ہوا تو یعؔقوب نے لؔابن سے کہا مُجھے رُخصت کر کہ مَیں اپنے گھر اور اپنے وطن کو جاؤں۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "میری بیویاں اور میرے بال بچے جنکی خاطرِ مَیں نے تیری خدمت کی ہے میرے حوالہ کر اور مُجھے جانے دے کیونکہ تُو آپ جانتا ہے کہ میں نے تیری کَیسی خِدمت کی ہے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "تب لؔابن نے اُسے کہا اگر مُجھ پر تیرے کرم کی نظر ہے تو یہیں رہ کیونکہ مَیں جان گیا ہُوں کہ خُداوند نے تیرے سبب سے مُجھ کو برکت بخشی ہے۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور یہ بھی کہا کہ مُجھ سے اپنی اُجرت ٹھہرالے اور مَٰن تجھے دِیا کرونگا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اُس نے اُسے کہا کہ تُو آپ جانتا ہے کہ مَیں نے تیری کیسی خدمت کی اور تیرے جانور میرے ساتھ کیَسے رہے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "کیونکہ میرے آنے سے پہلے یہ تھوڑے تھے اور اب بڑھ کر بہت سے ہو گئے ہیں اور خُداوند نے جہاں جہاں میرے قدم پڑے تجھے برکت بخشی ۔ اب مَیں اپنے گھر کا بندوبست کب کرو۔؟",
                    },
                    {
                        "verse_num": 31,
                        "text": "اُ س نے کہا تجھے مَیں کیا دُوں؟ یعؔقوب نے کہا تو مجھے کُچھ نہ دینا پر اگر تُو میرے لئےِ ایک کام کردے تو مَیں تیری بھیڑ بکریوں کو پھر چراؤنگا اور اُنکی نِگہبانی کرُونگا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "مَیں آج تیری سب بھیڑ بکریوں میں چکر لگاؤنگا اور جتنی بھیڑیں چِتلی اور ابلق اور کالی ہوں اور جتنی بکریا ابلق اور چِتلی ہوں اُن سب کو الگ ایک طرف کردُونگا۔ اِن ہی کو میں اپنی اُجرت ٹھہراتا ہوں ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اورآیندہ جب کبھی میری اُجرت کا حِساب تیرے سامنے ہو تو میری صداقت آپ میری طرف سے ا،س طرح بول اُٹھیگی کہ جو بکریاں چِتلی اور ابلق نہیں اور جو بھیڑیں کالی نہیں اگر وہ میرے پاس ہوں تو چُرائی ہوئی سمجھی جائینگی ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "لؔابن نے کہا مَیں راضی ہُوں۔ جو تُو کہے وُہی سہی ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اُس نے اُسی روز دھار یدار اور ابلق بکروں کو اور سب چتلی اور ابلق بکریوں کو جن میں کُچھ سفید ی تھی اور تیمام کالی بیڑوں کو الگ کرک ے اُنکو اپنے بیٹوں کے حوالہ کِیا۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور اُس نے اپنے اور یعؔقوب کے درمیان تین دِن کے سفر کا فاصلہ ٹھہرایا اور یعؔقوب لؔابن کے باقی ریوڑوں کو چرانے لگا ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور یعؔقوب نے سفیدہ اور بادام اور چنار کی ہری ہری چھڑیاں لیں اور اُنکو چھیل چھیل کر اِس طرح گنڈیدار بنا لیا کہ اُن چھڑیوں کی سفیدی دِکھائی دینے لگی۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور اُس نے وہ گنڈیدار چھڑیاں بھیڑ بکریوں کے سامنے حَوضوں اور نالیوں میں جہاں وہ پانی پینے آتی تھیں کھڑی کر دیں اور جب وہ پانی پینے آئیں سو گابھن ہوگئیں ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "اور اُن چھڑیوں کے آگے گابن ہونے کی وجہ سے اُنہوں نے دھاریدار چتلے اور ابلق بچے دِئے۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "اور یعؔقوب نے گھیڑ بکریوں کے اُن بچوں کو الگ کیا اور لاؔبن کی بھیڑ بکریوں کے منہ دھاریدار اور کالے بچوں کی طرف پھیر دِئے ۔ اور اُس نے اپنے ریوڑوں کو جُدا کِیا اور لؔابن کی بھیڑ بکریوں میں مِلنے نہ دِیا۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور جب مضبوط بھیڑ بکریاں گابھن ہوتی تھیں تو یعؔقوب چھڑیوں کو نالیوں میں اُن کی آنکھوں کے سامنے رکھ دیتا تھا تاکہ وہ اُن چھڑیوں کے آگے گابھن ہوں۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "پر جب بھیڑ بکریاں دُبلی ہوتیں تو وہ اُنکو وہاں نہیں رکھتا تھا۔ سو دُبلی تو لاؔبن کی رہیں اور مضبوط یعؔقوب کی ہوگئیں ۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "چنانچہ وہ نہایت بڑھتا گیا اور اُسکے پاس بہت سے ریوڑ اور لَونڈیاں اور نوکر چاکر اور اُونٹ اور گدھے ہوگئے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 31,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اُس نے لاؔبن کے بیٹیوں کی یہ باتیں سُنیں کہ یعؔقوب نے ہمارے باپ کا سب کُچھ لے لیا اور ہمارے باپ کے مال کی بدَولت اُسکی یہ ساری شان و شوکت ہے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور یعؔقوب نے لاؔبن کے چہرے کو دیکھ کر تاڑ لِیا کہ اُسکا رُخ پہلے سے بدلا ہُوا ہے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور خُداوند نے یعؔقوب سے کہا کہ تُو اپنے باپ دادا کے مُلک کو اور اپنے رشتہ داروں کے پاس لَوٹ جا اور مَیں تیرے ساتھ رہُونگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب یعقؔوب نے رؔاخل اور لؔیاہ کو مَیدان میں جہاں اُسکی بھیڑ بکریاں تھیں بُلوایا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُن سے کہا مَیں دیکھتا ہوں کہ تمہارے باپ کا رُخ پہلے سے بدلا ہُوا ہے پر میرے باپ کا خُدا میرے ساتھ رہا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تم تو جانتی ہو کہ مَیں نے اپنے مقدور بھر تمہارے باپ کی خِدمت کی ہے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "لیکن تُمہارے باپ نے مُجھے دُھوکا دیکر دس بار میری مزدوری بدلی پر خُدا نے اُسکو مجھے نقصان پہنچانے نہ دیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "جب اُس نے یہ کہا کہ چِتلے بچے دینے لگیں اور جب کہا کہ دھار یدار بچے تیرے ہونگے تو بھیڑ بکریان چِتلے بچے دینے لگیں اور جب کہا کہ دھاریدار بچے تیرے ہونگے تو بھیڑ بکریوں نے دھاریدار بچے دِئے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "یوُں خُدا نے تمہارے باپ کے جانور لیکر مُجھے دیدئے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور جب بھیڑ بکریاں گا بھن ہُوئیں تو مَیں نے خواب میں دیکھا کہ جو بکرے بکریوں پر چڑھ رہے ہیں سو داریدار چتلے اورچتکبرے ہیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور خُدا کے فرشتہ نے خواب میں مُجھ سے کہا اَے یعؔقوب ! مَیں نے کہا مَیں حاضرِ ہوں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب اُس نے کہا کہ اب توُ اپنی آنکھ اُٹھا کر دیکھ کہ سب بکرے جو بکریوں پر چڑھ رہے ہیں دھاریدار چِتلے اور چتکبرے ہیں کیونکہ جو کُچھ لاؔبن تجھ سے کرتا ہے مَیں نے دیکھا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "مَیں بیؔت ایل کا خُدا ہُوں جہاں تُو نے ستُون پر تیل ڈالا اور میری مَنت مانی ۔ پس اب اُٹھ اور اِس مُلک سے نکل کر اپنی زادبُوم کو لَوٹ جا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب رؔاخل اور لَیاؔہ نے اُسے جواب دیا کیا اب بھی ہمارے باپ کے گھر میں کُچھ ہمارا بخرہ یامیراث ہے؟",
                    },
                    {
                        "verse_num": 15,
                        "text": "کیا وہ ہم کو اجنبی کے برابر نہیں سمجھتا؟ کیونکہ اپس نے ہمکو بھی بیچ ڈالا اور ہمارے روپے بھی کھا بیٹھا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اِسلئے اب جو دَولت کُدا نے ہمارے باپ سے لی وہ ہماری اور ہمارے فرزندوں کی ہے ۔ پس جو کُچھ خُدا نے تجھ سے کہا ہے وہی کر۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب یعؔقوب نے اُٹھ کر اپنے بال بچوں اور بیویوں کو اُونٹوں پر بِٹھایا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اپنے سب جانوروں اور مال و اسباب کو جو اُس نے اِکٹھاکیا تھا یعنی وہ جانور جو اُسے فؔدّان ارام میں اُجرت میں مِلے تھے لیکر چلا تا کہ مُلکِ کنعان میں اپنے باپ اِضحاؔق کے پاس جائے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور لاؔبن اپنی بھیڑوں کو پسم کترنے کو گیا ہُوا تھا۔ سو راؔخل اپنے باپ کے بُتوں کو چُرالے گئی۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یعقؔوب لاؔبن ارامی کے پاس سے چوری سے چلا گیا کونکہ اُسے اُس نے اپنے بھاگنے کی خبر نہ دی۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "سو وہ اپنا سب کُچھ لیکر بھاگا اور دریا پار ہو کر اپنا رُخ کوِ جلؔعاد کی طرف کِیا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور تیسرے دِن لاؔبن کو خبر ہوئی کہ یعؔقوب بھاگ گیا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب اُس نے اپنے بھائیوں کو ہمرا لیکر سات منزل تک اُسکا تعاقب کیا اور جلؔعاد کے پہاڑ پر اُسے جا پکڑا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور رات کو خُدا لاؔبن ارامی کے پاس خواب میں آیا اور اُس سے کہا خبردار تو یعؔقوب کر بُرایا بھلا کُچھ نہ کہنا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور لاؔبن یعؔقوب کے برابر جا پہنچا اور یعقؔوب نے اپنا خیمہ پہاڑ پر کھڑا کر رکھّا تھا ۔ سو لاؔبن نے بھی اپنے بھائیوں کے ساتھ جِلؔعاد کے پہاڑ پر ڈیرا لگا لیا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تب لاؔبن نے یؑقوب سے کہا کہ تُو نے یہ کیا کیا کہ میرے پاس سے چوری سے چلا آیا اور میری بیٹیوں کو بھی اِس طرح لے آیا گویا وہ تلوار سے اسیرکی گئی ہے؟",
                    },
                    {
                        "verse_num": 27,
                        "text": "تُو چھپ کر کیون بھاگا اور میرے پاس سے چوری سے کیوں چلا آیا اور مجے کچھ کہا بھی نہیں ورنہ مَیں تجھے خوشی خوشی طبلے اور بربط کے ساتھ گاتے بجاتے روانہ کرتا؟",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور مجھے اپنے بیٹوں اور نیٹیوں کو چومنے بھی نہ دیا؟ یہ تُو نے بیہودہ کام کیا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "مُجھ میں اِتنا مقدور ہے کہ تُم کو دُکھ دُوں لیکن تیرے باپ کے خُدا نے کل رات مُجھے یُوں کہ کہ خبردار تُو یعؔقوب کو بُرا یا بھلا کچھ نہ کہنا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "خیر! اب تپو چلا آیا تو چلا آیا کیونکہ تُو اپنے باپ کے گھر کا بہت مُشتاق ہے لین میرے بُتوں کو کیوں چُرالایا؟",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب یعقوب نے لاؔبن سے کہ ااِسلئِے کہ مَیں ڈرا کیونکہ مَیں نے سوچا کہ کہیں تو اپنی بیٹیوں کی جبرا! مُجھ سے چھین نہ لے۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اب جِسکے پاس تجھےتیرے بُت مِلیں وہ جیتا نہیں بچیگا۔ تیرا جو کُچھ میرے پاس نِکلے اُسے اِن بھائیوں کے آگے پہچان کر لیلے کیونکہ یعؔقوب کو معلوم نہ تھا کہ رؔاخِل اُن بُتوں کو چُرالائی ہے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "چُنانچہ لاؔبن یعقؔوب اور لِؔیاہ اور دونوں لَونڈیوں کے خِیموں میں گیا پر اُنکو وہاں نہ پایا تب وہ لؔیاہ کے خیمہ سے نکل کر رؔاخِل کے خَیمہ میں داخِل ہُوا۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور رؔاخِل اُن بُتوں کو لیکر اور اُنکو اُونٹ کے کحاہ وہ میں رکھ کر اُن پر بَیٹھ گئی تھی اور لاؔبن نے سارے خَیمہ میں ٹٹول ٹٹول کر دیکھ لِیا پر اُنکو نہ پایا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "تب وہ اپنے باپ سے کہنے لگی کہ اَے میرے بُزرگ! تُو اِس بات سے ناراض نہ ہونا کہ مِیں نے تیرے آگے اُٹ نہیں سکتی کیونکہ مَیں اَیسے حال میں ہُوں جو عورتوں کا ہُوا کر تا ہے سو اُس نے ڈُھونڈا پر وہ بُت اُسکو نہ مِلے ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "تب یعؔقوب نے غضبناک ہو کر لاؔبن کو ملامت کی اور یعقؔوب لاؔبن سے کہنے لگا کہ میرا کیا جُرم اور کیا قصُور ہے کہ تُو نے اَیسی تُندی سے میرا تعاقُب کیا؟",
                    },
                    {
                        "verse_num": 37,
                        "text": "تُو نے جو میرا سارا اسباب ٹٹول ٹٹول کر دیکھ لِیا تو تُجھے تیرے گھر کے اسباب میں سے کیا چیز مِلی؟ اگر کُچھ ہے تو اُسے میرے اور اپنے اِن بھائیوں کے آگے رکھ کہ وہ ہم دونوں کے درمیان اِنصاف کریں ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "مَیں پُورے بِیس برس تیرے ساتھ رہا۔ نہ تو کبھی تیری بھیڑوں اور بکریوں کا گابھ گِرا اور نہ تیرے ریوڑ کے مینڈے میں نے کھائے۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "جِسے درندوں نے پھاڑا مِیں اُسے تیرے پاس نہ لایا۔ اُسکا نقصان مِیں نے سہا ۔ جو دِن کو یا رات کو چوری گیا اُسے تُونے مجھ سے طلب کیا۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "میرا ھال یہ رہا کہ مِیں دِن کو گرمی اور رات کو سردی میں مرا اور میری آنکھو سے نیند دُور رہتی تھی۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "مِیں بیس برس تک تیرے گھر میں رہا۔ چَودہ برس تک تو مَیں نے تیری دونوں بیٹیوں کی خاطِر اور چھ برس تک تیری بھیڑبکریوں کی خاطِر تیری خدِمت کی اور تُو نے دس بار میری مزدُوری بدل ڈالی۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "اگر میرے باپ کا خُدا ابرؔہام کامعبود جِسکا رُعب اِضؔحاق مانتا تھا میری طرف نہ ہوتا تو ضرور ہی تپو اب مُجھے خالی ہتھ جانے دیتا ۔ خُدا نے میری مُصیبت اور میرے ہاتھوں کی محنت دیکھی ہے اور کل رات تجھے ڈانٹا بھی۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "تب لاؔبن نے یعقؔوب کو جواب دِیا کہ یہ بیٹیاں میری اور یہ لڑکے بھی میرے اور یہ بھیڑ بکریاں بھی میری ہیں بلکہ جو کُچھ تُجھے دِکھائی دیتا ہے وہ سہب میرا ہی ہے ۔ سو میں آج کے دِن اپنی ہی بیٹیوں سے یا اُنکے لڑکوں سے جو اُنکے ہوئے کیا کرسکتا ہوں؟",
                    },
                    {
                        "verse_num": 44,
                        "text": "پس اب آکہ مَیں اور تُو دونوں مِل کر آپس میں ایک عہد بانڈھیں اور وُہی میرے اور تیرے درمیان گواہ رہے ۔",
                    },
                    {
                        "verse_num": 45,
                        "text": "اور یعقوب نے ایک پتھر لیکر اُسے ستون کی طرح کھڑا کیا۔",
                    },
                    {
                        "verse_num": 46,
                        "text": "اور یعؔقوب نے اپنے بھائیوں سے کہا کہ پتھر جمع کرو۔ اُنہوں نے پتھر جمع کرکے ڈھیر لگا دیا اور وہیں اُس ڈھیر کے پاس اُنہوں نے نے کھانا کھایا۔",
                    },
                    {
                        "verse_num": 47,
                        "text": "اور لاُبن نے اُسکا نام یحبر شاہُدو تھا اور یعؔقوب نے جِلعؔاد رکھاّ۔",
                    },
                    {
                        "verse_num": 48,
                        "text": "اور لاؔبن نے کہا کہ یہ ڈھیر آج کے دِن میرے اور تیرے درمیان گواہ ہو۔ اِسی لئےِ جلؔعاد رکّھا گیا۔",
                    },
                    {
                        "verse_num": 49,
                        "text": "اور مِصؔفاہ بھی کیونکہ لاؔبن نے کہا کہ جب ہم ایک دُوسرے سے غیر حاضر ہوں تو خُداوند میرے اور تیرے بیچ نِگرانی کرتا رہے۔",
                    },
                    {
                        "verse_num": 50,
                        "text": "اگر تُو میری بیٹیوں کو دُکھ دے اور اُنکے سِوا اور بیویاں کرے تو کوؑی آدمی ہمارے ساتھ نہیں ہے پر دیکھ خُدا میرے اور تیرے بیچ میں گواہ ہے ۔",
                    },
                    {
                        "verse_num": 51,
                        "text": "لاؔبن نے یعقؔوب سے یہ بھی کہا کہ اِس ڈھیر کو دیکھ اور اِس ستُون کو دیکھ جو مَیں نے اپنے اور تیرے بیچ میں کھڑا کیا ہے۔",
                    },
                    {
                        "verse_num": 52,
                        "text": "یہ ڈھیر گواہ ہو اور یہ سُتون گواہ ہو۔ ضرر پہنچانے کے لِئے نہ تو مَیں اِس ڈھیر سے اُدھر تیری طرف تجاوز کروں اور نہ تو اِس ڈھیر اور ستُون سے اِدھر میری طرف تجاوز کرے۔",
                    },
                    {
                        "verse_num": 53,
                        "text": "ابؔرہام کا خُدا اور نؔحُور کا خُدا اور اُنکے باپ کا خُدا ہمارے بیچ میں اِنصاف کرے اور یعقوب نے اُس ذات کی قِسم کھائی جسکا رُعب ُسکا باپ اِؔضحاق مانتا تھا۔",
                    },
                    {
                        "verse_num": 54,
                        "text": "تب یعؔقوب نے وہیں پہاڑ پر قُربانی چڑھائی اور اپنے بھائیوں کو کھانے پر بُلایا اور اُنہوں نے کھانا کھایا اور رات پہاڑ پر کاٹی۔",
                    },
                    {
                        "verse_num": 55,
                        "text": "اور لابن صبُح سویرے اُٹھا اور اپنے بیٹوں اور اپنی بیٹیوں کو چُوما اور اُنکو دُعا دیکر روانہ ہو گیا اور اپنے مکان کولَوٹا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 32,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یعؔقوب نے بھی اپنی راہ لی اور خُدا کے فرشنے اُسے مِلے ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور یعؔقوب نے اُنکو دیکھ کر کہا کہ یہ خُدا کا لشکر ہے اور اُس جگہ کا نام مَنؔایِم رکھا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور یعقؔوب نے اپنے آگے آگے قاسدوں کو ادوؔم کے مُلک کو جو شؔعیر کی سر زمین میں ہے اپنے بھائی عؔیسو کے پاس بھیجا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُنکو حکم دیا کہ تُم میرے خُداوند عؔیسو سے یہ کہنا کہ آپ کا بندہ یعؔقوب کہتا ہے کہ مَیں لاؔبن کے ہاں مُقیم تھا اور اب تک وہیں رہا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور میرے پاس گائے بیَیل اور گدھے اور بھیڑبکریاں اور نوکر چاکر اور لَونڈیاں ہیں اور مَیں اپنے خُداوند کے پاس اِسلئِے خبر بھیجتا ہُوں کہ مُجھ پر آپ کے کرم کی نظر ہو۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "پس قاصد یعؔقوب کے پاس لَوٹ کر آئےاور کہنے لگے کہ ہم تیرے بھائی عؔیسو کے پاس گئے تھے ۔ وہ چار سَو آدمیوں کو ساتھ لیکر تیری مُلاقات کو آرہا ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب یعؔقوب نہایت ڈر گیا اور پریشان ہُوا اور اُس نے اپنے ساتھ کے لوگوں اور بھیڑ بکریوں اور گائے بیلوں اور اُونٹوں کے دو غول کئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور سوچا کہ اگر عؔیسوایک غول پر آپڑے اور اُسے مارے تو دُورا غول بچھ کر بھاگ جائیگا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور یعؔقوب نے کہا اَے میرے باپ ابؔرہام کے دُدا اور میرے باپ اِضؔحاق کے خُدا ! اَے خُداوند جِس نے مجھے یہ فرمایا کہ تُو اپنے مُلک کو اپنے رِشتہ داروں کے پاس لَوٹ جا اور مَیں تیرے ساتھ بھلائی کرُونگا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "مَیں تیری سب رحمتوں اور وفاداری کے مقابلہ میں جو تُو نے اپنے بندہ کے ساتھ برتی ہے بالکل ہیچ ہوُں کیونکہ مَیں صرف اپنی لاٹھی لیکر اِس یؔردن کے پار گیا تھا اور اب اِیسا ہُوں کہ میرے دو غول ہیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "مَیں تیری مِنت کر تا ہوں کہ مُجھے میرے بھاؑی عؔیسو کے ہاتھ سے بچالے کیونکہ مِیں اُس سے ڈرتا ہوں کہ کہیں وہ آکر مجھے اور بچّوں کو ماں سمیت مار نہ ڈالے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "یہ تیرا ہی فرمان ہے کہ مَیں تیرے ساتھ ضرور بھلائی کرونگا اور تیری نسل کو دریا کی ریت کی مانند بناؤنگا جو کثرت کے سبب سے گِنی نہیں جا سکتی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور وہ اُس رات وہیں رہا اور جو اُسکے پاس تھا اُس میں سے اپنے بھائی عؔیسو کے لئِے یہ نذرانہ لیا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "دو سَو بکریاں اور بیس بکرے ۔ دو سَو بھیڑیں اور بیس مینڈے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور تیس دُودھ دیِنے والی اُونٹنیاں بچّوں سمیت اور چالِیس گائیں اور دَس بَیل بیس گدھیاں اور دس گدھے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُنکو جُدا ضُدا غول کرکے نوکروں کو شَونپا اور اُن سے کہا کہ تُم میرے آگے آگے پار جاؤ اور غولوں کو زرا دُور دُور رکھانا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اُس نے سب سے اگلے غول کے رکھوالے کو حُکم دیا کہ جب میرا بھائی عؔیسو تُجھے مِلے اور تُجھ سے پُوچھے کہ تُو کِس کا نوکر ہے اور کہاں جاتا ہے اور یہ جانور جو تیرے آگے آگے ہیں کِس کے ہیں ؟",
                    },
                    {
                        "verse_num": 18,
                        "text": "تُو کہنا کہ یہ تیرے خادِم یعؔقوب کے ہیں ۔ یہ نذرانہ ہے جو میرے خُداوند عیؔسو کے لِئے بھیجا گیا ہے اور وہ خُود بھی ہمارے پیچھے پیچھے آرہا ہے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اُس نے دُوسرے اور تیسرے کو اور غولوں کے سب رکھوالوں کو ھُکم دیا کہ جب عؔیسو تمکو مِلے تو تُم یہٰ بات کہنا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یہ بھی کہنا کہ تیرکادم پیچھے پیچھے آرہا ہے ۔ اُس نے یہ سوچا کہ مِیں اِس نذرانہ سے جو مُجھ سے پہلے وہاں جائیگا اُسے راضی کر لُوں ۔ تب اُسک امُنہ دیکھُونگا۔ شاید یُوں وہ مُجھکو قُبول کرے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "چنانچہ وہ نذرانہ اُسکے آگے آگے پار گیا پر وُہ خُود اُس رات اپنے ڈیرے میں رہا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور وہ اُسی رات اُٹھا اور اپنی دونوں بیویوں دونوں لَونڈیوں اور گیارہ بیٹیوں کو لیکر اُنکو یبوؔق کے گھاٹ سے پار اُتارا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُنکو لیکر ندی پار کرایا اور اپنا سب کُچھ پار بھیج دِیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور یعؔقوب اکیلا رہ گیا اور پَوپھٹنے کے وقت تک ایک شخص وہاں اُس سے کُشتی لڑتا رہا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اُس نے دیکھا کہ وہ اُس پر غالِب نہیں ہوتا تو اپسکی ران کو اندر کی طرف چُھوٗا اور یعؔقوب کی ران کی نس اُسکے ساتھ کُشتی کرنے پر چڑھی گئی۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور اُس نے کہا مُجھے جانے دے کیونکہ پَوپھٹ چلی ۔ یعؔقوب نے کہا کہ جب تک تُو مُجھے برکت نہ دے مِیں تجھے جانے نہیں دونگا۔ ",
                    },
                    {
                        "verse_num": 27,
                        "text": "تب اُس نے اُس سے پوچھا کہ تیرا کیا نام ہے؟ اُس نے جواب دِیا یعقؔوب ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اُس نے کہا کہ تیرا نام آگے کو یعؔقوب نہیں بلکہ اِسرؔائیل ہوگا کیونکہ تُو نے خُدا اور آدمیوں کے ساتھ زور آزمائی کی اور غالِب ہُوا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "تب یعقؔوب نے اُس سے کہا کہ میں تیری مِنت کرتا ہوُں تُو مُجھے اپنا نام بتا دے ۔ اُس نے کہا کہ تو میرا نام کیوں پُوچھتا ہے؟ اور اُس نے اُسے وہاں برکت دی۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور یعؔقوب نے اُس جگہ کا نام فؔنی ایل رکّھا اور کہا کہ مٰیں نے خُدا کو روبرو دیکھا تو بھی میری جان بچی رہی۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور جب وہ فنیؔ ایل سے گُذر رہا تھا تو آفتاب طُلوع ہوُا اور وہ اپنی ران سے لنگڑاتا تھا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اِسی سبب سے بنی اِسراؔئیل اُس نس کو جو ران میں اندر کی طرف ہے آج تک نہیں کھاتے کیونکہ اپس شخص نے یعؔقوب کی ران کی نس کو جو اندر کی طرف سے چڑھ گئی تھی چھُو دیا تھا۔ ",
                    },
                    
                ],
            },
            {
                "chap_num": 33,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یعقؔوب نے اپنی آنکھیں اُٹھا کر نظر کی اور کیا عیکھتا ہے کہ عؔیسو چار سَو آدمی ساتھ لِئے چلا آرہا ہے ۔ تب اُس نے لَؔیاہ اور رؔاخِل اور دونوں لَونڈیوں کو بچےّ بانٹ دِئے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور لَونڈیوں اور اُنکے بچّوں کو سب سے آگے اور لِؔیاہ اور اُسکے بچّوں کو پیچھے اور رؔاخِل اور یوُسف کو سب سے پیچھے رکّھا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور وہ خُد اُنکے آگے آگے چلا اور اپنے بھائی کے پاس پُہنچتے پہنچتے سات بار زمین تک جُھکا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور عیؔسو اُس سے مِلنے کو دَوڑا اور اپس سے بغلگیر ہُوا اور اُسے گلے لگایا اور چُوما اور وہ دونوں روئے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "پِھر اُس نے آنکھیں اُٹھائیں اور عورتوں اور بچّوں کو دیکھا اور کہا کہ یہ تیرے ساتھ کِون ہیں؟ اُس نے کہا یہ وہ بّچے ہیں جو خُدا نے تیرے خادِم کو عنایت کئِے ہیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب لونڈیاں اور اُنکے بچے نزدیک آئے اور اپنے آپ کو جُھکایا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "پھر لؔیاۃ اپنے بچوں کے ساتھ نزدیک آئی اور وہ جُھکے۔ آخر کو یُوسؔف اور رؔاخِل پاس آئے اور اُنہوں نے اپنے آپ کو جُھکایا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پھر اُس نے کہا کہ اُس بڑے غول سے جو مُجھے مِلا تیرا کیا مطلب ہے؟ اُس نے کہا یہ کہ مَیں اپنے خُداوند کی نظر میں مقبول ٹھہُروں۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تب عؔیسو نے کہا میرے پاس بہت ہے ۔ سو اَے میرے بھائی جو تیرا ہے وہ تیرا ہی رہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "یعؔقوب نے کہا نہیں اگر مُجھ پر تیرے کرم کی نظر ہُوئی ہے تو میرا نذرانہ میرے ہاتھ سے قُبول کر کیونکہ میں نے تیرا مُنہ اَیسا دیکھا جَیسا کو ؑی خُدا کا مُنہ دیکھتا ہے اور تُو مُجھ سے راضی ہوا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "سو میرا نذرانہ جو تیرے حضور پیش ہُوا قُبول کر لے کیونکہ خُدا نے مُجھ پر بڑا فضل کیا ہے اور میرے پاس سب کُچھ ہے۔ غرض اُس نے اُسے مجُبور کیا تب اُس نے اُسے لے لیا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اُس نے کہا کہ اب ہم کُوچ کریں اور چل پڑیں اور مِیں تیرے آگے آگے ہولونگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اُس نے اُسے جواب دیا میرا خُداوند جانتا ہے کہ میرے ساتھ نازک بچے اور دُودھ پلانے والی بھیڑ بکریان اور گائیں ہیں ۔ اگر اُنکو ایک دِن بھی حد سے زیداہ ہنکائیں تو سب بھیڑ بکریاں مر جائینگی ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "سو میرا خُداوند اپنے خادِم سے پیشتر روانہ ہو جائے اور مَیں چَوپایوں اور بچوں کی رفات کے مُطابق آہستہ آہستہ چلتا ہُوا اپنے خُداوند کے پاس شؔعیر میں آجاؤنگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب عؔیسو نے کہا کہ مرضی ہو تو مَیں جو لوگ میرے ہمراہ ہیں اُن میں سے تھوڑے تیرے ساتھ چھوڑتا جاؤں۔ اُس نے کہا اِسکی کیا ضرورت ہے ؟ میرے خُداوند کی نظر کرم میرے لئے کافی ہے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تب عؔیسو اُسی روز اُلٹے پاؤں شؔعیر کو لَوٹا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور یعقؔوب سفر کرتا ہوا اُسکؔات میں آیا اور اپنے لئےِ ایک گھر بنایا اور اپنے چوُپایوں کے لئِے جھونپڑے کھڑے کئِے ۔ اِسی سبب سے اِس جگہ کا نام سُکؔاّت پڑگیا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور یعؔقوب جب فؔدّان ارام سے چلا تو مُلکِ کنؔعان کے ایک شہر سِکم کے نزدیک صحیح و سلامت پہنچا اور اُس شہر کے سامنے اپنے ڈیرے لگائے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور زمین کے جِس قطعہ پر اُس نے اپنا خَیمہ کھڑا کیا تھا اُسے اُس نے سِکمؔ کے باپ حؔمور کے لڑکوں سے چاندی کے سَو سِکّے دیکر خرید لیا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اُس نے وہاں ایک مذبح بنایا اور اُسکا نام اؔیل اَلہِ اسرائیل رکّھا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 34,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "لیؔاہ کی بیٹی دؔینہ جو یعؔقوب سے اُسکے پیدا ہوئی تھی۔ اُس ملک کی لڑکیوں کے دیکھنے کو باہر گئی۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تب اُس ملک کے امیر حوی حؔمور کے بیٹے سِکمؔ نے اُسے دیکھا اور اُسے لے جا کر اُسکے ساتھ مباشرت کی اور اُسے ذلیل کیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُسکا دِل یعؔقوب کی بیتی دِینہؔ سے لگ گیا اور اُس نے اُس لڑکی سے عِشق میں میٹھی میٹھی باتیں کیں",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور سِؔکم نے اپنے باپ حمؔور سے کہا کہ اِس لڑکی کو میرے لئِے بیاہ لا دے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور یعؔقوب کو معلوم ہؤا کہ اُس نے اُسکی بیٹی دؔینہ کو بے حُرمت کیا ہے پر اُسکے بیٹے چَوپایوں کے ساتھ جنگل میں تھے سو یعقؔوب اُنکے آنے تک چُپکا رہا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب ؔسِکم کا باپ حؔمور نِکل کر یعؔقوب سے بات چیت کرنے کو اُسکے پاس گیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور یعؔقوب کے بیتے یہ بات سُنتے ہی جنگل سے آئے ۔ یہ مرد برے رنجیدہ اور غضبناک تھے کیونکہ اُس نے جو یعؔقوب کی بیٹی سے مباشرت کی تو بنی اَسرائیل میں اَیسا مکروہ فعل کِیا جو ہرگز مُناسب نہ تھا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب حؔمور اُنسے کہنے لگا کہ میرا بیٹا ؔسِکم تمہاری بیٹی کو دِل سے چاہتا ہے ۔ اُسے اُسکے ساتھ بیاہ دو۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "ہم سمدھیانہ کولو ۔ اپنی بیٹیاں ہمکو دو اور ہماری بیٹیاں آ پ لو۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تو تُم ہمارے ساتھ بسے رہو گے اور یہ مُلک تہمارے سامنے ہے۔ اِس میں بُود و باش اور تجارت کرنا اور اپنی اپنی جایدادیں کھڑی کر لینا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور ؔسِکم نے اِس لڑکی کے باپ اور بھائیوں سے کہا کہ مُجھ پر بس تُمہارے کرم کی نظر ہو جائے پِھر جو کُچھ تُم مُجھ سے کہو گے میں دونگا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "میَں تُمہارے کہنے کے ُمطابق جِتنا مہر اور جہیز تُم مجھ سے طلب کرو دُونگا۔ لیکن لڑکی کو مُجھ سے بیا دو۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب یعقؔوب کے بیتوں نے اِس سبب سے کہ اُس نے اُنکی بہن دِینہ کو بے حُرمت کیا تھا رِیا سے ؔسکِم اور اُسکے باپ حؔمور کو جواب دیا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور کہنے لگے کہ ہم یہ نہیں کر سکتے کہ نامختُون مرد کو اپنی بہن دیں کیونکہ اِس میں ہماری بری رُسوائی ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "لیکن جَیسے ہم ہیں اگر تُم وَیسے ہی ہو جاؤ کہ تُمہارے ہر مرد کا ختنہ کر دِیا جائے تو ہم راضی ہو جائینگے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور ہم اپنی بیٹیاں تُمہیں دینگے اور تُمہاری بیٹیاں لینگے اور تُمہارے ساتھ رہینگے اور ہم سب ایک قوم ہو جائینگے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اگر تُم کتنہ کرانے کے لئِے ہماری بات نہ مانو تو ہم اپنی لڑکی لیکر چلے جائینگے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اُنکی باتیں حؔمور اور اُسکے بیٹے ؔسِکم کو پسند آئیں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اپس جوان نے اِس کام میں تاخیر نہ کی کیونکہ یعؔقوب کی بیتی کا اِشتیاق تھا اور وہ اپے باپ کے سارے گھرانے میں سب سے معُزز تھا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "پھر حؔمور اور اُسکا بیٹا ؔسِکم اپنے شہر کے پھاٹک پر گئے اور اپنے شہر کے لوگوں سے یُوں گفتگو کرنے لگے کہ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "یہ لوگ ہم سے میل جول رکھتے ہیں پس وہ ا،س ملک میں رہ کر سوداگری کریں کیونکہ اِس ملک میں اُنکے لئِے گنجایش ہے اور ہم اُنکی بیٹیاں بیاہ لیں اور اپنی بیٹیاں اُنکو دیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور وہ بھی ہمارے ساتھ رہنے اور ایک قوم بن جانے کو راضی ہیں مگر فقط اِس شرط پر کہ ہم میں سے ہر مرد کا ختنہ کِیا جائے جیسے اُنکا ہؤا ہے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "کیا اُنکے چوپائے اور مال اور سب جانور ہمارے نہ ہوجائینگے ۔ ہم فقط اُنکی مان لیں اور وہ ہمارے ساتھ رہنے لگینگے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب اُن سبھوں نے جو اُسکے شہر کے پھاٹک سے آیا جایا کرتے تھے حُمؔور اور اُسکے بیٹے ؔسِکم کی بات مانی اور جتنے اُسکے شہر کے پھاٹک سے آمد و رفت کرتے تھے اُن میں سے ہر مرد نے ختنہ کرایا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور تیسرے دِن جب وہ درد میں مُبتلا تھے تو یُوں ہؤا کہ یعؔقوب کے بیٹوں میں دِؔینہ کے دو بھائی شؔمعون اور لؔاوی اپنی اپنی تلوار لے کر نا گہان شہر پر آ پڑے اور سب مردوں کو قتل کِیا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور حؔمور اور اُسکے بیٹے ؔسِکم کو بھی تلوار سے قتل کر ڈالا اور ؔسکِم کے گھر سے دؔینہ کو نکال لے گئے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور یعؔقوب کے بیتے مقتُولوں پر آئے اور شہر کو لوُٹا اِسلئِے کہ اُنہوں نے اُنکی بہن کو بے حُرمت کیا تھا ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اُنہوں نے اُنکی بھیڑ بکریاں اور گائے بَیل اور گدھے اور جو کچُھ شہر اور کھیت میں تھالے لِیا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور اُنکی سب دَولت لوُٹی اور اُنکے بچّوں اور بیویوں کو اسیر کر لِیا اور جو کچُھ گھر میں تھا سب لوُٹ گھُسوٹ کر لیگئے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "تب یعؔقوب نے شمعؔون اور لؔاوی سے کہا کہ تُم نے مجُھے کُڑھایا کیونکہ تُم نے مجُھےاِس ُملک کے باشندوں یعنی کنعانیوں اور فرزّیوں میں نفرت انگیز بنا دِیا کیونکہ میرے ساتھ تو تھوڑے ہی آدمی ہیں ۔ سو وہ ملِ کر میرے مقابلہ کو آئینگے اور مجُھے قتل کر دینگے اور مَین اپنے گھرانے سمیت برباد ہوجاؤنگا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اُنہوں نے کہا تو کیا اُسے مناسب تھا کہ وہ ہماری بہن کے ساتھ کسی کی طرھ برتاؤ کرتا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 35,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُد ا نے یعقؔوب سے کہا کہ اُٹھ بیتؔ ایل کو جا اور وہی راہ اور وہاں خُد کے لئِے جو تجھے اُس وقت دِکھائی دیا جب تو اپنے بھائی عؔیسو کے پاس سے بھاگا جارہا تھا ایک مذبح بنا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تب یعؔقوب نے اپنے گھرانے اور اپنے سب ساتھیوں سے کہا کہ بیگانہ دیوتاؤں کو جو تُمہارے درمیان ہیں دُور کرو اور طہارت کرکے اپنے کپڑے بدل ڈالو۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور آؤ ہم روانہ ہوں اور بؔیت ایل کو جائیں ۔ وہاں میَں خُدا کے لئِے جس نے میری تنگی کے دِن میری دُعا قبُول کی اور جِس راہ میں میَں چلا میرے ساتھ رہا مذبح بناؤنگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب اُنہوں نے سب بیگانہ دیوتاؤں کو جو اُنکے پاس تھاے اور منُدروں کو جو اُنکے کانوں میں تھے یعؔقوب کو دیدیا اور یعقوب نے اُنکو اُس بلؔوط کے درخت کے نیچے جو ؔسِکم کے نزدیک تھا دبا دِیا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُنہوں نے کُوچ کِیا اور اُنکے آس پاس کے شہروں پر اَیسا بڑا خوف چھایا ہؤا تھا کہ اُنہوں نے یعؔقوب کے بیٹوں کا پیچھا نہ کیا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور یعؔقوب اُن سب لوگوں سمیت جو اُسکے ساتھ تھے لؔوُز پہنچا۔ بؔیت ایل یہی ہے اور ملکُ کنعانن میں ہے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے وہاں مزبح بنایا اور اپس مقام کا نام اؔیل بیت ایل رکھاّ کیونکہ جب وہ اپنے بھائی کے پاس سے بھاگا جا رہا تھا تو خُدا وہیں اُس پر ظاہر ہؤا تھا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور رِؔبقہ کی دایہ دؔبورہ مرگئی اور وہ ؔبیت ایل اُترائی میں بلوُؔط کے درخت کے نیچے دفن ہُوئی اور اُس بؔلوُط کا نام اؔنون بکوُت رکھا گیا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور یعؔقوب کے فؔدّان ارام سے آنے کے بعد خُدا اُسے پِھر دِکھائی دیا اور اُسے برکت بخشی ۔ اور خُدا نے اُسے کہا کہ تیرا نام یعؔقوب ہے ۔ تیرا نام آگے سے یعؔقوب نہ کہلائیگا بلکہ تیرا نام اِسرائیل ہوگا ۔ سو اپس نے اُسکا نام اِسرائیل رکھاّ ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "پھر خُدا نے اُسے کہا کہ میَں خدایِ قادرِ مُطلق ہُوں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تُو برومند ہو اور بہت ہو جا۔ تجھُ سے ایک قوم بلکہ قَوموں کے جتھے پیدا ہونگے اور بادشاہ تیرے صُلب سے نِکلینگے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور یہ ملک جو میَں نے ابؔرہام اور اِؔضحاق کو دِیا ہے سو تُجھ کو دُونگا اور تیرے بعد تیری نسال کو بھی یہی ُملک دُونگا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور خُدا جِس جگہ اُس سے ہمکلام ہؤا وہیں سے اُسکے پاس سے اُوپر چلا گیا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب یعؔقوب نے اُس جگہ جہاں وہ اُس سے ہمکلام ہؤا پتّھر کا ایک ستون کھڑا کیا اور تیل ڈالا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور یعؔقوب نے اپس مقام کا نام جہاں خُدا اُس سے ہمکلام ہؤا بؔیت ایل رکھاّ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ بؔیت ایل سے چلے اور اِفؔرات تھوڑی ہی دُور رہ گیا تھا کہ رؔاخِل کے دردِزہِ لگا اور وضع حمل میں نِہایت دِقت ہُؤئی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جب وہ سخت درد میں مبُتلا تھی تو دائی نے اُس سے کہا ڈر مت۔ اب کے بھی تیرے بیٹا ہی ہوگا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور یُوں ہُؤا کہ اُس نے مرتے مرتے اُسکا نام بِنؤُُؔنی رکھا اور مر گئی پر اُسکے باپ نے اُسکا نام بِنیمین رکھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور رؔاخِل مر گئی اور اِفؔرات یعنی بؔیت الحم کے راستہ میں دفن ہُؤئی ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یعؔقوب نے اُسکی قبر پر ایک سُتون کھڑا کر دیا۔ رؔاخِل کی قبر کا یہ ستُون آج تک موُجوُد ہے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اِؔسرائیل آگے بڑھا اور عؔدر کے بُرج کی پرلی طرف اپنا ڈیرا لگایا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور اِؔسرائیل کے اُس ملک میں رہتے ہؤئے یُوں ہؤا کہ رُوؔبن نے جا کر اپنے باپ کی حرم بِلؔہاہ سے مباشرت کی اور اِؔسرائیل کو یہ معلوم ہو گیا۔ اُس وقت یعقؔوب کے بارہ بیٹے تھے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "لؔیاہ کے بیٹ یہ تھے ۔ رُوؔبن یعؔقوب کا پہلوٹھا اور شمؔعون اور لؔاوی اور یؔہوُداہ اور اؔشکار اور زؔبوُلوُن ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور رؔاخِل کے بیٹے یؔوُسف اور بِنیمین تھے۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور رؔاخِل کی لوَنڈی بلؔہاہ کے بیتے دؔان اور نفؔتالی تھے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور لؔیاہ کی لوَنڈی زِؔلفہ کے بیتے جؔد اور آؔشر تھے ۔ یہ سب یعؔقوب کے بیٹے ہیں جو فؔدّان ارام میں پیدا ہؤئے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور یؔعقوب ممؔرے میں جو قؔریت اربع یعنی حؔبرُون ہے جہاںن ابؔرہام اور اِؔضحاق نے ڈیرا کیا تھا اپنے باپ اِؔضحاق کے پاس آیا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور اِؔضحاق ایک سَو اسّی برس کا ہؤا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "تب اِؔضحاق نے دم چھوڑ دیا اور وفات پائی اور بُوڑھا اور پُوری عُمر کا ہو کر اپنے لوگوں میں جا مِلا اور اُسکے بیٹوں عؔیسو اور یعقؔوب نے اُسے دفن کیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 36,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور عؔیسو یعنی اؔدوم کا نسب نامہ یہ ہے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "عؔیسو کنعانی لڑکیوں میں سے حِتی اُؔیلون کی بیٹی عدّؔہ کو اور حو صؔبعون کی نواسی اور عؔنہ کی بیٹی اُہؔلیبامہ و۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اسؔمعٰیل کی بیٹی اور نؔبایوت کی بہن بؔشامہ کو بیاہ لایا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور عؔیسو سے عؔدّہ کے اِلیؔفز پیدا ہُؤا اور بؔشامہ کے رؔعوایل پیدا ہؤا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُبِلؔیبامہ کے یعؔوس اور یؔعلام اور قؔورح پیدا ہُؤئے ۔ یہ عؔیسو کے بیٹے ہیں جو ملک کنعان میں پیدا ہُؤئے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور عؔیسو اپنی بیویوں اور بیٹے بیٹیوں اور اپنے گھر کے سب نوکر چاکروں اور اپنے چَوپایوں اور تمام جانوروں اور اپنے سب مال اسباب کو جو اُس نے ملکِ کنعان میں جمع کیا تھا لیکر اپنے بھائی یعؔقوب کے پاس سے ایک دُوسرے ملک چلا گیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "کیونکہ اُنکے پاس اِس قدر سامان ہو گیا تھا کہ وہ ایک جگہ رہ نہیں سکتے تھے اور اُنکے چَوپایوں کی کثرت کے سبب سے اپس زمین میں جہاں اپنکا قیام تھا گنُجایش نہ تھی۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پس عؔیسو جسے اؔدوم بھی کہتے ہیں کوہِ شؔعیر میں رہنے لگا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور عؔیسو جو کوہِ شعؔیر کے ادومیوں کا باپ ہے یہ جسب نامہ ہے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "عؔیسو کے بیٹوں کے نام یہ ہیں ۔ اِلیؔفز عیؔسو کی بیوی عدّہ کا بیٹا اور رؔعوایل عؔیسو کی بیو ی بؔشامہ کا بیٹا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اِلیؔفز کے بیٹے تیماؔن اور اؔوقمر اور صؔفور اور جعتاؔم اور قؔنز تھے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور تِمنؔع صؔیو کے بیٹے اِؔلیفز کی حرم تھی اور اِلیؔفز اور جعؔتام اور قؔنز تھے۔ تمنع عؔیسو کے بیٹے اِلیؔفز کی حرم تھی اور اِلؔیفز سے اُسکے عماؔلیق پیدا ہؤا ۔ سو عؔیسو کی بیوی عؔدّہ کے بیٹے یہ تھے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "رؔعوایل کے بیٹے یہ ہیں۔ نؔحتِ اور زؔارح اور سؔمہّ اور مِزّہ ۔ یہ عؔیسو کی بیوی بشؔامہ کے بیٹے تھے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اُہلیبامہ کے بیٹے جو عؔنہ کی بیٹی صؔبعون کی نواسی اور عؔیسو کی بیوی تھی یہ ہیں ۔ عؔیسو سے اُسکے یعؔوس اور یؔعلام اور قؔورح پیدا ہوئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور عؔیسو کی اَولاد میں جو رئیس تھے سو یہ ہیں ۔ عؔیسو کے پہلوٹھے بیٹے اؔلیفز کی اَولاد میں رئیس تؔیمان رئیس اؔومر رئیس صؔفور رئیس قؔنز ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "رئیس قؔورح رئیس جعؔتام رئیس عؔمالیق ۔ یہ وہ رئیس ہیں جو اؔلیفز سے مُلک ادؔوم میں پیدا ہوئے اور وعدہ کے فرزند تھے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور رؔعوایل بن عؔیسو کے بیٹے یہ ہیں رئیس نؔحت رئیس زاؔح رئیس سؔمہ رئیس مِؔزہّ۔ یہ وہ رئیس ہیں جو عؔیسوکی بیوی بشؔامہ کے فرزند تھے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور عؔیسو کی بیوی اُہلِیؔبا کی اَولاد یہ ہیں رئیس کی بیوی اُسامہ بِنت عؔنہ کے فرزند تھے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "سو عؔیسو یعنی اؔدوم کی اَولاد اور اُنکے رئیس یہ ہیں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور شؔعیر حوری کے بیٹے جو اُس مُلک کے باشِندے تھے یہ ہیں ۔ لوؔطان اور سؔوبل اور صبعوؔن اور عؔنہ ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور دِؔیسون اور ایصؔر اور دِیسان۔ بنی شؔعیر میں سے جو حوری رئیس مُلک ادؔوم میں ہُؤئے یہ ہیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "حؔوری اور ہیمام لؔوطان کے بیٹے اور تِمنؔع لوؔطان کی بہن تھی ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور یہ سَوبل کے بیٹے ہیں ۔ عؔلوان اور مؔانحت اور عیباؔل اور سؔفو اور اوؔنام۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور صؔبعون کے بیٹے یہ ہیں ۔ آؔیہ اور عؔنہ ۔ یہ وہ عؔنہ ہے جِسے اپنے باپ کے گدھوں کو بیابان میں چراتے وقت گرم چشمے مِلے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور عؔنہ کی اَولاد یہ ہے دِیسوؔن اور اُہلِیبامہ بِنت عؔنہ ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور دِیؔسون کے بیٹے یہ ہیں حمؔدان اور اؔشبان اور یترؔان اور کرؔان ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "یہ ایؔصر کے بیٹے ہیں بلؔہان اور زؔعوان اور عقؔان ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "دِؔیسان کے بیٹے یہ ہیں۔ عُوض اور اِراؔن ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "جو حوریوں میں سے رئیس ہؤئے وہ یہ ہیں ۔ رئیس لؔوطان رئیس ہُؤئے وہ یہ ہیں ۔ رئیس لؔوطان رئیس سوؔبل رئیس صبعؔون رئیس عؔنہ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "رئیس لؔوطان رئیس ایؔصر رئیس دِیسان ۔ یہ اُن حوریوں کے رئیس ہیں جو مُلکِ شؔعیر میں تھے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "یہی وہ بادشاہ ہیں جو مُلکِ ادوؔم پر پیشتر اُس سے کہ اِؔسرائیل کا کوئی بادشاہ ہو مُسلط تھے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "باؔلع بِن بعؔور ادؔوم میں ایک بادشاہ تھا اور اُسکے شہر کا نام دِنہابا تھا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "باؔلع مرگا اور یؔوباب بِن زؔادح جو بُصراہی تھا اُسکی جگہ بادشاہ ہُوا ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "پھر یُوباؔب مر گیا اور حُشیم جو تیمانیوں کے مُلک کا باشندہ تھا اُسکا جانشین ہُوا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور حُشیم مر گا اور ہدؔدین بدؔد جِس نے مؔوآب کے میدان میں مِدیانیوں کو مارا اُسکا جانشین ہُؤا اور اُسکے شہر کا نام عِؔویت تھا۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور ہؔدد مرگیا اور شملہ جو مُسؔرقہ کا تھا اُسکا جانشین ہُؤا ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور شؔملہ مر گیا اور سؔاؤل اُسکا جانشین ہُؤا ۔ یہ رحؔوبت کا تھا جو دریایِ فُراتؔ کے برابر ہے۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور سؔاؤل مر گیا اور بؔعلحنان بن عکبوؔر اُسکا جانشین ہُؤا ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "اور بؔعلحنان بن عکبؔور مرگیا اور حؔدر اُسکا جانشین ہُؤا اور اُسکے شہر کا نام پؔؤ اور اُسکی بیوی کا نام مہیؔطب ایل تھا جو مؔطِرد کی بیٹی اور میؔضاہاب کی نواسی تھی۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "پس عؔیسو کے رئیسوں کے نام اُنکے خاندانوں اور مقاموں اور ناموں کے موافِق یہ ہیں ۔ رئیس تِمنعؔ رئیس مؔتیت ۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "رئیس اُہلِؔیبامہ رئیس اَیلؔہ رئیس فِؔینون ۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "رئیس قؔنز رئیس تؔیمان ڑئیس مِبؔصار۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "رئیس مؔجد ایل ۔ رئیس عِؔرام ۔ اؔدوم کے رئیس یہی ہیں جِن کے نام اُنکے مقبوضہ مُلک میں اُنکے مسکن کے مطابق دِئے گئے ہیں ۔ یہ حال ادومیوں کے باپ عیؔسو کا ہے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 37,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یؔعقوب مُلکِ کنعان میں رہتا تھا جہاں اُسکا باپ مُسافر کی طرح رہا تھا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "یعؔقوب کی نسل کا حال یہ ہے کہ یُوسؔف سترہ برس کی عُمر میں اپنے بھائیوں کے ساتھ بھیڑ بکریاں چرایا کرتا تھا۔ یہ لڑکا اپنے باپ کی بیویون بِلؔہاہ اور زِؔلفہ کے بیٹوں کے ساتھ رہتا تھا ۔ اور وہ اُنکے بُرے کاموں کی خبر باپ تک پہنچادیتا تھا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اَؔسرائیل یُوسؔف کو اپنے سب بیٹوں سے زیادہ پیار کرتا تھا کیونکہ وہ اُسکے بُڑھاپے کا بیٹا تھا اور اُس نے اُسے ای بُو قلمُون قبا بھی بنوادی۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اوراُسکے بھائیوں نے دیکھا کہ اُنکا باپ اُسکے سب بھائیوں سے زیادہ اُسی کو پیار کرتا ہے۔ سو وہ اُس سے بُغض رکھنے لگے اور ٹھِیک طور پر بات بھی نہیں کرتے تھے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور یُوسؔف نے ایک خواب دیکھا جِسے اُس نے اپنے بھائیوں کو بتایا تو وہ اُس سے اَور بھی بُغص رکھنے لگے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اُس نے اُن سے کہا ذرا وہ خواب تو سُنو جو مَیں جو مَیں نے دیکھا ہے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "ہم کھیت میں پُولے باندھتے تھے اور کیا دیکھتا ہوُں کہ میرا پُولا اُٹھا اور سیدھا کھڑا ہوگیا اور تُمہارے پُولوں نے میرے پُولے کو چاروں طرف سے گھیر لیااور اُسے سِجدہ کیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب اُسکے بھائیوں نے اُ س سے کہا کہ کیا تُو سچ مچ ہم پر سلطنت کریگا ۔ ہم پر تیرا تسُلط ہوگا؟ اور اُنہوں نے اُسکے خوابوں اور اُسکی باتوں کے سبب سے اُس سے اَور بھی زیادہ بغص رکھا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "پِھر اُس نے کہا دیکھو مُجھے ایک اَور خواب دیکھائی دیا ہے کہ سوُرج اور چاند اور گیارہ ستاروں نے مُجھے سِجدہ کیا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس نے اِسے اپنے باپ اور بھائیوں دونوں کو بتایا۔ تب اُسکے باپ نے اُسے ڈانٹا اور کہا کہ یہ خواب کیا ہے جو تُو نے دیکھا ہے ؟ کیِا مَیں اور تیری ماں اور تیرے بھائی سچ مُچ تیرے آگے زمین پر جُھک کر تُجھے سِجدہ کرینگے ؟",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُسکے بھائیوں کو اُس سے حسد ہوگیا لیکن اُسکے باپ نے یہ بات یاد رکھّی ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اُسکے بھائی اپنے باپ کی بھیڑ بکریاں چُرانے سِؔکم کو گئے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب اِسرؔائیل نے یُوسؔف سے کہا تیرے بھائی سِؔکم میں بھیڑ بکریوں کو چرا رہے ہونگے۔ سوآکہ مَیں تجھےُ اُنکے پاس بھیجوں ۔ اُس نے اُسے کہا مَیں تیار ہُوں۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب اُس نے کہا تُو جا کر دیکھ کہ تیرے بھائیوں کا اور بھیڑ بکریوں کا کیا حال ہے اور آکر مجھُے خبر دے۔ سو اُس نے اُسے حؔبرون کی وادی سے بھیجا اور وہ سِؔکم میں آیا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور ایک شخص نے اُسے میدان میں اِدھر اُدھر آوارہ پِھرتے پایا۔ یہ دیکھ کر اُس شخص نے اُس سے پوُچھا کہ تُو کیا ڈھونڈتا ہے۔ ؟",
                    },
                    {
                        "verse_num": 16,
                        "text": "اُس نے کہا مَیں اپنے بھائیوں کو ڈھُونڈتا ہُوں ذرا مُجھے بتا دے کہ وہ بھیڑ بکریوں کو کہاں چرارہے ہیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُس شخص نے کہا وہ یہاں سے چلے گئے کیونکہ مَیں نے اُنکو یہ کہتے سُنا کہ چلو ہم دُو ؔتین کو جائیں۔ چنانچہ یُوسؔف اپنے بھائیون کی تلاش میں چلا اور اُنکو دُوتؔین میں پایا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جُوں ہی اُنہوں نے اُسے دوُر سے دیکھا تو پیشتر اِس سے کہ وہ نزدیک پہنچے اُسکے قتل کا منصوبہ باندھا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور آپس میں کہنے لگے دیکھو خوابوں کا دیکھنے والا آرہا ہے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "آؤ اب ہم اُسے مار ڈالیں اور کسی گڑھے میں ڈال دیں اور یہ کہدینگے کہ کوئی بُرا درِندہ اُسے کھا گیا۔ پھر دیکھینگے کہ اُسکے خوابوں کا انجام کیا ہوتا ہے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تب رُوؔبن نے یہ سُن کر اُسے اُنکے ہاتھوں سے بچایا اور کہا ہم اُسکی جان نہ لیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور رُوؔبن نے اُن سے یہ بھی کہا کہ خُون نہ بہاؤ بلکہ اُسے اِس گڑھے میں جو بیابان میں ہے ڈالدو لیکن اُس پر ہاتھ نہ اُٹھاؤ۔ وہ چاہتا تھا کہ اُسے اُنکے ہاتھ سے بچا کر اُسکےباپ کے پاس سلامت پہنچا دے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور یُوں ہُوا کہ جب یُوسؔف اپنے بھائیوں کے پاس پہنچا تو اُنہوں نے اُسکی بُو قلُمون قبا کو جو وہ پہنے تھا اُتار لِیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُسے ُٓٹھا کر گڑھے میں ڈالدِیا ۔ وہ گڑھا سُوکھا تھا ۔ اُس میں ذرا بھی پانی نہ تھا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور وہ کھانا کھانے بَیٹھے اور آنکھ اُٹھائی تو دیکھا کہ اِسمعٰیلیوں کا ایک قافلہ جؔلعاد سے آرہا ہے اور گرم مصالح اور روغن بلسان اور مُّ اُونٹوں پر لادے ہُوئے مؔصر کو لئِے جا رہا ہے۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تب یُہوؔداہ نے اپنے بھائیوں سے کہا کہ اگر ہم اپنے بھائی کو مار ڈالیں اور اُسکا کون چھپائیں تو کیا نفع ہو گا؟",
                    },
                    {
                        "verse_num": 27,
                        "text": "آؤ اُسے اِسمٰعیلیوں کے ہاتھ بیچ ڈالیں کہ ہمارا ہاتھ اُس پر نہ اُٹھے کیونکہ وہ ہمارا بھائی اور ہمار خُون ہے ۔ اُس کے بھائیوں نے اُسکی بات مان لی۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "پِھر وہ مِدیانی سَوداگر اُدھر سے گذرے ۔ تب اُنہوں نے یوُسؔف کو کھینچ کر گڑھے سے باہر نکالا اور اُسے اِسمٰعیلیوں کے ہاتھ بیس روپے کو بیچ ڈالا اور وہ یُوسؔف مصر میں لے گئے۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "جب رُوبن گڑھے پر لَوٹ کر آیا اور دیکھا کہ یوُسؔف اُس میں نہیں ہے تو اپنا پیراہن چاک کیِا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور بھائیوں کے پاس اُلٹا پھرا اور کہنے لگا کہ لڑکا تو وہاں نہیں ہے ۔ اب میں کہاں جاؤں؟",
                    },
                    {
                        "verse_num": 31,
                        "text": "پھِر اُنہوں نے یُوسفؔ کی قبا لیکر اور ایک بکرا ذبح کر کے اُسے اُسکے خُون سے تر کیا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اُنہوں نے اُس بُوقلمُون قبا کو بھیجوا دیا ۔ سو وہ اُسے اُنکے باپ کے پاس لے آئے اور کہا کہ ہم کو یہ چیز پڑی ملی۔ اب تُو پہنچان کہ یہ تیرے بیتے کی قبا ہے یا نہیں ؟",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور اُنہوں نے اُسے پہنچان لیا اور کہا کہ یہ تو میرے بیٹے کی قبا ہے ۔ کوئی بُرا درِندہ اُسے کھا گیا ہے ۔ یُوسؔف بیشک پھاڑا گیا ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "تب یعؔقوب نے اپنا پیراہن چاک کیا اور ٹاٹ اپنی کمر سے لپیٹا اور بہت دِنوں تک اپنے بیتے کے لئِے ماتم کرتا رہا۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اُسکے سب بیٹے بیٹیاں اپسے تسلّی دینے جانتے تھے پر اُسے تسلّی نہ ہوتی تھی۔ وہ یہی کہتا رہا کہ مَیں تو ماتم ہی کرتا ہُوا قبر میں اپنے بیٹے سے جامِلونگا ۔ سو اُسکا باپ اُسکے لئِے روتا رہا۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور مِدیانیوں نے اُسے مصؔر میں فؔوطِیفار کے ہاتھ جو فؔرعون کا ایک حاکم اور جلوداروں کا سردار تھا بیچا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 38,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اُنہی دِنوں میں اَیسا ہُوا کہ یہؔوداہ اپنے بھائیوں سے جُدا ہو کر ایک عؔدلاّمی آدمی کے پاس جِسکا نام حِیرؔہ تھا گیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور یُہودؔاہ نے وہاں سُنوؔع نام کِسی کنعانی کی بیٹی کو دیکھا اور اُس سے بیاہ کرکے اُسکے پاس گیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "وہ حامِلہ ہوئی اور اُسکے ایک بیٹا ہُوا جِسکا نام اُس نے عؔیر رکھا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور پِھر حاملہ ہُوئی اور ایک بیٹا ہُؤا اُسکا نام اوؔنان رکھاّ ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "پھر اُسکے ایک اَور بیٹا ہُوا اور اُسکا نام سؔیلہ رکّھا اور یُہوؔداہ کؔزیب میں تھا جب اِس عورت کے یہ لڑکا ہؤا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور یؔہوداہ اپنے پہلوٹھے بیٹے عیر کے لئے ایک عورت بیاہ لایا جسکا نام تؔمر تھا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور یُہودؔاہ کا پہلوٹھا بیٹا عؔیر خُداوند کی نِگاہ میں شریر تھا ۔ سو خُداوند نے اُسے ہلاک کر دیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب یؔہوداہ نے اونانؔ سے کہا کہ اپنے بھائی کی بیوی کے پاس جا اور دیور کا حق ادا کر تاکہ تیرے بھائی کے نام سے نسل چلے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اوؔنان جانتا تھا کہ یہ نسل میری نہ کہلائیگی ۔ سو یُوں ہُوا کہ جب وہ اپنے بھائی کی بیوی کے پاس جاتا تو نطُفہ کو زمین پر گرا دیتا تھا کہ مبادا اُسکے بھا ئی کے نام سے نسل چلے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُسکا یہ کام خُداوند کی نظر میں بہت بُرا تھا اِسلئے اُس نے اُسے بھی ہلاک کیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب یہُؔوداہ نے اپنی بہُو تمؔر سے کہ کہ میرے بیٹے سؔیلہ کے بالغ ہونے تک تُو اپنے باپ کے گھر بیوہ بَیٹھی رہ کیونکہ اُس نے سوچا کہ کہیں یہ بھی اپنے بھائیوں کی طرح ہلاک نہ ہو جائے سو تؔمر اپنے باپ کے گھر میں جا کر رہنے لگی ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور ایک عرصہ کے بعد اَیسا ہوا کہ سُؔوع کی بیٹی جو یُہوؔداہ کی بیوی تھھی مر گئی اور جب ُیہؔوداہ کو اُسکا غم بُھولا تو وہ اپنے عدُلاّمی دوست حِیرؔہ کے ساتھ اپنی بھیڑوں کی پشم کے کترنے والوں کے پاس تمِنت کو گیا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور تؔمر کو یہ خبر مِلی کہ تیرا خُسر اپنی بھیڑوں کی پشم کترنے کے لئے تمِؔنت کو جا رہا ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب اُس نے اپنے رنڈا پے کے کپڑوں کو اُتار پھینکا اور بُرقع اوٹھا اور اپنے کو ڈھانگا اور عیؔنیم کے پھاٹک کے برابر جو تمِنؔت کی رہ پر ہے جا بیَٹھی کیونکہ اُس نے دیکھا کہ سؔیلہ بالغ ہو گیا مگر یہ اُس سے بیاہی نہیں گئی ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "یُہوداؔہ اُسے دیکھ کر سمجھا کہ کوئی کسبی ہے کیونکہ اُس نے اپنا مُنہ ڈھانک رکّھا تھا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "سو وہ راستہ سے اُسکی طرف کو پِھرا اور اُس سے کہنے لگا کہ ذرا مُجھے اپنے ساتھ مباشرت کر لینے دے کیونکہ اِسے بالکل نہیں معلوم تھا کہ وہ اِسکی بہُو ہے۔ اُس نے کہا تو مجھے کیا دیگا تا کہ میرے ساتھ مُباشرت کرے؟",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُس نے کہا مَیں ریوڑ میں سے بکری کا ایک بچہّ تُجھے بھیجدونگا۔ اُس نے کہا اُس کہ اُسکے بھیجنے تک تُو میرے پاس کچھ رہن کر دیگا؟",
                    },
                    {
                        "verse_num": 18,
                        "text": "اُس نے کہا تُجھے رہن کیا دوں ؟ اُس نے کہا اپنی مُہر اور اپنا بازو بند اور اپنی لاٹھی جو تیرے ہاتھ میں ہے۔ اُس نے یہ چیزیں اُسے دِیں اور اُس کے ساتھ مُباشرت کی اور وہ اُس سے حامِلہ ہوگئی۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "پِھر وہ اُٹھ کر چلی گئی اور بُرقع اُتار کر رنڈاپے کا جوڑا پہن لیا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یُہوؔدا ہ نے اپنے عُدلاّمی دوست کے ہاتھ بکری کا بچّہ بھیجا تا کہ اُس عورت کے پاس سے اپنا رہن واپس منگائے پر وہ عورت اُسے نہ مِلی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تب اُس نے اُس جگہ کے لوگو سے پوچھا کہ وہ کسبی جو عینؔیم میں راستہ کے برابر بَیٹھی تھی کہاں ہے ؟ اُنہوں نے کہا یہاں کوئی کسبی نہ تھی۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب اُس نے یہوؔداہ نے کہا خَیر ! اُس رہن کو وہی رکھے ہم تو بدنام نہ ہوں ۔ میَں نے تو بکری کا بچّہ بھیجا پر وہ تجھے نہیں مِلی۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "",
                    },
                    {
                        "verse_num": 25,
                        "text": "جب اُسے باہر نِکالا تو اُس نے اپنے خُسر کو کہلا بھیجا کہ میرے اُسی شخص کا حمل ہے جِسکی یہ چیزیں ہیں ۔ سو تُو پہچان تو سہی کہ یہ مہراور بازو بند اور لاٹھی کس کی ہے؟",
                    },
                    {
                        "verse_num": 26,
                        "text": "تب یہوؔداہ نے اِقرار کیا اور کہا کہ وہ مُجھ سے زیادہ صادِق ہے کیونکہ میَں نے اُسے اپنے بیٹے سیلؔہ سے نہیں بیاہا اور وہ پھر کبھی اُسکے پاس نہ گیا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اُسکے وضعِ حمل کے وقت معلوم ہُؤا کہ اُسکے پیٹ میں تَواٗؔم ہیں ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور جب وہ جننے لگی تو ایک بچّے کا ہاتھ باہر آیا اور دائی نے پکڑ کر اُسکے ہاتھ میں لال ڈورا باندھ دِیا اور کہنے لگی کہ یہ پہلے پیدا ہؤا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور یُوں ہؤا کہ اُس نے اپنا ہاتھ پھر کینچ لیا ۔ اِتنے میں اُسکا بھائی پَیدا ہو گیا۔ تب وہ دائی بول اُٹھی کہ کیسے زبردستی نِکل پڑا؟ سو اُسکا نام فاؔرص رکھاّ گیا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "پھر اُسکا بائی جِسکے ہاتھ میں لال ڈورابندھا تھا پیدا ہؤا اور اُسکا نام زاؔرح رکھاّ گیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 39,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یوسف کو مصؔر میں لائ٫ے اور فُوطیفار مصری نے ج فرؔعون کا یاک حاکم اور جلوداروں کا سردار تھا اُسکو اِسمٰعیلیوں کے ہاتھ سے جو اُسے وہاں لے گئے تھے خرید لیا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور خُداوند یوُسفؔ کے ساتھ تھا اور وہ اِقبالمند ہُوا اور اپنے مصری آقا کے گھر میں رہتا تھا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُسکے آقا نے دیکھا کہ خُداوند اُسکے ساتھ ہے اور جس کام کو وہ ہاتھ لگاتا ہے خُداوند اُس میں اُسے اقبالمند کرتا ہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "چنانچہ یوُسؔف اُسکی نظر میں مقبُول ٹھہرا اور وہی اُسکی خِدمت کرتا تھا اور اُس نے اُسے اپنے گھر کا مختار بنا کر اپنا سب کچھ اُسے سَونپ دِیا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور جب اُس نے اُسے گھر کا اور سارے مال کا مُختار بنایا تو خُداوند نے اُس مصری کے گھر میں یُوؔسف کی خاطر برکت بخشی اور اُسکی سب چیزوں پر جو گھر میں اور کھیت میں تھیں خُداوند کی برکت ہونے لگی۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اُس نے اپنا سب کچھ یوُؔسف کے ہاتھ میں چھوڑ دیا اور سِوا روٹی کے جِسے وہ کھا لیتا تھا اُسے اپنی کِسی چیز کا ہوش نہ تھا اور یُوؔسف خوبصورت اور حِسین تھا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اِن باتوں کے بعد یُوں ہؤا کہ اُسکے آقا کی بیوی کی آنکھ یُوؔسف پر لگی اور اُس نے اُس سے کہا کہ میرے ساتھ ہم بِستر ہو۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "لیکن اُس نے اِنکار کیا اور اپنے آقا کی بیوی سے کہا کہ دیکھ میرے آقا کو خبر بھھی نہیں کہ اِس گھر میں میرے پاس کیا کیا ہے اور اُس نے اپنا سب کچھ میرے ہاتھ میں چھوڑ دیا ہے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اِس گھر میں مجھ سے بڑا کوئی نہیں اور اُس نے تیرے سِوا کوئی چِیز مُجھ سے باز نہیں رکھیّ کیونکہ تو اُسکی بیوی ہے سو بھلا میَں کیوں اَیسی بری بدی کُروں اور خُدا کا گُنہگار بنُوں؟",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور وہ چند روز یُوؔسف کے سر ہوتی رہی پر اُس نے اُسکی بات نہ مانی کہ اُس سے ہم بستر ہونے کے لئِے اُسکے ساتھ لیٹے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور ایک دِن یوُں ہوا کہ وہ اپنا کام کرنے کے لئے گھر میں گیا اور گھر کے آدمیوں میں سے کوئی بھی اندر نہ تھا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب اُس عورت نے اُسکا پیراہن پکڑ کر کہا کہ میرے ساتھ ہم بِستر ہو۔ وہ اپنا پیراہن اُسکے ہاتھ میں چھوڑ کر بھاگ گیا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "",
                    },
                    {
                        "verse_num": 14,
                        "text": "تو اُس نے اپنے گھر کے آدمیوں کو بُلا کر اُن سے کہا کہ دیکھو وہ ایک عبِری کو ہم سے مذاق کرنے کے لئِے ہمارے پاس لے آیا ہے۔ یہ مُجھ سے ہم بستر ہونے کو اندر گُھس آیا اور مِیں بلند آواز سے چِلاّنے لگی ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "جب اُس نے دیکھا کہ میَں زور زور سے چِلاّ رہی ہُوں تو اپنا پیراہن میرے پاس چھوڑ کر بھاگا اور باہر نِکل گیا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ اُسکا پیراہن اُسکے آقا کے گھر لَوٹنے تک اپنے پاس رکھے رہی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب اُس نے یہی باتیں آس سے کہیں کہ یہ عبِری غلام جو تُو لیا ہے میرے پاس اندر گھُس آیا کہ مُجھ سے مذاق کرے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "جب مَیں زور زور سے چِلاّ نے لگی تو وہ اپنا پیراہن میرے ہی پاس چھوڑ کر باہر بھاگ گیا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "جب اُسکے آقا نے اپنی بیوی کی وہ باتیں جو اُس نے اُس سے کہیں سُن لِیں کہ تیرے غلام نے مُجھ سے اَیسا اَیسا کیا تو اُسکا غضب بھڑکا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یُوسُؔف کے آقا نے اُسکو لیکر قید خانہ میں جہاں بادشاہ کے قیدی بند تھے ڈالدیا۔ سو وہ وہاں قید خانہ میں رہا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "لیکن خُداوند یُوسُؔف کے ساتھ تھا ۔ اُس نے اُس پر رحم کیا اور قید خانہ کے داروغہ کی نظر میں اُسے مقُبول بنایا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور قید خا خانہ کے داروغہ نے سب قیدیوں کو جو قید میں تھے یُوسُؔف کے ہاتھ میں سَونپا اور جو کچھ وہ کرتے اپسی کے حُکم سے کرتے تھے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور قید خانہ کا داروغہ سب کاموں کی طرف سے جو اُسکے ہاتھ میں تھے بے فکر تھا اِسئِے کہ خُداوند اُسکے ساتھ تھا اور جو کچھ وہ کرتا خداوند اُس میں اِقبالمند ی بخشتا تھا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 40,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اِن باتوں کے بعد یُوں ہوا کہ شاہِ مصؔر کا ساقی اور نان پَز اپنے خُداون دشاہِ مصؔر کے مُجِرم ہوئے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "فرؔعون اپنے اِن دونوں حاکموں سے جِن سے میں ایک ساقیوں اور دُسرا نان پرزوں کا سردار تھا ناراض ہوگیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور ُس نے اِنکو جلوداروں کے سردار کے گھر میں اُسی جگہ جہاں یُوؔسف حراست میں تھا قید خانہ میں نظر بند کرادای۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "جلوداروں کے سردار نے اُنکو یوُسؔف کے حوالے کیِا اور وہ اُنکی خِدمت کرنے لگا اور وہ ایک مُدّت تک نظر بند رہے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور شاہ مؔصر کے ساقی اور نان پز دونوں نے جو قید خانہ نظر بند تھے ایک ہی رات میں اپنے اپنے ہو نہار کے مُطابق ایک ایک خواب دیکھتا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور یُوسُؔف صبح کو اُنکے پاس اندر آیا اور دیکھا کہ وہ اُداس ہیں",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے فؔرعون کے حاکموں سے جو اُسکے ساتھ اُسکے آقا کے گھر میں نظر بند تھے پُوچھاکہ آج تُم کیوں اَیسے اُداو نظر آتے ہو؟",
                    },
                    {
                        "verse_num": 8,
                        "text": "اُنہوں نے اُس سے کہا ہم نے ایک خواب دیکھا ہے جسکی تعبیر کرنے والا کوئی نہیں ۔ یُوؔسُف نے اُن سے کہا کہ تعبیر کی قُدرت خُدا کو نہیں ؟ مجھےُ ذراہ خواب بتاؤ",
                    },
                    {
                        "verse_num": 9,
                        "text": "تب سردار ساقی نے اپنا خواب یُوؔسُف سے بیان کیا اُس نے کہا میں نے خواب میں دیکھا کہ اُنگور کی بیل میرے سامنے ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس بیل میں تین شاخیں ہیں ۔ اوراَیسا دِکھائی دیا کہ اُس میں کلیاں لگیں اور پھُول ّئے اور اپسکے گُچھوّں میں پِکے پِکے اُنگوُر لگے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور فرؔعون کا پیالہ میرے ہاتھ میں ہے اور میِں نے اُن انگوُروں کو لیکر فؔرعون کے پیالہ میں نچوڑا اور وہ پیالہ میَں نے فؔرعون کے ہاتھ میں دیا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "یُوؔسُف نے اُس سے کہا اِسکی تعبیر یہ ہے کہ وہ تین شاخیں تین دِن ہیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "سو اب سے تین دِن کے اندر فؔرعون تجھے سرفرزفرمائیگا اور تُجھے پھر تیرے منصب پر بحال کردیگااور پہلے کی طرح جب تُو اُسکا ساقی تھا پیالہ فؔرعون کے ہاتھ میں دیا کریگا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "لیکن جب تو خوشحال ہو جائے تو مجھے یاد کرنا اور ذرا مُجھ سے مہربانی سے پیش آنا اور فؔرعون سے میرا ذِکر کرنا اور مجھےاِس ھگر سے چھٹکارا دِلوانا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "کیونکہ عبرانیوں کے مُلک سے مُجھے چرُاکر لے آئے ہیں اور یہاں بھی میَں نے اَیسا کوئی کام نہیں کیا جسکے سبب سے قَید خانہ میں ڈالا جاؤں۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جب سردار نان پز نے دیکھا کہ تعبیر اسھی نگلی تو یُوؔسف سے کہا کہ میں نے بھی ایک خواب دیکھا کہ میرے سر پر سفید روئی کی تین تین ٹوکریاں ہیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اُوپر کیو ٹوکری میں ہر قِسم کا پکا ہُؤا کھانا فرؔعون کے لئےِ ہے اور پرندے میرے سرپر کی ٹوکری میں سے کھا رہے ہیں ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "یُوؔسُف نے اُسے کہا اِسکی تعبیر یہ ہے کہ وہ تین ٹوکریاں تین دن ہیں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "سو اب سے تین دِن کے اندر فرؔعون تیرا سر تیرے تن سے جُدا کرکے تجھے ایک درخت پر ٹنگوادیگا اور پرندے تیرا گوشت نوچ نوچ کر کھائینگے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور تیسرے دِن جو فؔرعون کی سالگرہ کا دِن تھا یُوں ہوا کہ اُس نے اپنے سب نوکروں کی ضیافت کی اور اُس نے سردار ساقی اور سردار نان پز کو اپنے نوکروں کے ساتھ یاد فرمایا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُس نے سردار ساقی کو پھر اُسکی خدمت پر بحال کیا اور فرؔعون کے ہاتھ میں پیالہ دینے لگا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "پر اُس نے سردار نان پز کو پھانسی دِلوائی جیسا یُوؔسُف نے تعبیر کرکے اُنکو بتایا تھا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "لیکن سردار ساقی نے یُوؔسُف کو یا نہ کا بلکہ اُسے ُبھول گیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 41,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پوُرے دو برس کے بعد فرؔعون نے خواب میں دیکھا کہ وہ لبِ دریا کھڑا ہے ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اُس دریا میں سے سات خُوبصُورت اور موٹی موٹی گائیں نِکل کر نیستان میں چرنے لگیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اُنکے بعد اَور سات بدشکل اور دُبلی دُبلی گائیں دریا سے نکلی اور دوُسری گایوں کے برابر دریا کے کنارے جا کھڑی ہُؤئیں ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور یہ بد شکل اور دُبلی دُبلی گائیں اُن ساتوں خُوبصورت اور موٹی موٹی گایوں کو کھا گِئیں ۔ تب فرؔعون جاگ اُٹھا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ پھر سو گیا اور اُس نے دُوسرا خواب دیکھا کہ ایک ڈنٹھی میں اناج کی سات موٹی اور اچھّی اچھّی بالیں نِکلیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اُنکے بعد اَور سات پتلی اور پُوربی ہوا کی ماری مُرجھائی ہُؤئی بالیں نِکلیں۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "یہ پتلی بالیں اُن ساتوں موٹی اور بھری ہُؤئی بالوں کو نِگل گئیِں اور فرؔعون جاگ گیا اور اُسے معلوم ہُوا کہ یہ خواب تھا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور صُبح کو یُوں ہُؤا کہ اُسکا جی گھبرایا ۔ تب اُس نے مِصؔر کے سب جادُوگروں اور سب دانشمندوں کو بُلوا بھیجا اور اپنا خواب اُنکو بتایا پر اُن میں سے کوئی فرؔعون کے آگے اُنکی تعبیر نہ کر سکا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اُس وقت سردار ساقی نے فرؔعون سے کہا کہ میری خطائیں آج مجُھے یاد آئیں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "جب فرؔعون اپنے خادِموں سے ناراض تھا اور اُس نے مجھے اور سردار نان پز کو جلوداروں کے سردار کے گھر میں نظر بند کروادِیا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "مَیں نے اور اُس نے ایک ہی رات میں ایک ایک خُواب دیکھا یہ خواب ہم نے اپنے اپنے ہونہار کے مُطابق دیکھے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "وہاں ایک عِبری جوان جلوداروں کے سردار کا نوکر ہمارے ساتھ تھا۔ ہم نے اُسے اپنے خواب بتائے اور اُس نے اُنکی تعبیر کی اور ہم میں سے ہر ایک کو ہمارے خواب کے مُطابق اُس نے تعبیر بتائی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور جو تعبیر اُس نے بتائی تھی وَیسا ہی ہُؤا کیونکہ مُجھے تو اُس نے میرے منصب پر بحال کیا تھا اور اُسے پھانسی دی تھی۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب فرؔعون نے یُوسُؔف کو بُلوا بھیجا۔ سو اُنہوں نے جلد اُسے قَید خانہ سے باہر نِکالا اور اُس نے حجامت بنوائی اور کپڑے بدل کر فرؔعون کے سامنے آیا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "فرؔعون نے یُوسُؔف سے کہا مَیں نے ایک خواب دیکھا ہے جسکی تعبیر کو ئی نہیں کر سکتا اور مُجھ سے تیرے بارے میں کہتے ہیں کہ تُو خواب کو سُن کر اُسکی تعبیر کرتا ہے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "یُوسُؔف نے فرعؔون کو جواب دِیا کہ میں کُچھ نہیں جانتا ۔ خُدا ہی فرعؔون کو سلامتی بخش جواب دیگا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب فرعؔون نے یُوسُؔف سے کہا کہ میں نے خواب میں دیکھا کہ مَیں دریا کے کنارے کھڑا ہُوں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اُس دریا میں سے ساتھ موٹی اور خُوبُصورت گائیں نِکل کر نیَستان میں چرنے لِگیں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اُن کے بعد اَور سات خراب اور نہایت بد شکل اور دُبلی گائیں نِکلیں اور وہ اِس قدر بُری تھیں کہ مَیں نے سارے مُلکِ مصؔر میں اَیسی کبھی نہیں دیکھیں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور وہ دُبلی اور بد شکل گائیں اُن پہلی ساتوںموٹی گایوں کو گھا گئیں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُنکے کھا جانے کے بعد یہ معلوم بھی نہیں ہوتا تھا کہ اُنہوں نے اُنکو کھا لیا ہے بلکہ وہ پہلے کی طرح جَیسی کی تیسی بد شکل رہیں ۔ تب مَیں جاگ گیا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور پھر خواب میں دیکھا کہ ایک ڈنٹھی میں سات بھری اور اچھّی اچھّی بالیں نکلیں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُنکے بعد اَور سات سُکھی اور پتلی اور پُوربی ہوا کی ماری مُرجھائی ہُوئی بالیں نِکلیں ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور یہ پتلی بالیں اُن ساتوں اچھّی اچھّی بالوں کو نِگل گئیں اور مَیں نے اِن جادُوگروں سے اِسکا بیان کِیا پر اَیسا کوٹی نہ نِکلا جو مُجھے اِسکا مطلب بتاتا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "تب یُوسُؔف نے فرعؔون سے کہا کہ فرعؔون کا خواب ایک ہی ہے ۔ جو کُچھ خُدا کرنے کو ہے اُسے اُس نے فرعؔون پر ظاہر کِیا ہے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "وہ سات اچھّی اچھّی گائیں سات برس ہیں اور وہ سات اچھّی اچھّی گائیں سات برس ہیں اور وہ سات اچھّی اچھّی بالیں بھی سات برس ہیں خواب ایک ہی ہے۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور وہ سات بدشکل اور دُبلی گائیں جو اُنکے بعد نِکلیںاور وہ سات خالی اور پُوربی ہوا کی ماری مُرجھا ئی ہُؤئی بالیں بھی سات برس ہیں مگر کال کے سات برس۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "یہ وہی بات ہے جو مَیں فرعؔون سے کہ چُکا ہُوں کہ جو کُچھ خُدا کرنے کو ہے ہے اُسے اُس نے فرعؔون پر ظاہر کِیا ہے۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "دیکھ ! سارے مُلکِ مصؔر میں سات برس تو پیداوارِ کثیر کے ہونگے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اُنکے بعد سات برس کال کے آئینگے اور تمام مُلکِ مصؔر میں لوگ اِس ساری پیداوار کو بھُول جائینگے اور یہ کال مُلک کو تباہ کردیگا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور ارزانی مُلک میں یاد بھی نہیں رہیگی کیونکہ جو کال بعد میں پڑیگا وہ نہایت ہی سخت ہوگا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور فرؔعون نے جو یہ خواب دو دفعہ دیکھا تو اِسکا سبب یہ ہے کہ یہ بات خُدا کی طرف سے مُقرر ہو چُکی ہے اور خُدا اِسے جلد پُورا کریگا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اَسلئِے فرؔعون کو چاہیتے کہ ایک دانشور اور عقلمند آدمی کو تلاش کر لے اور اُسے مُلکِ مِصؔر پر مُختار بنائے۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "فرؔعون یہ کرے تاکہ اُس آدمی کو اِختیار ہو کہ وہ مُلک میں ناظِروں کو مُقرر کر دے اور ارزانی کے سات برسوں میں سارے مُلکِ مِصؔر کی پَیداوار کا پانچوں حصّہ لیلے۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اُن اچھّے برسوں میں جو آتے ہیں سب کھانے کی چیزیں جمع کریں اور شہر شہر میں غلّہ جو فرؔعون کے اِختیار میں ہو خُورِش کے لِئے فراہم کرکے اُسکی حِفاظت کریں ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "یہی غلّہ مُلک کے لئِے ذخیرہ ہوگا اور ساتوں برس کے لئے جب تک مُلک میں کال رہیگا کافی ہوگا تا کہ کال کی وجہ سے مُلک برباد نہ ہو جائے ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "یہ بات فرؔعون اور اُسکے سب خادِموں کو پسند آئی ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "سو فرعؔون نے اپنے خادِموں سے کہا کہ کیا ہمکو اَیسا آدمی جَیسا یہ ہے جس میں خُدا کی رُوح ہے مِل سکتا ہے؟۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "اور فرؔعون نے یُوسُؔف سے کہا چونکہ خُدا نے تجھے یہ سب کُچھ سمجھا دیا ہے اِسلئِے تیری مانِند دانِشور اور عقلمند کوئی نہیں ۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "سو تُو میرے گھر کا مُختار ہوگا اور میری ساری رعایا تیرے حُکم پر چلیگی ۔ فقط تخت کا مالِک ہونے کے سبب سے میں بُزرگتر ہُونگا۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "فرؔعون نے یُوسُؔف سے کہا کہ دیکھ مَیں تجھے سارے مُلکِ مِصؔر کا حاکم بناتا ہُوں ۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "اور فرؔعون نے اپنی انگُشتری اپنے ہاتھ سے نِکالکر یُوسُؔف کے ہاتھ میں پہنا دی اور اُسے باریک کتان کے لباس میں ّراستہ کراکر سونے کا طُوق اُس کے گلے میں پہنایا ۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "اور اُس نے اُسے اپنے دُوسرے رتھ میں سوار کرا کر اُسکے آگے آگے یہ منادی کروادی کہ گُھٹنے ٹیکو اور اُس نے اُسے سارے مُلکِ مِصؔر کا حکام بنا دِیا۔",
                    },
                    {
                        "verse_num": 44,
                        "text": "اور فرؔعون نے یُوسُؔف سے کہا مَیں فرؔعون ہُوں اور تیرے حُکم کے بغیر کوئی آدمی اِس سارے مُلکِ مِصؔر میں اپنا ہاتھ یا پاؤں ہِلانے نہ پائیگا۔",
                    },
                    {
                        "verse_num": 45,
                        "text": "اور فَرؔعون نے یُوسُؔف کا نام صِفناؔت فعنیح رکھّا اور اُس نے اؔون کے پُجاری فوطِؔفیرع کی بیٹی آسِؔناتھ کو اُس سے بیا ہ دِیا اور یُوسُؔف مُلکِ مصِؔر میں دَورہ کرنے لگا۔",
                    },
                    {
                        "verse_num": 46,
                        "text": "اور یُوسُؔف تِیس برس کا تھا جب وہ مِصؔر کے بادشاہ فرؔعون کے سامنے گیا اور اُس نے فرؔعون کے پاس سے رُخصت ہو کر سارے مُلکِ مصِؔر کا دَورہ کِیا ۔",
                    },
                    {
                        "verse_num": 47,
                        "text": "اور ارزانی کے ساتھ برسوں میں اِفراط سے فصل ہُوئی ۔",
                    },
                    {
                        "verse_num": 48,
                        "text": "اور وہ لگاتار ساتوں برس ہر قِسم کی خُورِش جو مُلکِ مِصؔر میں پیدا ہوتی تھی جمع کر کرکے شہروں میں اُسکا ذخیرہ کرتا گیا۔ ہر شہر کی چاروں اطراف کی خُرِش وہ اُسی شہر میں رکھتا گیا۔",
                    },
                    {
                        "verse_num": 49,
                        "text": "اور یُوسُؔف نے غلّہ سمندر کی ریت کی مانِند نہایت کثرت سے ذخیرہ کِیا یہاں تک کہ حساب رکھنا بھی چھوڑ دِیا کیونکہ وہ بے حساب تھا۔",
                    },
                    {
                        "verse_num": 50,
                        "text": "اور کال سے پہلے اوؔن کے پُجاری فو طِؔیفر ع کی بیٹی آسِؔناتھ کے یُوسُؔف سے دو بیٹے پیدا ہُوئے ۔",
                    },
                    {
                        "verse_num": 51,
                        "text": "اور یُوسُؔف نے پہلوٹھے کا نام مُنسّؔیی یہ کہہ کر رکھّا کہ خُدا نے میری اور میرے باپ کے گھر کی سب مُشقت مُجھ سے بھُلا دی ۔",
                    },
                    {
                        "verse_num": 52,
                        "text": "اور دُوسرے کا نام اِفؔرائیم یہ کہکر رکھا کہ خُدا نے مجھے میری مُصیبت کے مُلک میں پھلدار کِیا ۔",
                    },
                    {
                        "verse_num": 53,
                        "text": "اور ارزانی کے وہ سات برس جومُلکِ مصِؔر میں ہُوئے تمام ہو گئے اور یُوسُؔف کے کہنے کے مُطابق کال کے ساتھ برس شروع ہُوئے ۔",
                    },
                    {
                        "verse_num": 54,
                        "text": "اور اَور سب مُلکوں میں تو کال تھا پر مُلکِ مصِؔر میں ہر جگہ خُرِش موجود تھی۔",
                    },
                    {
                        "verse_num": 55,
                        "text": "اور جب مُلکِ مصر میں لوگ بُھوکوں مرنے لگے تو روٹی کے لئِے فرؔعون کے آگے چِلاّئے ۔ فرؔعون نے مِصریوں سے کہا کہ یُوسُؔف کے پاس جاؤ۔ جوکُچھ وہ تُم سے کہے سو کرو۔",
                    },
                    {
                        "verse_num": 56,
                        "text": "اور تمام روِٰ ی زمین پر کال تھا اور یُوسُؔف اناج کے کھتوں کو کُھلوا کر مِصریوں کے ہاتھ بیچنے لگا اور مُلکِ مصؔر میں سخت کال ہوگیا۔",
                    },
                    {
                        "verse_num": 57,
                        "text": "اور سب مُلکوں کے لوگ اناج مول لینے کے لئِے یُوسُؔف کے پاس مِصؔر میں آنے لگے کیونکہ ساری زمین پر سخت کال پڑا تھا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 42,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یعؔقوب کو معلوم ہُؤا کہ مِصؔر میں غلّہ ہے تب اُس نے اپنے بیٹوں سے کہا کہ تُم کیوں ایک دُوسرے کا مُنہ تاکتے ہو؟",
                    },
                    {
                        "verse_num": 2,
                        "text": "دیکھو مَیں نے سُنا ہے کہ مِصؔر میں غلّہ ہے ۔ تم وہاں جاؤ اور وہاں سے ہمارے لئِے اناج مول لے آؤ تاکہ ہم زِندہ رہیں اور ہلاک نہ ہوں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "سو یُوسُؔف کے دس بھائی غلّہ مول لینے کو مِؔصر میں آئے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "پر یعؔقوب نے یُوسُؔف کے بھائی بنیمؔین کو اُسکے بھائیوں کے ساتھ نہ بھیجاکیونکہ اُس نے ککہا کہ کہیں اُس پر کوئی آفت نہ آجائے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "سو جو لوگ غلّہ خرید نے آئے اُنکے ساتھ اِسؔرائیل کے بیٹے بھی آئے کیونکہ کنعاؔن کے مُلک میں کال تھا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور یُوسُؔف مُلکِ مِصؔر کا حاکمِ تھا اور وہی مُلک کے سب لوگوں کے ہاتھ غلّہ بیچتا تھا ۔ سو یوُسُؔف کے بھائی آئے اور اپنے سر زمین ٹیک کر اُسکے حضُور آداب بجا لائے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "یُوسؔف اپنے بھائیوں کو دیکھ کر اُنکو پہچان گیا پر اُس نے اُنکے سامنے اپنے آپ کو انجان بنا لیا اور اُن سے سخت لہجہ میں پُوچھا تُم کہاں سے آئے ہو؟ اُنہوں نے کہا کنعانؔ کے مُلک سے اناج مول لینے کو۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "یُوسُؔف نے اپنے بھائیوں کو پہچان لیا تھا پر اُنہون نے اُسے نہ پہچانا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور یوُسؔف اُن خوابوں کو جو اُس نے اُنکی بابت دیکھے تھے یاد کر کے اُن سے کہنے لگا کہ تُم جاسُوس ہو۔ تُم آئے ہو کہ اِس مُلک کی بُری حالت دریافت کرو۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُنہوں نے اُس سے کہا نہیں خُداوند ۔ تیرے غُلام اناج مول لینے آئےہیں۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "ہم سب ایک ہی شخص کے بیٹے ہیں۔ ہم سچّے ہیں ۔ تیرے غلام جاسُوس نہیں ہیں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اُس نے کہا نہیں بلکہ تُم اِس مُلک کی بُری حالت دریافت کرنے کو آئے ہو۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب اُنہوں نے کہا تیرے غلام بارہ بھائی ایک ہی شخص کے بیٹے ہیں جو مُلکِ کنعان میں ہے ۔ سب سے چھوٹا اِس وقت ہمارے باپ کے پاس ہے اور ایک کا کُچھ پتا نہیں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب یُوسُؔف نے اُن سے کہا ۔ مَیں تو تُم سے کہہ چُکا کہ تُم جاسُوس ہو۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "سو تُمہاری آزمایش اِس طرح کیجائیگی کہ فرؔعون کی حیات کی قسم تُم یہاں سے جانے نہ پاؤ گے جب تک تُمہارا سب سے چھوٹا بھائی یہاں نہ آجائے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "سو اپنے میں سے کسی ایک کو بھیجو کہ وہ تُمہارے بحا4ی کو لے +4ے اور تُم قید رہو تا کہ تمُہاری باتوں کی تصدیق ہو کہ تُم سچے ہو یا نہیں ورنہ فرؔعون کی حیات کی قسم تُم ضرور ہی جاسُوس ہو۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اُس نے اُن سب کو تین دِن تک اِکھٹّے نظر بند رکھّا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور تیسرے دِن یُوسُؔف نے اُن سے کہا ایک کام کرو تو زِندہ رہو گے کیونکہ مُجھے خُدا کا خوف ہے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اگر تُم سچّے ہو تو اپنے بھائیوں میں سے ایک کو قَید خانہ میں بند رہنے دو اور تُم اپنے گھر والوں کے کھانے کے لئِے کے کھانے کے لئِے اناج لیجاؤ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اپنے سب سے چھوٹے بھائی کو میرے پا س لے آؤ ۔ یُوں تُمہاری باتوں کی تصدیق ہو جائیگی اور تُم ہلاک نہ ہوگے۔ سو اُنہوں نے اَیسا ہی کِیا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور وہ آپس میں کہنے لگے کہ ہم دراصل اپنے بھائی کے سبب سے مُجرم ٹھہرے ہیں کیونکہ جب اُس نے ہم سے مِنت کی تو ہم نے یہ دیکھ کر بھی کہ اُسکی جان کَیسی مصُیبت میں ہے اُسکی نہ سُنی ۔ اِسی لئِے یہ مُصیبت ہم پر آپڑی ہے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "تب رُوبنؔ بول اُٹھا کیا مَیں نے تُم سے نہ کہا تھا کہ اِس بچّے پر ظُلم نہ کرو اور تُم نے نہ سُنا ۔ سو دیکھ لو۔ اب اُسکے خُون کا بدلہ لیا جاتا ہے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُنکو معلوم نہ تھا کہ یُوسُؔف اُنکی باتیں سمجھتا ہے اِسلئِے کہ اُنکے درمیان ایک ترجمان تھا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب وہ اُنکے پاس سے ہٹ گیا اور رویا اور پھر اُنکے پاس آکر اُن سے باتیں کِیں اور اُن میں سے شمعؔون کو لیکر اُنکی آنکھوں کے سامنے اُسے بندھوادِیا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "پھِر یوُسُؔف نے حُکم کِیا کہ اُنکے بوروں میں اناج بھریں اور ہر شخص کی نقدی اُسی کے بورے میں رکھ دیں اور اُنکو زادِ رہ بھی دیدیں ۔چنانچہ اُنکے لئِے اَیسا ہی کِیاگیا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور اُنہوں نے اپنے گدھوں پر غلّہ لاد لِیا اور وہاں سے روانہ ہُؤئے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "جب اُن میں سے ایک نے منزل پر اپنے گدھے کو چارا دینے کے لئِے اپنا بورا کھولا تو اپنی نقدی بورے کے منہ میں رکھّی دیکھی ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "تب اُس نے اپنے بھائیوں سے کہا کہ میری نقدی پھیر دی گئی ہے ۔ وہ میرے بورے میں ہے ۔ دیکھ لو! پھر تو وہ حواس باختہ ہو گئے اور ہکاّ بکاّ ہو کر ایک دُوسرے کو دیکھنے اور کہنے لگے خُدا نے ہم سے یہ کیا کِیا؟",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور وہ مُلکِ کنعان میں اپنے باپ یعؔقوب کے پاس آئے اور ساری واردات اُسے بتائی اور کہنے لگے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "کہ اُس شخص نے جو اُس مُلک کامالکِ ہے ہم سے سخت لہجہ میں باتیں کِیں اور ہمکو اُس مُلک کے جاسُوس سمجھا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "ہم نے اُس سے کہا کہ ہم سچّے آدمی ہیں ۔ ہم جاسُوس نہیں ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "ہم بارہ بھائی ایک ہی باپ کے بیٹے ہیں ۔ ہم میں سے ایک کا کُچھ پتا نہیں اور سب سے چھوٹا اِس وقت ہمارے باپ کے پاس مُلکِ کنعان میں ہے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "تب اُس شخص نے جو مُلک کا مالِک ہے ہم سے کہا مَیں اِسی سے جان لُونگا کہ تم سچّے ہو کہ اپنے بھائیوں میں سے کِسی کو میرے پاس چھوڑ دو اور اپنے گھر والوں کے کھانے کے لئِے اناج لیکر چلے جاؤ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور اپنے سب سے چھوٹے بھائی کو میرے پاس لے آؤ۔ تب مَیں جان لُونگا کہ تم جاسوُس نہیں بلکہ سچّے آدمی ہو اور مَیں تُمہارے بھائی کو تُمہارے حوالہ کر دُونگا ۔ پھِر تُم مُلک میں سَوداگری کرنا۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور یُوں ہوا کہ جب اُنہوں نے اپنے اپنے بورے خالی کئِے تو ہر شخص کی نقدی کی تھیلی اُسی کے بورے میں رکھّی دیکھی اور وہ اور اُنکا باپ نقدی کی تھَیلیاں دیکھ کر ڈر گئے۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور اُنکے باپ یعؔقوب نے اُن سے کہا تُم نے مُجھے بے اَولاد کر دیا ۔ یوُسف نہیں رہا اور شمعؔون بھی نہیں ہے اور بنیمیؔن کو بھی لیجانا چاہتے ہو۔ یہ سہب باتیں میرے خِلاف ہیں ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "تب رُوؔبن نے اپنے باپ سے کہا گر مَیں اُسے تیرے پاس نہ لے آؤں تو میرے دونوں بیٹوں کو قتل کر ڈالنا۔ اُسے میرے ہاتھ میں سونپ دےاور مَیں اُسے پھر تیرے پاس پہنچاؤ نگا۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اُس نے کہا میرا بیٹا تُمہارے ساتھ نہیں جائیگا کیونکہ اُسکا بھائی مرگیا اور وہ اکیلا ہے ۔ اگر راستہ میں جاتے جاتے اُس پر کوئی آفت آ پڑے تو تُم میرے سفید بالوں کو غم کے ساتھ گورمیں اُتاروگے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 43,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور کال مُلک میں اَور بھی سخت ہو گیا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور یُوں ہُؤا کہ جب اُس غلّہ کو جِسے مِصؔر سے لائے تھے کھا چُکے تو اُنکے باپ نے اُن سے کہا کہ جا کر ہمارے لئِے پِھر اناج مول لے آؤ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تب یہؔوداہ نے اُسے کہا کہ اُس شخص نے ہمکو نہایت تاکید سے کہہ دِیا تھا کہ تُم میرا مُنہ نہ دیکھو گے جب تک تُمہارا بھائی تمہارے ساتھ نہ ہو۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "سو اگر تُو ہمارے بھائی کو ہمارے ساتھ بھیج دے تو ہم جائینگے اور تیرے لئِے اناج مول لائینگے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اگر تُو اُسے نہ بھیجے تو ہم نہیں جائینگے کیونکہ اُس شخص نے کہہ دِیا ہے کہ تُم میرا مُنہ نہ دیکھو گے جب تک تُمہارا بھائی تُمہارے ساتھ نہ ہو۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب اِسؔراؑیل نے کہا کہ تُم نے مُجھ سے کیوں یہ بدُسُلوکی کی کہ اُس شخص کو بتا دِیا کہ ہمارا ایک بھائی اور بھی ہے۔ ؟",
                    },
                    {
                        "verse_num": 7,
                        "text": "اُنہوں نے کہا اُس ژخص نے بجِد ہو کر ہمارا اور ہمارے خاندان کا حال پُوچھا کہ کیا تُمہارا باپ اب تک جِیتا ہے ؟ اور کیا تُمہارا کوئی اَور بھائی ہے؟ تو ہم نے اِن سوالوں کے مُطابِق اُسے بتا دِیا ۔ ہم کیا چانتے تھے کہ وہ کہیگا کہ اپنے بھائی کو لے آؤ۔ ",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب یہؔوداہ نے اپنے باپ اِسؔراؑیل سے کہا کہ اُس لڑکے کو میرے ساتھ کر دے تو ہم چلے جائینگے تا کہ ہم اور تُو اور ہمارے بال بچےّ زِندہ رہیں اور ہلاک نہ ہوں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اورمَیں اُسکا ضامِن ہوتا ہُوں ۔ تُو اُسکو میرے ہاتھ سے واپس مانگنا ۔ اگر مَیں اُسے تیرے پاس پہنچا کر سامنے کھڑا نہ کردُوں تو مَیں ہمیشہ کے لئِے گنہگار ٹھہرونگا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اگر ہم دیر نہ لگاتے تو اب تک دُوسری دفعہ لَوٹ کر آبھی جاتے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب اُنکے باپ اِؔسرائیل نے اُن سے کہا اگر یہی بات ہے تو اَیسا کرو کہ اپنے برتنوں میں اِس مُلک کی مشہور پیداوار میں سے کُچھ اُس شخص کے لئِے نذرانہ لیتے جاؤ جِیسے تھورا سا روغن بلسان تھوڑا سا شہید کُچھ گرم مصالح اور مُّر اور پَستہ اور بادام ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور دُونادام اپنے ہاتھ میں لے لو اور وہ نقدی جو پھیر دی گئی اور تُمہارے بوروں کے مُنہ میں رکھّی ملی اپنے ساتھ واپس لے جاؤ کیونکہ شاید بھُول ہوگئی ہوگی۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اپنے بھائی کو بھی ساتھ لو اور اُٹھ کر پھر اُس شخص کے پاس جاؤ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور خُداٰ قادِر اُس شخص کو تُم پر مہربان کرے تا کہ وہ تُمہارے دُوسرے بھائی کو اور بینمؔین کو تُمہارے ساتھ بھیج دے۔ مَیں اگر بے اَولاد ہُؤا تو ہُؤا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب اُنہوں نے نذرانہ لیا اور وہ نادم بھی ہاتھ میں لے لِیا اور بینمؔین کو لیکر چل پڑے اور مِصؔر پہنچ کر یُوسُؔف کے سامنے جا کھڑے ہوئے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جب یُوسُؔف نے بینمؔین کو اُنکے ساتھ دیکھا تو اُس نے اپنے گھر کے مُنتظمِ سے کہا اِن آدمیوں کو گھر میں لے جا اور کوئی جانور ذبح کر کے کھانا تیار کرو ا کیونکہ یہ آدمی دوپہر کو میرے ساتھ کھانا کھائینگے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُس شخص نے جِیسا یُوسؔف نے فرمایا تھا کِیا اور اِن آدمیوں کو یُوسؔف کے گھر میں لے گیا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "جب اِنکو یُوسؔف کے گھر میں پہنچا دِیا تو ڈر کے مارے کہنے لگے کہ وہ نقدی جو پہلی دفعہ ہمارے بورو میں رکھ کر واپس کر دی گئی تھی اُسی کے سبب سے ہمکو اندر کروا دیا ہے تاکہ اُسے ہمارے خِلاف بہانہ مِل جائے اور وہ ہم پر حملہ کرکے ہمکو غُلام بنالے اور ہمارے گدھوں کو چھِین لے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور وہ یُوسؔف کے گھر کے مُنتظمِ کے پاس گئے اور دروازہ پر کھڑے ہو کر اُس سے کہنے لگے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "جناب! ہم پہلے بھی یہاں اناج مول لینے آئے تھے",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور یُوں ہُوا کہ جب ہم نے منزل پر اُتر کر اپنے بوروں کو کھولا تو اپنی اپنی پوری تُلی ہوئی نقدی اپنے اپنے بورے کے مُنہ میں رکھی دیکھی سو ہم اُسے اپنے ساتھ واپس لیتے آئے ہیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور ہم اناج مول لینے کو اَور بھی نقدی ساتھ لائے ہیں ۔ یہ ہم نہیں جانتا کہ ہماری نقدی کِس نے ہمارے بوروں میں رکھ دی۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اُس نے کہا کہ تُمہاری سلامتی ہو ۔ مت ڈرو۔ تُمہارے خُدا اور تُمہارے باپ کے خُدا نے تُمہارے بوروں میں تمکو خزانہ دِیا ہوگا۔ مُجھے تو تُمہاری نقدی مِل چُکی ۔ پھر وہ شمؔعون کو نِکال کر اُنکے پاس لے آیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُس شخص نے اُنکو یُوسؔف کے گھر میں لا کر پانی دیا اور اُنہوں نے اپنے پاؤں دھوئے اور اُنکے گدھوں کو چارا دِیا ۔",
                    },
                    {
                        "verse_num":25,
                        "text": "پِھر اُنہوں نے یُوسؔف کے اِنتظار میں کہ وہ دوپہر کو آئیگا نذرانہ تیار کرکے رکھا۔ کیونکہ اُنہوں سُنا تھا کہ اُنکو وہیں روٹی کھانی ہے۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "جب یُوؔسف گھر آیا تو وہ اُس نذرانہ کو جو اُنکے پاس تھا اُسکے سامنے لے گئے اور زمین پر جُھک کر اُسکے حضور آداب بجا لائے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اُس نے اُن کے خیر و عافیت پُوچھی اور کہا کہ تُمہارا بُوڑھا باپ جِسکا تُم ذِکر کیا تھا اچھّا تو ہے ؟ کیا وہ ابتک جِیتا ہے ؟",
                    },
                    {
                        "verse_num": 28,
                        "text": "اُنہوں نے جواب دِیا تیرا خادِم ہمارا باپ خیریت سے ہے اور اب تک جِیتا ہے ۔ پھر وہ سر جُھکا جُھکا کر اُسکے حضور آداب بجا لائے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "پِھر اُس نے آنکھ اُٹھا کر اپنے بھائی بینؔمین کو جو اُسکی ماں کا بیٹا تھا دیکھا اور کہا کہ تُمہارا سب سے چھوٹا بھائی جِسکا ذِکر تُم مُجھ سے کِیا تھا یہی ہے؟ پھر کہا کہ اَے میرے بیٹے ! خُدا تُجھ پر مہربان رہے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "تب یُوؔسف نے جلدی کی کیونکہ بھائی کو دیکھ کر اُسکا جی بھر آیا اور وہ چاہتا تھا کہ کہیں جا کر روئے ۔ سو وہ اپنی کوٹھری میں جا کر وہاں رونے لگا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "پھر وہ اپنا مُنہ دھو کر باہر نِکلا اور اپنے کو ضبط کرکے حکم دِیا کہ کھانا چُنو۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اُنہوں نے اُسکے لئے جو اُسکے ساتھ کھاتے تھے جُدا کھانا چُنا کیونکہ مصؔر کے لوگ عبرانیوں کے ساتھ کھانا نہیں کھا سکتے تھے کیونکہ مصریوں کو اِس سے کراہیت ہے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور یُوؔسف کے بھائی اُسکے سامنے ترتیب وار اپنی عُمر کی بڑائی اور چھوٹائی کے مطُابق بَیٹھے اور آپس میں حَیران تھے۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "پھر وہ اپنے سامنے سے کھانا اُٹھا کر حِصّے کر کر کے اُنکو دینے لگا اور بینؔمین کو حِصّہ اُنکے حِصہّ سے پانچ گنُا ذِیادہ تھا اور اُنہوں نے مَے پی اور اُسکے ساتھ خوشی منائی۔",
                    },
                    
                ],
            },
            {
                "chap_num": 44,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر اُس نے اپنے گھر کےمنُتِظم کو حُکم کیا کہ اِن آدمیوں کے بوروں میں جِتنا اناج وہ لے جاسکیں بھر دے اور ہر شخص کی نقدی اُسی کے بورے کے مُنہ میں رکھ دے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور میرا چاندی کا پیالہ سب سے چھوڑے کے بورے کے مُنہ میں اُسکی نقدی کے ساتھ رکھنا ۔ چنانچہ اُس نے یُوؔسف کے فرمانے کے مطُابق عمل کیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "صُبح روشنی ہوتے ہی یہ آدمی اپنے گدوں کے ساتھ رخصت کر دیئے گئے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "وہ شہر سے نِکل کر ابھی دُور بھی نہیں گئے تھعے کہ یُوؔسف نے اپنے گھر کے منتظم سے کہا کہ جا اِن لوگوں کا پیچھا کر اور جب تک اُنکو جالے تو اُن سے کہنا کہ نیکی کے عوض تُم نے بدی کیوں کی ؟",
                    },
                    {
                        "verse_num": 5,
                        "text": "کیا یہ وہی چیز نہیں جِس سے میرا آقا پِیتا اور اِسی سے ٹھیک فال بھی کھولا کرتا ہے ۔؟ تُم نے جو یہ کیا سو بُرا کیا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اُس نے اُنکو جا لِیا اور یہی باتیں اُن سے کہیں ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب اُنہوں نے اُس سے کہا کہ ہمارا خُداوند اَیسی باتیں کِیوں کہتا ہے ؟ خُدا نہ کر کہ تیرے خادِم اَیسا کام کریں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "بھلا جو نقدی ہمکو اپنے بوروں کے مُنہ میں مِلی اُسے تو ہم مُلکِ کنعان سے تیرے پاس واپس لے آُئے ۔ پھر تیرے آقا کے گھر سے چاندی یا سونا کیونکر چُراسکتے ہیں ؟",
                    },
                    {
                        "verse_num": 9,
                        "text": "سو تیرے خادِموں میں سے جس کسی کے پاس وہ نکلے وہ مار دِیا جائے اور ہم بھی اپنے خُداوند کے غلام ہو جائینگے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُس نے کہا کہ تُمہارا ہی کہنا سہی۔ جسکے پاس وہ نِکل آئے وہ میرا غلام ہو گا اور تُم بے گناہ ٹھہرو گے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب اُنہوں نے جلدی کی اور ایک ایک نے اپنا بورا زمین پر اُتار لیا اور ہر شخص نے اپنا بورا کھول دِیا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "سو وہ ڈُھونڈنے لگا اور سب سے بڑے سے شروع کرکے سب سے چھوٹے پر تلاشی ختم کی اور پیالہ بینؔمین کے بورے میں مِلا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب اُنہوں نے اپنے پیراہن چاک کئِے اور ہر ایک اپنے گدھے کو لاد اُلٹا شہر کو پِھرا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور یُؔہوداہ اور اُسکےبھائی یُوؔسف کے گھر آئے ۔ وہ اب تک وہیں تھا ۔ سو وہ اُسکےآگے زمین پر گرِے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب یُوؔسف نے اُن سے کہا تم نے یہ کیسا کام کیا؟ کیا تمکو معلوم نہیں کہ مجھ سا آدمی ٹھیک فال کھولتا ہے؟",
                    },
                    {
                        "verse_num": 16,
                        "text": "یؔہوداہ نے کہا کہ ہم اپنے خُداوند سے کیا کہیں؟۔ ہم کیا بات کریں یا کیونکر اپنے کو بری ٹھہرائیں ؟ خُدا نے تیرے خادِموں کی بدی پکڑ لی۔ سو دیکھ! ہم بھی اور وہ بھی جِسکے پاس پیالہ نِکلا دونوں اپنے خُداوند کے غلام ہیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُس نے کہا خُدا نہ کرے کہ میَں ایسا کروں ۔ جس شخص کے پاس یہ پیالہ نِکلا وُہی میرا غُلام ہوگا اور تُم اپنے باپ کے پاس سلامت چلے جاؤ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب یہؔوداہ اُسکے نزدیک جا کر کہنے لگا اے میرے خُداوند ذرا اپنے خادم کو اجازت دے کہ اپنے خُداوند کے کان میں ایک بات کہے اور تیرا غضب تیرے خادِم پر نہ بھڑکے کیونکہ تو فرؔعون کی مانند ہے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "میرے خُداوند نے اپنے خادِموں سے سوال کیا تھا کہ تمہارا باپ یا تُمہارا بھائی ہے؟",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور ہم نے اپنے خُداوند سے کہا تھا کہ ہمارا ایک بوڑھا باپ ہے اور اُس کے بڑھاپے کا ایک چھوٹا لڑکا بھی ہے۔ اور اُسکا بھائی مرگیاہے اور وہ اپنی ماں کا ایک ہی رہ گیا ہے۔ سو اُسکا باپ اُس پر جان دیتا ہے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تب تو نے اپنے خادموں سے کہا کہ اُسے میرے پاس لے آؤ کہ میَں اُسے دیکھوں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "ہم نے اپنے خُداوند کو بتایا کہ وہ لڑکا اپنے باپ کو چھوڑ نہیں سکتا کیونکہ اگر وہ اپنے باپ کو چھوڑے تو اُسکا باپ مر جائیگا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "پھر تو نے اپنے خادِموں سے کہا کہ جب تک تُمہارا چھو ٹا بھائی تمہارے ساتھ نہ آئے تُم پھر میرا مُنہ نہ دیکھو گے۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور یُوں ہُؤا کہ جب ہم اپنے باپ کے پاس جو تیرا خادِم ہے پہنچے تو ہم نے اپنے خُداوند کی باتیں اُس سے کہیں۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "ہمارے باپ نے کہا پھر جا کر ہمارے لئِے کچھ اناج مول لاؤ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "ہم نے کہا ہم نہیں جاسکے ۔ اگر ہمارا سب سے چھوٹا بھائی ہمارے ساتھ ہو تو ہم جائینگے کیونکہ جب تک ہمارا سب سے چھوٹا بھائی ہمارے ساتھ نہ ہو ہم اُس شخص کا مُنہ نہ دیکھینگے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور تیرے خادِم میرے باپ نے ہم سے کہا تُم جانتے ہو کہ میری بیوی کے مُجھ سے دو بیٹے ہوئے۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "ایک تو مجُھے چوڑ ہی گیا اور میَں نے خیال کیا کہ وہ ضرور پھاڑ ڈالا گیا ہوگا اور میَں نے اُسے اُس وقت سے پھر نہیں دیکھا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اب اگر تُم میرے سفید بالوں کو غم کے ساتھ قبر میں اُتاروگے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "سو اب اگر میں تیرے خادم اپنے باپ کے پاس جاؤں اور یہ لڑکا ہمارے ساتھ نہ ہو تو چونکہ اُسکی جان اس لڑکے کی جان کے ساتھ وابستہ ہے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "وہ یہ دیکھ کر کہ لڑکا نہیں آیا مر جائیگا اور تیرے خادم اپنے باپ کے جو تیرا خادم ہے سفید بالوں کو غم کے ساتھ قبر میں اُتارینگے۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور تیرا خادم اپنے باپ کے سامنے اس لڑکے کا ضامن بھی ہو چُکا ہے۔ اور یہ کہا ہے کہ اگر میَں اُسے تیرے پاس واپس نہ پہنچادُوں تو میَں ہمیشہ کے لئِے اپنے باپ کا گہنگار ٹھہرؤنگا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اِسلئے اب تیرے خادِم کو اجازت ہو کہ وہ اِس لڑکے کے بڈلے اپنے خُداوند کا غُلام ہو کر رہ جائے اور یہ لڑکا اپنے بھائیوں کے ساتھ چلا جائے ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "کیونکہ لڑکے کے بغیر میَں کیا مُنہ لیکر اپنے باپ کے پاس جاؤں ۔؟ کہیں اَیسا نہ ہو کہ مجُھے وہ مُصیبت دیکھنی پڑے جو اَیسے حال میں میرے باپ پر آئیگی۔",
                    },
                    
                ],
            },
            {
                "chap_num": 45,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب یُوؔسف اُنکے آگے جو اُسکے آس پاس کھڑے تھے اپنے کو ضبط نہ کر سکا اور چلاّ کر کہا ہر ایک آدمی کو میرے پاس سے باہر کر دو۔ چنانچہ جب یُوؔسف نے اپنے آپ کو اپنے بھائیوں پر ظاہر کیا اُس وقت اور کوئی اُسکے ساتھ نہ تھا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور وہ چلاّ چلاّ کر رونے لگا اور مصرِیوں نے سُنا کہ فرؔعون کے محل میں بھی آواز گئی۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور یُوؔسف نے اپنے بھائیوں سے کہا میں یُوؔسف ہُوں ۔ کیا میرا باپ اب تک جِیتا ہے؟ اور اُسکے بھائی اُسے کُچھ جواب نہ دیسکے کیونکہ وہ اُسکے سامنے گھبرا گئے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور یُوؔسف نے اپنے بھائیوں سے کہا ذرا نزدیک آجاؤ اور وہ نزدیک آئے ۔ تب اُس نے کہا میَں تُمہارا بھائی یُوؔسف ہُوں ۔ جس کو تُم نے بیچ کر مصؔر پہنچوایا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اس بات سے کہ تم نے مجُھے بیچ کر یہاں پہنچوایا نہ تو غمگین ہو اور نہ اپنے اپنے دل میں پریشان ہو کیونکہ خُدا نے جانوں کو بچانے کے لئے مجُھے تم سے آگے بھیجا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اِس لئے کہ اب دو برس سے ملک میں کال ہے اور ابھی پانچ برس اور ایسے ہیں جن میں نہ تو ہل چلیگا اور نہ فصل کٹیگی ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور خُدا نے مجُھکو تمہارے آگے بھیجا تا کہ تُمہارا بقیہّ زمین پر سلامت رکھےّ اور تُمکو بڑی رہائی کے وسیلہ سے زندہ رکھےّ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پس تم نے نہیں بلکہ خُدا نے مجُھے یہاں بھیجا اور اپس نے مجُھے گویا فرؔعون کا باپ اور اُسکے سارے گھر کا خُداوند اور سارے ملک مصؔر کا حاکم بنایا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "سو تُم جلد میرے باپ کے پاس جا کر اُسے سے کہو کہ تیرا بیٹا یُوؔسف یُوں کہاتا ہے کہ خُدا نے مجُھ کو سارے مصؔر کا مالک کر دیا ہے تو میرے پاس چلاّ آ دیر نہ کر۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تُو جشؔن کے علاقہ میں رہنا اور تُو اور تیرے بیٹے اور تیرے پوتے اور تیری بھیڑ بکریاں اور گائے اور بیل اور تیرا مال و متاع یہ سب میرے نزدیک ہونگے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور وہیں میَں تیری پرورش کرُونگا تا نہ ہو کہ تحُھکو اور تیرے گھرانے اور تیرے مال و متاع کو مُفلسی آدبائے کیونکہ کال کے ابھی پانچ برس اَور ہیں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور دیکھو تمہاری آنکھیں اور میرے بھائی بینؔمین کی آنکھیں دیکھتی ہیں کہ خود میرے مُنہ سے یہ باتیں تُم سے ہو رہی ہیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور تُم میرے باپ سے میری ساری شان و شوکت کا جو مجُھے مؔصر میں حاصل ہے اور جو کچُھ تُم نے دیکھا ہے سب کا ذِکر کرنا اور تُم بہت جلد میرے باپ کو یہاں لے آنا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور وہ اپنے بھائی بینؔمین کے گلے لگ کر رویا۔ اور بینؔمین بھی اُسکے گلے لگ کر رویا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اُس نے سب بھائیوں کوچُوما اور اُن سے ملکر رویا۔ اِسکے بعد اُسکے بھائی اپس سے باتیں کرنے لگے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور فرؔعون کےمحل میں اِس بات کا ذکر ہُوا کہ یُوؔسف کے بھائی آئے ہیں اور اِس سے فرؔعون اور اُسکے نوکر چاکر بہت خُوش ہوئے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور فرؔعون نے یوُؔسف سے کہا کہ اپنے بھائیوں سے کہہ تُم یہ کام کرو کہ اپنے جانوروں کو لاد کر ملک کنعان کو چلے جاؤ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اپنے باپ کو اور اپنے اپنے گھرانے کو لیکر میرے پاس آجاؤ اور جو اور جو کچھ ُملک مؔصر میں اچھےّ سے اچھاّ ہے وہ میَں تُمکو دونگا اور تُم اس ُملک کی عُمدہ عُمدہ چیزیں کھانا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تجھے حکم ملِ گیا ہے کہ اُن سے کہے تُم یہ کرو کہ اپنے بال بچّوں اور اپنی بیویوں کے لئِے ُملک مصؔر سے اپنے ساتھ گاڑیاں لیجاؤ اور اپنے باپ کو بھی ساتھ لیکر چلے آؤ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اپنے اسباب کا کچُھ افسوس نہ کرنا کیونکہ ُملک مؔصر کی سب اچھیّ چیزیں تُمہارے لئِے ہیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اِؔسرائیل کے بیٹوں نے اَیسا ہی کا اور یُوؔسف نےھ فرؔعون کے حکم کے مطُابق اُنکو گاڑیاں دیں اور زادِ راہ بھی دِیا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور اُس نے اُن میں سے ہر ایک کو ایک ایک جوڑا کپڑا دیا لیکن بینؔمین کو چاندی کے تین سَو سکےّ اور پانچ چوڑے کپڑے دِئے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اپنے باپ کے لئِے اُس نے یہ چیزیں بھیجیں یعنی دس گدھے جو مؔصر کی اچھی چیزوں سے لدے ہوئے تھے اور دس گدھیاں جو اُسکے باپ کے راستہ کے لئے غلہّ اور روٹی اور زادِ راہ سے لدی ہُؤئی تھیں۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "چنانچہ اُس نے اپنے بھائیوں کو روانہ کیا اور وہ چل پڑے اور اُس نے اُن سے کہا دیکھنا ! کہیں راستہ میں تم جھگڑا نہ کرنا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور وہ مؔصر سے روانہ ہوئے اور ملک کنعان میں اپنے باپ یعقؔوب کے پاس پہنچے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور اُس سے کہا یُوؔسف اب تک جیتا ہے اور وہی سارے ملک مؔصر کا حاکم ہے اور یعؔقوب کا دِل دھک سے رہ گیا کیونکہ اُس نے اُنکا یقین نہ کِیا ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "تب اُنہوں نے اُسے وہ سب باتیں جو یُوؔسف نے اُن سے کہی تھیں بتائیں اور جب اُنکے باپ یعؔقوب نے وہ گاڑیاں دیکھ لیں جو یُوؔسف نے اُسکے لانے کو بھیجی تھیں تب اُسکی جان میں جان آئی۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور اِؔسرئیل کہنے لگا یہ بس ہے کہ میرا بیٹا یُوؔسف اب تک جِیتا ہے ۔ میَں اپنے مرنے سے پیشتر جا کر اُسے دیکھ تو لوُنگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 46,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اِؔسرئیل اپنا سب کچُھ لیکر چلا اور بیرؔسبع میں آکر اپنے باپ اِؔضحاق کے خُدا کے لئِے قُربا نیاں گُذرانیں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور خُدا نے رات کو رویا میں اِؔسرئیل سے باتیں کیں اور کہا اَےیعؔقوب اَےیعؔقوب ! اُس نے جواب دِیا میَں حاضر ہوں۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اُس نے کہا میں خُدا تیرے باپ کا خُدا ہُؤں ۔ مصؔر میں جانے سے نہ ڈر کیونکہ میَں وہاں تجُھ سے ایک بڑی قَوم پَیدا کرُونگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "میَں تیرے ساتھ مؔصر کو جاؤنگااور پھر تجھے ضرور لوَٹا بھی لاؤنگا اور یُوؔسف اپنا ہاتھ تیری آنکھوں پر لگائیگا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب یعؔقوب بیر ؔسبع سے روانہ ہُؤا اور اِؔسرائیل کے بیٹے اپنے باپ یعؔقوب کو ااور اپے بال بچّوں اور اپنی بیویوں کو اُن گاڑیوں پر لے گئے جو فؔرعون نے اُنکے لانے کو بھیجی تھیں۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور وہ اپنے چوپایوں اور سارے مال و اسباب کو جو اُنہوں نے ملک کنعؔان میں جمع کیا تھا لیکر مصؔر میں آئے اور یعقؔوب کے ساتھ اُسکی ساری اَولاد تھی ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "وہ اپنے بیٹوں اور بیٹیوں اور پوتوں اور پوتیوں غرض اپنی کُل نسل کو اپنے ساتھ مصؔر میں لے آیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور یعؔقوب کے ساتھ جو اِسرائیلی یعنی اُسکےبیٹے وغیرہ مصَر میں آئے اُنکے نام یہ ہیں ۔ روُؔبن یعؔقوب کا پہلوٹھا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور بنی رُوؔبن یہ ہیں ۔ حؔنوک اور فلؔو اور حؔسرون اودکرؔمی۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور بنی شمعوؔن یہ ہیں۔ یموؔایل اور یمؔین اور اُؔہد اور ریکین اور صُحر اور ساؔؤل جو ایک کنعانی عورت سے پیدا ہو اتھا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور بنی لاؔوی یہ ہیں جؔیرسون اور قؔہات اور مؔراری۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور بنی یؔہوداہ یہ ہیں ؔعیر اور اوؔنان اور ؔسیلہ اور فؔارص اور زاؔرح ۔ اِن میں سے عؔیر اور اؔونان ملک کنعؔان میں مر چُکے تھے اور فاؔرص کے بیٹے یہ ہیں ۔ حؔصرون اور حؔمول ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور بنی اِشکار یہ ہیں ۔ تؔولع اور فُوؔوہ اور یؔوب اور سمؔرون ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور بنی زؔبولوُن یہ ہیں ۔ سرؔد اور اؔیلون اور ؔبجلی ایل ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "یہ سب یعؔقوب کے اُن بیٹوں کی اَولاد ہیں جو فؔدّان ارام میں لؔیاہ سے پیدا ہوٹے ۔ اِسی کے بطن سے اُسکی بیٹی دِؔینہ تھی۔ یہاں تک تو اُسکے سب بیٹے بیٹیوں کا شُمار تینتیس ہُوا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "بنی جؔدیہ ہیں صفیان اور حؔجیّ اور سُونی اور اؔصبان اور عؔیری اور اؔرودی اور اؔریلی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور بنی آشر یہ ہیں ۔ یمؔنہ اور اؔسواہ اور اؔسوی اور برؔیعاہ اور سِؔرہ اُنکی بہن اور بنی برؔیعاہ یہ ہیں ۔ حِؔبر اور ؔملکی ایل ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "یہ سب یعؔقوب کے اُن بیٹوں کی اولاد ہیں ۔ جو زؔلفہ لوَنڈی سے پیدا ہوئے جِسے لاؔبن نے اپنی بیٹی کو دِیا تھا۔ اُنکا شمار سولہ تھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور یعؔقوب کے بیٹے یُوؔسف اور بینؔمین راؔخل سے پیدا ہوئے تھے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یُوؔسف مصرؔ میں اؔون کے پُجاری فؔوطیفر ع کی بیٹی آسؔناتھ کےمُنسؔیّ اور افراؔئیم پیدا ہوئے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور بنی بینؔمین یہ ہیں۔ بالؔع اور بکر اور اشؔبیل اور جؔیرا اور نؔعمان اخی اور رؔوس مُفیمّؔ اور حُؔفیمّ اور اؔرد ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "یجہ سب یعؔقوب کے اُن بیٹوں کی اَولاد ہیں جو رؔاخل سے پیدا ہوئے ۔ یہ سب شُمار میں چَودہ تھے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور دان کے بیٹے کا نام حؔشیم تھا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور بنی نفتاؔلی یہ ہیں۔ یحؔصی ایل اور جُؔونی اور یؔصر اور سؔلیم ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "یہ سب یؔعقوب کے اُن بیٹوں کی اَولاد ہیں جو بلؔہاہ لوَنڈی سے پیدا ہوئے جِسے لاؔبن نے اپنی بیٹی رؔاخل کو دِیا تھا ۔ اِنکا شمار سات تھا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "یعؔقوب کے صُلب سے جو لوگ پیدا ہوٹے اور اُسکے ساتھ مؔصر میں آئے وہ اُسکی بہوؤں کو چھوڑ کر شُمار میں چھیاسٹھ تھے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "یوُؔسف کے دو بیٹے تھے جو مؔصر میں آئے وہ سب ملکر شترّ ہُؤئے۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور اُس نے یہؔوداہ کو اپنے سے آگے یُوؔسف کے پاس بھیجا تاکہ وہ اُسے جؔشن کا راستہ دِکھائے اور وہ ؔجشن کے علاقہ میں آئے۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور یُوؔسف اپنا رتھ تیار کروا کے اپنے باپ اِسؔرائیل کے اِستقبال کے لئے جشؔن کو گیا اور اُسکے پاس جا کر اُسکے گلے سے لِپٹ گیا اور وہیں لِپٹا ہوا دیر تک روتا رہا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "تب اؔسرائیل نےیُوؔسف سے کہا اب چاہے میں مر جاؤں ۔ کیونکہ تیرا مُنہ دیکھ چُکا کہ تُو ابھی جیتا ہے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور یؔوسف نے اپنے بھائیوں سے اور اپنے باپ کے گھرانے سے کہا میں ابھی جا کر فرؔعون کو خبر کر دُونگا اور اُس سے کہدونگا کہ میرے بھائی اور میرے باپ کے گھرانے کے لوگ جو ملک کنعان میں تھے میرے پاس آگئے ہیں ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور وہ چَوپان ہیں کیونکہ برابر چَوپایوں کو پالتے آئے ہیں اور وہ اپنی بھیڑ بکریاں اور گائے بیل اور جو کچھ اُنکا ہے سب لے آئےہیں ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "پس جب فرؔعون تمکو بُلا کر پُوچھے کہ تمہارا پیشہ کیا ہے ؟",
                    },
                    {
                        "verse_num": 34,
                        "text": "تو تُم یہ کہنا کہ تیرے خادِم ہم بھی اور ہمارے باپ دادا بھی لڑکپن سے لیکر آج تک چَوپائے پالتے آئے ہیں ۔ تب تُم جشن کے علاقہ میں رہ سکو گے اِسلئے کہ مصریوں کو چَوپانوں سے نفرت ہے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 47,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب یُوؔسف نے آکر فرؔعون کو خبر دی کہ میرا باپ اور میرے بھائی اور اُنکی بھیڑ بکریاں اور گائے بیل اور اُنکا سارا مال ول متاع ملک کنؔعان سے آگیا ہے اور ابھی تو وہ سب جؔشن کے علاقہ میں ہیں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "پھر اُس نے اپنے بھائیوں میں سے پانچ کو اپنے ساتھ لیا اور اُنکو فرؔعون کے سامنے حاضر کیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "فرؔعون نےاُسکے بھائیوں سے پُوچھا تُمہارا پیشہ کیا ہے ؟ اُنہوں نے فرؔعون سے کہا تیرے خادم چَوپان ہیں جَیسے ہمارے باپ دادا تھے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "پھر اُنہوں نے فرؔعون سے کہا کہ ہم اِس ملک میں مسافر انہ طور پر رہنے آئے ہیں کیونکہ ملک کنؔعان میں سخت کال ہونے کی وجہ سے وہاں تیرے خادموں کے چوپایوں کے لئے چرائی نہیں رہی ۔ سو کرم کرکے اپنے خادِموں کو جؔشن کے علاقہ میں رہنے دے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب فرؔعون نے یُوؔسف سے کہا کہ تیرا باپ اور تیرے بھائی تیرے پاس آگئے ہیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "مصرؔ کا ملک تیرے آگے پڑا ہے ۔ یہاں کے اچھےّ علاقہ میں اپنے باپ اور بھائیوں کو بسا دے یعنی جؔشن ہی کے علاقہ میں اُنکو رہنے دے اور اگر تیری دانِست میں اُن میں ہوشیار آدمی بھی ہوں تو اُنکو میرے چَوپایوں پر مقرر کر دے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "یُوؔسف اپنے باپ یعؔقوب کو اندر لایا اور اُسے فرؔعون سامنے حٖاضر کیا اور یعقؔوب نے فرؔعون کو دُعا دی ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور فرؔعون نے یعؔقوب سے پوچھا کہ تیری عمر کتنے سال کی ہے ۔ ؟",
                    },
                    {
                        "verse_num": 9,
                        "text": "یعؔقوب نے فرؔعون سے کہاکہ میری مسافرت کے برس ایک سو تیس ہیں ۔میری زندگی کے ایام تھوڑے اور دُکھ سے بھرے ہُوئے رہے اور ابھی یہ اُتنے ہوئے بھی نہیں ہیں جِتنے میرے باپ دادا کی زندگی کے ایام تھوڑے اور دُکھ سے بھرے ہوئے رہے اور بھی اتنے ہوئے بھی نہیں ہیں جِتنے میرے باپ دادا کی زندگی کے ایام اُنکے دَور مساُفرت میں ہوئے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور یعقوب فرؔعون کو دُعا دیکراُسکے پاس سے چلا گیا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور یُوؔسف نے اپنے باپ اور بھائیوں کو بسا دیا اور فرؔعون کے حکم کے مطُابق رعؔمسیس کے علاقہ کو جو ملک مصؔر کا نہایت زرخیز خِطہّ ہے اُنکی جاگیر ٹھہرایا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور یُوؔسف اپنے باپ اور اپنے بھائیوں اور اپنے باپ کے گھر کے سب آدمیوں کی پرورِش ایک ایک کے خاندان کی ضرورت کے مطُابق اناج سے کرنے لگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اُس سارے ملک میں کھانے کو کچھ نہ رہا کیونکہ کال اِیسا سخت تھا کہ ملک مصر اور ملک کنعؔان دونوں کال کے سبب سے تباہ ہو گئے تھے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور جتنا روپیہ ملک مؔصر اور ملک کنؔعان میں تھا وہ سب یُوؔسف نے اُس غلہّ کے بدلے جسے لوگ خریدتے تھے لے لیکر جمع کر لیا اور سب روپے کو اُس نے فرؔعون کے محل میں پہنچا دیا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جب وہ سارا روپیہ جو مصرؔ اور کنعاؔن کے ملکوں میں تھا خرچ ہوگیا تو مصری یُوؔسف کے پاس آکر کہنے لگے ہمکو اناج دے کیونکہ روپیہ تو ہمارے پاس رہا نہیں ہم تیرے وہتے ہوئے کیوں مریں ۔؟",
                    },
                    {
                        "verse_num": 16,
                        "text": "یُوؔسف نے کہا کہ اگر روپیہ نہیں ہے تو اپنے چوپائے دو اور میں تمہارے چوپایوں کے بدلے تمکو اناج دُونگا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "سو وہ اپنے چوپائے یوُؔسف کے پاس لانے لگے اور یُوؔسف گھوڑوں اور بھیڑ بکریوں اور گائے بَیلوں اور گدھوں کے بدلے اُنکو اناج دینے لگا اور پُورے سال بھر اُنکو سب چَوپایوں کے بدلے اناج کھلایا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "جب یہ سال گُذر گیا تو وہ دُوسرے سال اُسکے پاس آکر کہنے لگے کہ اِس میں ہم اپنے خُداوند سے کچھ نہیں چھپاتے کہ ہمارا سارا روپیہ خرچ ہو چکا اور ہمارے چَوپایوں کے گلوں کا مالک بھی ہمارا خُداوند ہوگیا ہے ۔ اور ہمارا خُداوند دیکھ چُکا ہے کہ اب ہمارے جسم اور ہماری زمین کے سوا کچھ باقی نہیں۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "پس ایسا کیوں ہو کہ تیرے دیکھتے دیکھتے ہم بھی مریں اور ہماری زمین بھی اُجڑ جائے؟ سو تو ہم کو ہماری زمین کو اناج کے بدلے خریدلے کہ ہم فرؔعون کے غُلام بن جائیں اور ہماری زمین کا مالک بھی وہی ہو جائے اور ہمکو بیج دے تاکہ ہم ہلاک نہ ہوں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یُوؔسف نے مؔصر کی ساری زمین فؔرعون کے نام پر خریدلی کیونکہ کال سے تنک آکر مصریوں میں سے ہر شخص نے اپنا کھیت بیچ ڈالا ۔ سو ساری زمین فرؔعون کی ہو گئی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور مصر کے ایک سرے سے لیکر دُوسرے سِرے تیک جو لوگ رہتے تھے اُنکواُس نے شہروں میں بسایا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "لیکن پُجاریوں کو رسد مِلتی تھی ۔ سو وہ اپنی اپنی رسد جو فرؔعون اُنکو دیتا تھا کھاتے تھے اِسلئے اُنہوںنے نے اپنی زمین نہ بیچی ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب یُوؔسف نے وہان کے لوگوں سے کہا کہ دیکھو میَں نے آج کے دن تمکو اور تمہاری زمین کو فرؔعون کے نام پر خرید لیا ہے ۔ سو تُم اپنے لئے یہاں سے بیج لو اور کھیت بو ڈالو۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور فصل پر پانچواں حصہّ فرؔعون کو دیدینا اور باقی چار تُمہارے رہے تاکہ کھیتی کے لئے بیج کے بھی کام آئیں اور تمہارے اور تمہارے گھر کے آدمیوں اور تمہارے بال بچوّں کے لئے کھانے کو بھی ہوں ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اُنہوں نے کہا کہ تُو نے ہماری جان بچائی ہے ۔ ہم پر ہمارے خُداوند کے کرم کی نظر رہے اور ہم فرؔعون کے غُلام بن کر رہینگے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور یُوؔسف نے یہ آئین جو آج تک ہے مصرؔ کی زمین کے لئے ٹھہرایا کہ فرؔعون پیداوار کا پانچواں حصہ لیا کرے۔ سو فقط پُجاریوں کی زمین اَیسی تھی جو فرؔعون کی نہ ہوئی ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اِسرائیلی ملک مصؔر میں جشن کے علاقہ میں رہتے تھے اور اُنہوں نے اپنی جایدادیں کھڑی کر لیں اور وہ بڑے اور بہت زیادہ ہوگئے۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور یعؔقوب ملک مصر میں سترہ برس اور جیا ۔ سو یعؔقوب کی کل عمر ایک سو سینتالیس برس کی ہوئی ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور اسؔرائیل کے مرنے کا وقت نزدیک آیا ۔ تب اپس نے اپنے بیٹے یُوؔسف کو بُلا کر اُس سے کہا اگر مجھُ پر تیرے کرم کی نظر ہے تو اپنا ہاتھ میری ران کے نیچے رکھ اور دیکھ ! مہربانی اور صداقت سے میرے ساتھ پیش آنا۔ مجھُ کو مصر میں دفن نہ کرنا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "بلکہ جب میَں اپنے باپ دادا کے ساتھ سو جاؤں تو مجھےُ مصر سے لیجا کر اُنکے قبرستان میں دفن کرنا ۔ اُس نے کہکا جواب دیا جَیسا تُونے کہا ہے میں ویسا ہی کرُونگا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُس نے کہا کہ تُو مجھُ سے قسم کھا اور اُس نے اپس سے قسم کھائی تب اِسرائیل اپنے بستر پر سرہانے کی طرف سِجدہ میں ہوگیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 48,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اِن باتوں کے بعد یوُں ہوا کہ کشی نے یُوؔسف سے کہا تیرا باپ بیمار ہے ۔ سو وہ اپنے دونوں بیٹوں منسؔیّ اور افرؔائیم کو ساتھ لیکر چلا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور یعؔقوب سے کہا گیا کہ تیرا بیٹا یوُؔسف تیرے پاس آرہا ہے اور اِؔسرائیل اپنے کو سنبھال کر پلنگ پر بیٹھ گیا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور یعؔقوب نے یُوؔسف سے کہاکہ خُدایِ قادر مطُلق مجھے لوُزمیں جو ملک کنعؔان میں ہے دِکھائی دِیا اور مجھےُ برکت دی ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُس نے مجھُ سے کہا میں تجھے برومند کرونگا اور بڑھاؤنگا اور تجھُ سے قوموں کا ایک زُمرہ پیدا کرونگا اور تیرے بعد یہ زمین تیری نسل کو دُونگا تاکہ یہ اُنکی دائمی ملکیت ہو جائے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "سو تیرے دونوں بیٹے جو ملک مصر میں میرے آنے سے پہلے پیدا ہوئے میرے ہیں یعنی رُوبؔن اور شمؔعون کی طرح اؔفرائیم اور منؔسیّ بھی میرے ہی ہونگے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور جو اَولاد اب اُنکے بعد تجھُ سے ہوگی وہ تیری ٹھہریگی پر اپنی میراث میں اپنے بھائیوں کے نام سے وہ لوگ نامرد ہونگے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور میَں جب فؔدّان سے آتا تھا تو رؔاخل نے راستہ ہی میں جب اِفؔرات تھوڑیدُور رہ گیا تھا میرے سامنے ملک کنعؔان میں وفات پائی اور میَں نے اُسے وہیں اِفرؔات کے راستہ میں دفن کیا۔ بَیت الحم وہی ہے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پِھر اِؔسرائیل نے یُوؔسف کے بیٹوں کو دیکھ کر پُوچھا یہ کَون ہیں؟",
                    },
                    {
                        "verse_num": 9,
                        "text": "یُوؔسف نے اپنے باپ سے کہا یہ میرے بیٹے ہیں جو خُدا نے مُجھے یہاں دِئے ہیں ۔ اُس نے کہا اُنکو ذرا میرے پاس لا۔ میَں اُنکو برکت دُونگا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "لیکن اِؔسرائیل کی آنکھیں بڑھاپے کے سبب سے دھندلا گئی تھیں اور اُسے دِکھائی نہیں دیتا تھا ۔ سو یُوؔسف اُنکو اُسکے نزدیک لے آیا ۔ تب اُس نے اُنکو چوم کر گلے لگا لِیا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اِسؔرائیل نے یُوؔسف سے کہا مجھےُ خیال بھی نہ تھا کہ تیرا مُنہ دیکھونگا۔لیکن خُدا نے تیری اَولاد بھی مجھےُ دِکھائی ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور یُوؔسف اُنکو اپنے گھُٹنوں کے بیچ سے ہٹا کر مُنہ کے بل زمین تک جُھکا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور یُوؔسف اُن دونوں کو لیکر یعنی افؔرائیم اکو اپنے دہنتے ہاتھ سے اِسؔرائیل کے بائیں ہاتھ کے مُقابل اور منسؔیّ کو اپنے بائیں ہاتھ کے مُقابل اور منُسؔیّ کو اپنے بائیں ہاتھ سے اِسرؔائیل کے دہنے ہاتھ کے مُقابل کر کے اُنکو اُسکے نزدیک لایا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اؔسرائیل نے اپنا دہنا ہاتھ بڑھا کر اؔفراہیم کے سر پر جو چھوٹا تھا اور بایاں ہاتھ منؔسیّ کے سر پر رکھ دیا۔ اُس نے جان بوُجھ کر اپنے ہاتھ یُوں رکھےّ کیونکہ پہلوٹھا تو منؔسیّ ہی تھا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اُس نے یُوؔسف کو برکت دی اور کہا کہ خُدا جِسکے سامنے میرے باپ ابرؔہام اور اِؔضحاق نے اپنا دَور پورا کیا۔ وہ خُدا جِس نے ساری عُمر آج کے دن تک میری پاسبانی کی۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ فرشتہ جس نے مجھےُ سب بلاؤں سے بچایا اِن لڑکوں کو برکت دے اور جو میرا اور میرے باپ دادا ابرؔہام اور اِؔضحاق کا نام ہے اُسی سے یہ نامزد ہوں اور زمین پر نہایت کثرت سے بڑھ جائیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور یُوؔسف یہ دیکھ کر کہ اُسکے باپ نے اپنا دہنا ہاتھ اِفراؔئیم کے سر پر رکھاّ ناخُوش ہُوا اور اُس نے اپنے باپ کا ہاتھ تھام لیا تا کہ اُسے اِفؔرائیم کے سر پر سے ہٹا کر منؔسیّ کے سر پر رکھے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور یُوؔسف نے اپنے باپ سے کہا کہ اے میرے باپ اَیسا نہ کر کیونکہ پہلوٹھا یہ ہے اپنا دہنا ہاتھ اِسکے سر پر رکھ ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اُسکے باپ نے نہ مانا اور کہا اَے میرے بیٹے ! مجھےُ خُوب معلوم ہے ۔ اِس سے بھی ایک گروہ پیدا ہوگی اور یہ بھی بزرگ ہوگا اور اُسکی نسل سے بہت سی قَومیں ہونگی ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اُس نے اُنکو اُس دِن برکت بخشی اور کہا کہ اسرؔائیلی تیرا نام لے لیکر یُوں دُعا دیا کرینگے کہ خُدا تجھُ کو اِؔفرائیم اور منؔسیّ کی مانند اقبالمند کرے!۔ سو اُس نے اِفؔرائیم کو منؔسیّ پر فضیلت دی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اسرؔاؑیل نے یُوؔسف سے ککہامیَں تو مرتا ہُوں لیکن خُدا تمہارے ساتھ ہوگا اور تمکو پھر تمہارے باپ دادا کے ملک لیجائیگا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور میَں تجھےُ تیرے بھائیوں سے زیداہ ایک حِصہّ جو میَں نے اموریوں کے ہاتھ سے اپنی تلوار اور کمان سے لیا دیتا ہُوں۔",
                    },
                    
                ],
            },
            {
                "chap_num": 49,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یعؔقوب نھے اپنے بیٹوں کو یہ کہکر بُلوایا کہ تُم سب جمع ہو جاؤ تاکہ میں تمکو بتاؤں کہ آخری دِنوں میں تُم پر کیا کیا گُذریگا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اِے یعؔقوب کے بیٹو جمع ہو کر سُنو۔ اور اپنے باپ اِؔسرائیل کی طرف کان لگاؤ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اِے رُوؔبن ! تو میرا پہلوٹھا میری قُوت اور میری شہزوری کا پہلا پھل ہے ۔ تو میرے رُعب کی اور میری طاقت کی شان ہے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تو پانی کی طرح بے ثبات ہے اِسلئے مجھےُ فضیلت نہیں ملیگی۔ کیونکہ تُو اپنے باپ کے بستر پر چڑھا ۔ تُو نے اُسے نجس کیا ۔ رُوؔبن میرے بچھونے پر چڑھ گیا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "شؔمعون اور لاؔوی تو بھا ئی بھائی ہیں اُنکی تلواریں ظُلم کے ہتھیار ہیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اَے میری جان ! اُنکے مشورہ میں شریک نہ ہو ۔ اَے میری بُزرگی! اُنکی مجلس میں شامل نہ ہو ۔ کیونکہ اُنہوں نے اپنے غضب میں ایک مرد کو قتل کیا۔ اور اپنی خودرائی سے بیلوں کو نچیں کاٹیں ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "لعنت اُنکے غضب پر کیونکہ وہ تُند تھا اور اُنکے قہر پر کیونکہ وہ سخت تھا ۔ میَں اُنہیں یعقوب میں الگ الگ اور اِسؔرائیل میں پراگندہ کردُونگا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اَے میرے یُہوؔداہ ! تیرے بھائی تیری مدح کرینگے تیرا ہاتھ تیرے دُشمنوں کی گردن پر ہوگا۔ تیرے باپ کی اَولاد تیرے آگے رنگوُں ہوگی۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "یُہوداہ شیر ببر کا بچہّ ہے ۔ اَے میرے بیٹے ! تُو شکار مار کر چل دیا ہے ۔ وہ شیر ببر بلکہ شیرنی کی طرح دَبک کر بیٹھ گیا ۔ کَون اُسے چھیڑے ؟",
                    },
                    {
                        "verse_num": 10,
                        "text": "یُؔہوداہ سے سلطنت نہیں چھوٹیگی اور نہ اُسکی نسل سے حکومت کا عصا موقوف ہوگا ۔ جب تک شیلؔوہ نہ آئے۔ اور قَومیں اُسکی مُطیع ہونگی۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "وہ اپنا جوان گدھا انگوُر کے درخت سے اوراپنی گدھی کا بچہّ اعلےٰ درجہ کے انگوُر کے درخت سے باندھ کر یگا۔ اور وہ اپنا لباس مَے میں اور اپنی پوشاک آپ انگو میں دھویا کریگا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اُسکی آنکھیں مَے کے سبب سے لال اور اُسکے دانت دُودھ کی وجہ سے سفید رہا کرینگے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "زبُؔولون سمندر کے کنارے بسیگا اور جہازوں کے لئے بند کا کام دیگا۔ اور اُسکی حد صَیدؔا تک پَھیلی ہوگی۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اِشکار مضوبط گدھا ہے ۔ جو دوبھیڑسالوں کے درمیان بَیٹھا ہے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اُس نے ایک اچھیّ آرامگاہ اور خُوشنما زمین کو دیکھ کر اپنا کندھا بوجھ اُٹھانے کو جُھکایا اور بیگار میں غُلام کی طرح کام کرنے لگا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "دؔان اِؔسرائیل کے قبیلوں میں سے ایک کی مانِند اپنے لوگوں کا اِنصاف کریگا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "دان راستے کا سانپ ہے ۔ وہ راہ گزر کا افعی ہے جو گھوڑے کے عقب کو َایسا ڈستا ہے کہ اُسکا سوار پچھاڑ کھا کر گِر پڑتا ہے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اَے خُداوند ! میں تیری نجات کی راہ دیکھتا آیا ہوں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "جؔد پر ایک فَوج حملہ کریگی پر وہ اُسکے دُنبالہ پر چھاپا ماریگا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "آشؔر نفیس اناج پیدا کیا کریگا اور بادشاہوں کے لائق لذیذ اشیا مہیُا کریگا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "نفتاؔلی اَیسا ہے جیسے چھوٹی ہُوئی ہرنی ۔ وہ میٹھی میٹھی باتیں کرتا ہے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "یُوؔسف ایک پھلدار پَودا ہے ۔ اَیسا پھلدار پَودا جو پانی کے چشمہ کے پاس لگا ہُوا ہو اور اُسکی شاخیں دیوار پر پَھیل گئی ہوں ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تِیراندازوں نے اُسے بہت چھیڑا اور مارا اور ستایا ہے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "لیکن اُسکی کمان مضُبوط رہی اور اُسکے ہاتھوں اور بازؤوں نے یعؔقوب کے قادر کے ہاتھ سے قُوت پائی ۔ (وہیں سے وہ چَوپان اُٹھا ہے جو اَؔسرائیل کی چٹان ہے۔ )",
                    },
                    {
                        "verse_num": 25,
                        "text": "یہ تیرے باپ کے خُدا کاکلام ہے جو تیری مدد کریگا۔اُسی قادرِ مطُلق کا کام جو اُوپر سے آسمان کی برکتیں اور نیچے سے گہرے سمُندر کی برکتیں اور چھاتیوں اور رَحموں کی برکتیں عطا کریگا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تیرے باپ کی برکتیں میرے باپ دادا کی برکتوں سے کہیں زیادہ ہیں اورقدیُم پہاڑوں کی اِنتہا تک پُہنچی ہیں ۔وہ یُوؔسف کے سر بلکہ اُسکے سر کی چاندی پر جو اپنے بھائیوں سے جُدا ہُوا نازل ہونگی۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "بنیمؔین پھاڑنے والا بھیڑیا ہے ۔ وہ صُبح کو شکار کھائیگا اور شام کو لوُٹ کا مال بانٹیگا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اِؔسرائیل کے بارہ قبیلے یہی ہیں اور اُنکے باپ نے جو جو باتیں کہکر اُنکو برکت دی وہ بھی یہی ہیں۔ ہر ایک کو اپس کی برکت کے موافِق اُس نے برکت دی ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "پھر اُس نے اُنکو حُکم کیا اور کہا کہ میَں اپنے لوگو ں میں شامِل ہونے پر ہُوں مجھےُ میرے باپ دادا کے پاس اُس مغارہ میں جو عؔفِرون حِتیّ کے کھیت میں ہے دفن کرنا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "یعنی اپس مغارہ میں جو ملک کنعاؔن میں ممرے کے سامنے مکفؔیلہ کے کھیت میں ہے جِسے ابؔرہام نے کھیت سمیت عِؔفرون حؔتیّ سے مول لیا تھا تا کہ گورِستان کے لئے وہ اُسکی ملکیت بن جائے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "وہاں اُنہوں ے ابرؔہام کو اور اُسکی بیوی ساؔرہ کو دفن کیا ۔ وہیں اُنہوں نے اِضؔحاق اور اُسکی بیوی رؔبقہ کو دفن کیا اور وہیں میَں نے بھی لیؔاہ کو دفن کیا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "یعنی اُسی کھیت کے مغارہ میں جو بنی حِؔت سے خریدا تھا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور جب یعؔقوب اپنے بیٹوں کو وصِیت کر چُکا تو اُس نے اپنے پاؤں بچھونے پر سمیٹ لئِے اور دم چھوڑ دِیا اور اپنے لوگوں میں جاملا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 50,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب یُوؔسف اپنے باپ کے مُنہ سے لپٹ کر اُس پر رویا اور اُسکو چُوما ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور یُوؔسف نے اُن طبیبوں کو جو اُسکے نوکر گھے اپنے باپ کی لاش میں خوشُبو بھرنے کا حُکم دیا۔ سو طبیبوں نے اِؔسرائیل کی لاش میں خُوشبو بھری ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُسکے چالیس دِن پورے ہُوئے کیونکہ خُوشبو بھرنے میں اِتنے ہی دن لگتے ہیں اور مصری اُسکے لئے ستّر دِن تک ماتم کرتے رہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور جب ماتم کے دِن گذر گئے تو یُوؔسف نے فرؔعون کے گھر کے لوگوں سے کہا اگر مجھُ پر تُمہارے کرم کی نظر ہے تو فرؔعون سے ذرا عرض کردو۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "کہ میرے باپ نے مجھُ سے قسم لیکر کہا ہے کہ میَں تو مرتا ہُوں ۔ تو مجھُ کو میری گور میں جو میَں نے ملک کنعؔان میں اپنے لئے کھدوائی ہے دفن کرنا اِسلئے ذرا مجھےُ اجازت دے کہ میَں وہاں جا کر اپنے باپ کو دفن کروں اور میَں لوٹ کر آجاؤنگا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "فرؔعون نے کہا کہ جا اور اپنے باپ کو جَیسے اُس نے تجھُ سے قسم لی ہے دفن کر۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "سو یُوؔسف اپنے باپ کو دفن کرنے چلا اور فرؔعون کے سب خادِم اور اُسکے گھر کے مشائخ اور ملک مصر کے سب مشائخ ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور یُوؔسف کے گھر کے سب لوگ اور اُسکے بھائی اور اُسکے باپ کے گھر کے آدمی اُسکے ساتھ گئے ۔ وہ صِرف اپنے بال بچےّ اور بھیڑ بکریاں اور گائے بَیل جؔشن کے علاقہ میں چھوڑ گئے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اُسکے ساتھ رتھ اور سوار بھی گئے ۔ سو ایک بڑا انبوہ اُسکے ساتھ تھا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور وہ اؔتد کے کھلیہان پر جو یرؔدن کے پار ہے پہنچے اور وہاں اُنہوں نے بلند اور دِلسوز آواز سے نوحہ کیا اور یُوؔسف نے اپنے باپ کے لئے سات دِن تک ماتم کرایا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور جب اُس ملک کے باشندوں یعنی کنعانیوں نے اؔتد میں کھلیہان پر اِس طرح کا ماتم دیکھا تو کہنے لگے کہ مصریوں کا یہ بڑا دردناک ماتم ہے۔ سو وہ جگہ اؔبیل مصریم کہلائی اور وہ یرؔدن کے پار ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور یعؔقوب کے بیٹوں نے جَیسا اُس نے اُنکو حکم کیا تھا وَیسا ہی اُسکے لئے کِیا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "کیونکہ اُنہوں نے اُسے ملک کنعان میں لیجا کر ممرؔے کے سامنے مکؔفیلہ کے کھیت کے مغارہ میں جِسے ابرؔہام نے عِفرؔون حِتؔیّ سے خرید کر گورِستان کے لئے اپنی ملکیت بنالیا تھا دفن کیا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اوریوُؔسف اپنے باپ کو دفن کر کے اپنے بھائیوں اور اپنکے ساتھ جو اُسکے باپ کو دفن کرنے کے لئِے اُسکے ساتھ گئے تھے مصر کو لَوٹا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور یُوؔسف کے بھائی یہ دیکھ کر کہ اُنکا باپ مر گیا کہنے لگے کہ یوُؔسف شاید ہم سے دُشمنی کرے اور ساری بدی کا جو ہم نے اُس سے کی ہے پُورا بدلہ لے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "سو اُنہوں نے یُوؔسف کو یہ کہلا بھیجا کہ تیرے باپ نے اپنے مرنے سے آگے یہ حُکم کیاتھا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "کہ تُم یُوؔسف سے کہنا کہ اپنے بھائیوں کی خطا اور اُنکا گناہ اب بخش دے کیونکہ اُنہوں نے تجھُ سے بدی کی ۔ سو اب تُو اپنے باپ کے خُدا کے بندوں کی خطا بخش دے اور یُوؔسف اُنکی یہ باتیں سُن کر رویا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اُسکے بھائیوں نے خود بھی اُسکے سامنے جاکر اپنے سر ٹیک دِئے اور کہا دیکھ ہم تیرے خادم ہیں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "یُوؔسف نے اُن سے کہا مت ڈرو۔ کیا میں خُدا کی جگہ پر ہُوں ؟ ",
                    },
                    {
                        "verse_num": 20,
                        "text": "تُم نے تو مُجھ سے بدی کرنے کا ا،رادہ کیا تھا لیکن خُدا نے اُسی سے نیکی کا قصد کیا تاکہ بہت سے لوگوں کی جان بچائے چنانچہ آج کے دِن اَیسا ہی ہو رہا ہے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اِسلئے تُم مت ڈرو۔ میَں تُمہاری اور تُمہارے بال بچوّں کی پر ورِش کرتا رہُونگا ۔ یُوں اُس نے اپنی مُلائیم باتوں سے اُنکی خاطرِ جمع کی۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور یُوؔسف اور اُسکے باپ کے گھر کے لوگ مصر میں رہے اور یُوؔسف ایک سَو دس برس تک جِیتا رہا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور یُوؔسف نے افؔرائیم کی اَولاد تیسری پُشت تک دیکھی اور مُنسؔیّ کے بیٹے مکیر کی اَولاد کو بھی یُوؔسف نے اپنے گھٹنوں پر کھِلایا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور یُوؔسف نھے اپنے بھائیوں سے کہا میَں مرتا ہوں اور خُدا یقیناً تُمکو یاد کریگا اور تُمکو اس ملک سے نکال کر اُس ملک میں پہنچائیگا جِسکے دینے کی قسم اُس نے ابرؔہام اور اِضؔحاق اور یعؔقوب سے کھائی تھی۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور یُوؔسف نے بنی اِسؔرائیل سے قسم لیکر کہا خُدا یقیناً تُمکو یاد کریگا۔ سو تُم ضرور ہی میری ہڈیوں کو یہا ں سے لیجانا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور یُوؔسف نے ایک سو دس برس کا ہو کر وفات پائی اور اُنہوں نے اُسکی لاش میں خُوشبو بھری اور اُسے مصؔر ہی میں تابوت میں رکھاّ۔",
                    },
                    
                ],
            },

        ],
    },
    {
        "book_id": 2,
        "book_title": "خُروج",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اسرائیل کے بیٹوں کے نام جو اپنے اپنے گھرانے کولے کر یعقوب کے ساتھ مصر میں آے یہ ہے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "رُوبن شمعون لاوی یہوداہ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اِشکار۔زبولُون۔بنیمین ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "دان۔نفتالی۔جد۔آشر۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور سب جانیں جو یقوب کے صُلب سے پیدا ہوئیں ستر تھیں اور یوسف تو مصر میں پہلے ہی سے تھا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور یوسف اور اُس کے سب بھا ئی اور اُس پُشت کے سب لوگ مر مٹے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اسرائیل کی اولاد برومنداور کثیرالتعداد اورفراوان اور نہایت زورآور ہو گئی اور وہ مُلک اُن سے بھر گیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب مصر میں ایک نیا بادشاہ ہوا جو یوسف کو نہیں جانتا تھا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اُس نے اپنی قوم کے لوگوں سے کہا دیکھو اسرائیلی ہم سے زیادہ اور قوی ہو گئے ہیں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "سو آو ہم اُنکے ساتھ حکمت سے پیش آئیں تا نہ ہو کہ جب وہ اور زیادہ ہو جائیں اور اُس وقت جنگ چھڑ جائے تو وہ ہمارے دشمنوں سے مل کر ہم سے لڑیں اور مُلک سے نکل جائیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اس لیے اُنہوں نے اُن پر بیگار لینے والے مقرر کیے جو اُن سے سخت کام لے کر اُن کو ستائیں ۔سو اُنہوں نے فرعون کے لئے ذخیرہ کے شہر پتوم اور رعمسیس بنائے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پر اُنہوں نے جتنا اُنکو ستایا وہ اُتنا ہی زیادہ بڑھتے اور پھیلتے گئے ۔اس لئے وہ لوگ بنی اسرائیل کی طرف سے فکر مند ہو گئے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور مصریوں نے بنی اسرائیل پر تشدد کر کے اُن سے کام کرایا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اُنہوں نے اُن سے سخت محنت سے گارا اور اینٹ بنوا کر اور کھیت میں ہر قسم کی خدمت لے لےکر اُنکی زندگی تلخ کی ۔اُنکی سب خدمتیں جو وہ اُن سے کراتے تھے تشدد کی تھیں ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب مصر کے بادشاہ نے عبرانی دایئوں سے جن میں ایک کا نام سفرہ اور دوسری کا فوعہ تھا باتیں کیں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور کہا کہ جب عبرانی عورتوں کے تُم بچہ جناو اور اُنکو پتھرکی بیٹھکوںپر بیٹھی دیکھوتو اگر بیٹاہو تو اُسے ما ر ڈالنا اور اگر بیٹی ہو تو وہ جیتی ر ہے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "لیکن وہ دائیاں خدا سے ڈرتی تھیں ۔ سو اُنہوں نے مصر کے بادشاہ کا حکم نہ مانا بلکہ لڑکوں کو جیتا چھوڑدیتی تھیں ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "پھر مصر کے بادشاہ نے دائیوں کو بلُوا کر اُن سے کہا تم نے ایسا کیوں کیا کہ لڑکوں کو جیتا رہنے دیا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "دایئوں نے فرعون سے کہا عبرانی عورتیں مصری عورتوں کی طرح نہیں ہیں ۔وہ ایسی مضبوط ہو تی ہیں کہ دایئوں کے پہنچنے سے پہلے ہی جن کر فارغ ہو جا تی ہیں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "پس خدا نے دائیوں کا بھلا کیا اور لوگ بڑھے اور بُہت زبردست ہو گئے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اس سبب سے کہ دائیاں خدا سے ڈریں اُس نے اُنکے گھر آباد کر دیے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اورفرعون نے اپنی قوم کے سب لوگوں کو تاکید ا کہا کہ اُن میں جو بیٹا پیدا ہو تم اُسے دریا ماین ڈال دینا اورجوبیٹی ہو اُسے جیتی چھوڑنا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 2,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور لادی کے گھرانے کے ایک شخص نے جا کر لاوی کی نسل کی ایک عورت سے بیاہ کیا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "وہ عورت حاملہ ہو ئی اور اُسکے بیٹا ہوا اُس نے یہ دیکھ کر کہ بچہ خُوبصورت ہے تین مہینے تک اُسے چھپا کر رکھا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور جب اُسے اور زیادہ چھپا نہ سکی تو اُس نے سر کنڈوں کا ایک ٹوکرا لیا اور اُس پر چکنی مٹی اور رال لگا کر لڑکے کو اُس میں رکھا اور اُسے دریا کے کنارے جھاو میں چھوڑ آئی ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُسکی بہن دُور کھٹری رہی تاکہ دیکھے کہ اُسکے ساتھ کیا ہو تا ہے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور فرعون کی بیٹی دریا پر غُسل کر نے آئی اور اُسکی سہیلیاں دریا کے کنا رے کنا رے ٹہلنے لگیں ۔تب اُس نے جھاو میں وہ ٹوکرا دیکھ کر اپنی سہیلی کو بھیجا کہ اُسے اُٹھا لائے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "جب اُس نے اُسے کھولا تو لڑکے کو دیکھا تو وہ بچہ رو رہا تھا ۔ اُسے اُس پر رحم آیا اور کہنے لگی یہ کیسی عبرانی کا بچہ ہے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب اُسکی بہن نے فرعون کی بیٹی سے کہا کیا میں جا کر عبرانی عورتوں میں سے ایک دائی تیرے پاس بُلا لاوں جو تیر ے لئے اس بچے کع دُودھ پلا یا کرے ؟",
                    },
                    {
                        "verse_num": 8,
                        "text": "فِرعون کی بیٹی نے اُسے کہا جا ۔وہ لڑکی جا کر اُس کی ماں کو بُلا لائی ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "فِرعون کی بیٹی نے اُسے کہا تو اِس بچے کو لے جا کر میرےلیے دُودھ پلا ۔ میں تُجھے تیری اُجرت دیا کرونگی ۔وہ عورت اُس بچے کو لے جا کر دُودھ پلانے لگی ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "جب بچہ کُچھ بڑا ہوا تو وہ اُسے فِرعون کی بیٹی کے پاس لے گئی اور وہ اُسکا بیٹا ٹھہرا اور اُس نے اُس کا نام موسیٰ یہ کہہ کر رکھا کہ میں نے اُسے پانی سے نکالا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اِتنے میں جب موسیٰ بڑا ہو تو باہر اپنے بھائیوں کے پاس گیا اور اُنکی مشقتوں پر اُسکی نظر پڑی اور اُس نے دیکھا کی ایک مصری اُسکے ایک عبر انی بھائی کو مار رہا ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پھر اُس نے اِدھر اُدھر نگا ہ کی اور جب دیکھا کہ وہاں کو ئی دُوسرا آدمی نہیں ہے تو اُس مصری کو جان سے مار کر اُسے ریت میں چھپا دیا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "پھر دُوسرے دن وہ باہر گیا اور دیکھا کہ وہ عبرانی آپس مین مار پیٹ کر رہے ہیں ۔ تب اُس نے اُسے جسکا قصور تھا کہا کہ تُو اپنے ساتھی کو کیوں مارتا ہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اُس نے کہا تجھے کس نے ہم پر حکم یا منصف مقرر کیا ؟کیا جس طرح تُو نے اُس مصر ی کو مار ڈالا مجھے بھی ما ڈالنا چاہتا ہے ؟تب موسیٰیہ سوچ کر ڈرا کہ بلاشک یہ بھید فاش ہو گیا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "جب فِرعون نے یہ سُنا تو چاہا کہ موسیٰ کو قتل کرے پر موسیٰ فِرعون کے حغور سے بھاگ کر مُلکِ مدیان مین جا بسا ۔ وہاں وہ ایک کُوئیں کے نزدیک بیٹھا تھا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور مدیان کے کا ہن کی سات بیٹیاں تھیں ۔وہ آئیں اور پانی بھر بھر کر کھٹروں میں دالنے لگیں تاکہ اپنے باپ کی بھیڑبکریوں کو لائیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور گڈرئے آکر اُنکو بھگانے لگے لیکن موسیٰ کھڑا ہوگیااور اُس نے اُ ن کی مدد کی اور اُن کی بھیڑ بکریوں کو پانی پلایا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جب وہ اپنے باپ رعوایل کے پاس لوٹیں تو اُس نے پوچھا کہ آج تم اس قدر جلد کیسے آگئیں؟",
                    },
                    {
                        "verse_num": 19,
                        "text": "اُنہوں نے کہا ایک مصری نے ہم کو گڈریوں کے ہاتھ سے بچایااور ہمارے بدلے پانی بھر بھر کر بھیڑ بکریوں کو پلایا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اُس نے اپنی بیٹیوں سے کہا کہ وہ آدمی کہاںہے؟تم اُسے کیوں چھوڑ آئیں؟اُسے بُلا لائوکہ روٹی کھائے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور موسیٰ اُس شخص کے ساتھ رہنے کو راضی ہو گیا۔تب اُس نے اپنی بیٹی صضورہ موسیٰ کو بیاہ دی۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور اُس کے ایک بیٹا ہوا اور موسیٰ نے اُس کا نام جیرسوم یہ کہہ کر رکھا کہ میں اجنبی ملک میں مسافر ہوں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور ایک مُدت کے بعد یوں ہو کہ مصر کا بادشاہ مر گیا اور بنی اسرائیل اپنی غلامی کے سبب سے آہ بھرنے لگے اور روئے اور اُنکا رونا جو اُنکی غلامی کے باعث تھا خدا تک پہنچا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور خدا نے اُن کا کراہنا سُنا اور خدا نے اپنے عہد کو جو ابرہام اور اضحاق اور یعقوب کے ساتھ تھا یاد کیا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور خدا نے بنی اسرائیل پر نظر کی اور اُنکے حال کو معلوم کیا ۔",
                    },

                ],
            },
            {
                "chap_num": 3,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور موسیٰ اپنے سُسر یترو کی جو مِدیان کا کاہن تھا بھیڑ بکریاں چراتا تھا اور وہ بھیڑ بکریوں کو ہنکاتا ہو ا اُنکو بیابان کی پرلی طرف سے خدا کے پہاڑ کے نزدیک کے آیا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور خداوند کا ایک فرشتہ جھاڑی میں سے آک کے شُعلہ میں اُس پر ظاہر ہو ۔ اُس نے نگا ہ کی اور کیا دیکھتا ہے کہ ایک جھاڑی میں آگ لگی ہو ئی ہے پر وہ جھاڑی بھسم نہیں ہو تی ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تب موسیٰ نے کہا کہ میں اب ذرا اُدھر کترا کر اس بڑے منظر کو دیکھوں کہ یہ جھاڑی کیو ں نہیں جل جاتی ہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "جب خداوند نے دِیکھا کہ وہ دیکھنے کو کترا کر آر ہا ہے تو خدا نے اُسے جھاڑی میں سے پُکارا اور کہا اے موسیٰ!اے موسیٰ !اُس نے کہا میں حاضر ہوں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب اُس نے کہا کہ اِدھر پاس مت آ ۔ اپنے پاوں سے جوتا اُتار کیونکہ جس جگہ تُو کھڑا ہے وہ مقدس زمین ہے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "پھر اُس نے کہا کہ میں تیرے باپ کا خدا یعنی ابرہام کا خدا اور اضحاق کا خدا اور یعقوب کا خدا ہوں ۔موسیٰ نے اپنا مُنہ چھپایا کیونکہ وہ خدا پر نطر کرنے سے ڈرتا تھا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور خداوند نے کہا کہ میں نے اپنے لوگوں کی تکلیف جو مصر میں ہیں خُوب دِیکھی اور اُنکہ فریاد جو بیگار لینے والوں کے سبب سے ہے سُنی اور میں اُن کے دُکھوں کو جانتا ہو ں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور میں اُترا ہو ں کے اُن کو مصریوں کے ہاتھ سے چُھڑاوں اور اُس مُلک سے نکال کر اُنکو ایک اچھے اور وسیع مُلک میں جہاں دُودھ اور شہد بہتا ہے یعنی کنعانیوں اور حتیوں اور اموریوں اور فرزیوں اور حویوں اور یبوسیوں کے مُلک میں پہنچاوں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "دِیکھ بنی اسرائیل کی فریاد مُجھ تک پہنچی ہے اور میں نے وہ ظلم بھی جو مصر ی اُن پر کرتے ہیں دِیکھا ہے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "سواب آمیں تجھے فرعون کے پاس بھیجتا ہو ں کہ تُو میری قوم بنی اسرائیل کو مصر سے نکال لائے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "موسیٰ نے خدا سے کہا میں کون ہوں جوفرعون کے پاس جاوں اور بنی اسرائیل کو مصر سے نکال لاو ں ؟",
                    },
                    {
                        "verse_num": 12,
                        "text": "اُس نے کہا میں ضرور تیر ے ساتھ رہونگا اور اِسکا کہ میں نے تُجھے بھیجا ہے تیرے لئے یہ نشان ہو گا کہ جب تُو اُن لوگوں کو مصر سے نکال لائیگا تو تُم اِس پہاڑ پر خدا کی عبادت کرو گے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب موسیٰ نے خدا سے کہا جب میں بنی اسرائیل کے پاس جا کر اُنکو کہوں کہ تمہارے باپ دادا کے خدا نے مجھے تُمہارے پاس بھیجا ہے اور وہ مجھے کہیں کہ اُس کا نام کیا ہے ؟ تو میں اُنکو کیا بتاوں ؟",
                    },
                    {
                        "verse_num": 14,
                        "text": "خدا نے موسیٰ سے کہا میں جو ہو ں سو میں ہوں ۔ سو تُو بنی اسرائیل سے یو ں کہنا کہ میں جو ہو ں نے مجھے تُمہارے پاس بھیجا ہے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "پھر خدا نے موسیٰ سے کہا کہ تُوبنی اسرائیل سے یوں کہنا کہ خدا وند تُمہارے باپ دادا کے خدا ابرہام کے خدا اور اضحاق کے خدا اور یعقوب کے خدا نے مُجھے تُمہارے پاس بھیجا ہے ۔ ابد تک میرا یہی نام ہے اور سب نسلوں میں اِسی سے میرا ذکر ہو گا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جا کر اسرائیلی بزرگوں ایک جگہ جمع کر اور اُنکو کہہ کہ خداوند تُمہارے باپ دادا کے خدا ابرہام اور اضحاق اور یعقوب کے خدا نے مُجھے دِکھائی دے کر یہ کہا ہے کہ میں نے تُمکو بھی اور جو کُچھ برتاو تُمہارے ساتھ مصر میں کیا جا رہا ہے اُسے بھی خُوب دِیکھا ہے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور میں نے کہا ہے کہ میں تُمکو مصر کے دُکھ میں سے نکال کر کنعانیوں اور حتیوں اور اموریوں اور فرزیوں اور حویوں اور یبوسیوں کے مُلک میں لےچُلونگا جہاں دُودھ اور شہد بہتا ہے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور وہ رتیر ی بات مائینگے اور تُو اِسرائیلی بزرگوں کو ساتھ لے کر مصر کے بادشاہ کے پاس جانا اور اُس سے کہنا کہ خداوند عبرانیوں کے خد اکی ہم سے ملاقات ہوئی ۔ اب تو ہم کو تین دِن کی منزل تک بیابان میں جانے دے تاکہ ہم خداوند اپنے خدا کے لئے قُربانی کریں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور میں جانتا ہو ں کہ مصر کا بادشاہ تُمکو نہ یوں جانے دے گا نہ بڑے زور سے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "سو میں اپنا ہاتھ بڑھاو نگا اور مصر کو اُن سب عجائب سے جو مین اُس میں کرونگا مُصیبت میں ڈالوونگا ۔ اِسکے بعد وہ تُم کو جانے دیگا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور مِیں اُن لوگوں کو مصریوں کی نظر میں عزت بخشونگا اور یو ں ہو گا کہ جب تم نکلو گے تو خالی ہاتھ نہ نکلو گے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "بلکہ تُمہاری ایک ایک عورت اپنی اپنی پڑوسن سے اور اپنے اپنے گھر کی مہمان سونے چاندی کے زیور اور لباس مانگ لیگی ۔ اِنکو تم اپنے بیٹوں اور بیٹیوں کو پہناو گے اور مصریو ں کو لُوٹ لو گے",
                    },
                    
                ],
            },
            {
                "chap_num": 4,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب موسیٰ نے جواب دیا لیکن وہ تو میرا یقین ہی نہیں کرنیگے نہ میری بات سُنینگے ۔وہ کہے گے خداوند تُجھے دِکھائی نہیں دیا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور خداوند نے موسیٰ سے کہا کہ یہ تیر ے ہاتھ میں کیا ہے ؟اُس نے کہا لاٹھی ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "پھر اُس نے کہا کہ اِسے زمین پر ڈال دے اُس نے اُسے زمین پر ڈالا اور وہ سانپ بن گئی اور موسٰ اُس کے سامنے سے بھا گا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب خداوند نے موسیٰ سے کہا ہاتھ بڑھا کر اُسکی دم پکڑ لے (اُس نے ہاتھ بڑھایا اور اُسے پکڑلیا ۔ وہ اُس کے ہاتھ میں لا ٹھی بن گیا )۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تاکہ وہ یقین کریں کہ خداوند اُن کے با پ دادا کا خدا ابرہام کا خدا اور یعقوب کا خدا تُجھکو دِکھائی دِیا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "پھر خداوند نے اُسے یہ بھی کہا کہ تُو اپنا ہاتھ اپنے سینہ پر رکھکر ڈھانک لے ۔ اُس نے اپنا ہاتھ اپنے سینہ پر رکھ کر ڈھانک لیا اور جب اُس نے اُسے نکالکر دِیکھا تو اُس کا ہاتھ کوڑھ سے برف کی مانند سفید تھا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اُس نے کہا کہ تُو اپنا ہاتھ پھر اپنے سینہ پر ر کھ کر ڈھانک لے ( اُس نے پھر اُسے سینہ پر رکھ کر ڈھانک لیا ۔ جب اُس نے اُسے باہر نکال کر دِکھا تو وہ پھر اُسے باقی جسم کی مانند ہو گیا )۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور یو ں ہو گا کہ اگر وہ تیرا یقین نہ کر یں اور پہلے مُعجزہ کو بھی نہ مانیں تو وہ دُوسرے مُعجزے کے سبب سے یقین کر نیگے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اگر وہ اِن دونوں مُعجزوں کے سبب سے یقین نہ کریں اور تیر ی بات نہ سُنیں توتُو دریا کا پانی لے کر خشک جگہ پر چھڑک دِینا اور وہ پانی جو تُو دریا سے لے گا خشک زمین پر خُون ہو جائیگا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب موسیٰ نے خداوند سے کہا اے خداوند ! میں فصیح نہیں ۔ نہ تو پہلے ہی تھا اور نہ جب سے تُو نے اپنے بند ے سے کلام کیا بلکہ رُک رُک کر بولتا ہو ں اور میر ی زبان کُندہے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب خدا وند نے اُسے کہا کہ آدمی کا مُنہ کس نے بنایا ہے ؟ اور کون گونگا یا بہرا یا بینایا اندھا کر تا ہے ؟ کیا میں ہی جو خداوند ہو ں یہ نہیں کرتا ؟",
                    },
                    {
                        "verse_num": 12,
                        "text": "سو اب تُو جا اور میں تیری زبان کا ذمہ لیتا ہو ن اور تجھے سیکھا تا رہونگا کہ تُو کیا کیا کہے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب اُس نے کہا کہ اے خدا وند میں تیری منت کرتا ہو ں کسی اور کے ہاتھ سے جِسے تُو چاہے یہ پیغام بھیج ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب خداوند کا قہر موسیٰ پر بھڑکا اور اُس نے کہا کیا لادیو ں میں سے ہارون تیرا بھائی نہیں ہے ؟ میں جانتا ہوں کہ وہ فصیح ہے اور وہ تیری ملاقات کو بھی آ رہا ہے اور تجھے دِیکھ کر دل میں خو ش ہو گا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "سو تُو اُسے سب کُچھ بتانا اور یہ سب با تیں اُ سے سکھاتا اور میںتیر ی اوراُس زبان کا ذمہ لیتا ہو ں اور تمکو سکھاتا رہونگا کہ تم کیا کیا کرو ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ تیری طرف سے لوگوں سے باتیں کریگا اور وہ تیرا مُنہ بنیگا اور تُو اُ س کے لئے گویا خدا ہو گا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور تُو اِس لاٹھی کو اپنے ہاتھ میں لئے جا اور اِسی سے اِن مُعجزوں کو دِکھانا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب موسٰی لوٹ کر اپنے سُسر یترو کے پاس گیا اور اُس سے کہا کہ مجھےذرا اِجازت دے کہ اپنےبھایئوں کے پاس جو مصر میں ہیں جا وں اور دیکھوں کہ وہ اب تک جیتے ہیں کہ نہیں ۔ یترو نے موسیٰ سے کہا سلامت جا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور خداوند نے مِدیان میں موسیٰ سے کہا کہ مصر کو لوٹ جا کیونکہ وہ سب جو تیری جان کے خواہاں تھے مر گئے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب موسیٰ اپنی بیوی اور اپنے بیٹوں کو لےکر اور اُنکو ایک گدھے پر چڑھا کر مصر کو لوٹا اور موسیٰ نے خدا کی لاٹھی اپنے ہاتھ میں لے لی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خداوند نے موسیٰ سے کہا کہ جب تُو مصر میں پہنچے تو دیکھ وہ سب کرامات جو میں نے تیرے ہاتھ میں رکھی ہیں فِرعون کے آگے دِکھا نا لیکن میں اُس کے دل کو سخت کرونگا اور وہ اُن لوگوں کو جا نے نہیں دیگا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور تُو فِرعون سے کہنا کہ خداوند یوں فرماتا ہے کہ اسرائیل میرا بیٹا بلکہ میرا پہلوٹھا ہے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور میں تُجھے کہہ چکا ہو ں کہ میرے بیٹے کو جانے دے تاکہ وہ میری عبادت کریں اور تُو نے اب تک اُسے جانے دینے سے انکار کیا ہے ۔ سو دیکھ میں تیرے بیٹے کوبلکہ تیرے پہلوٹھے کو مار ڈالونگا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور راستہ میں منزل پر خداوند اُسے مِلا اور چاہا کہ اِسے مار ڈالے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "تب صفورہ نے چقمق کا ایک پتھر لے کر اپنے بیٹے کی کھلڑی کاٹ ڈالی اور اُسے موسیٰ کے پاوں پر پھینک کر کہا تُو بیشک میرے لئے خُونی دُلہا ٹھہرا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تب اُس نے اُسے چھوڑ دیا ۔ پس اُس نے کہا کہ ختنہ کے سبب سے تُو خُونی دُلہا ہے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور خداوند نے ہارُون سے کہا کہ بیابان میں جا کر موسیٰ سے مُلا قات کر ۔ وہ گیا اور خدا کے پہاڑ پر اُس سے مِلا اور اُسے بوسہ دیا ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور موسیٰ نے ہارُون کو بتا یا کہ خدا نے کیا کیا با تیں کہہ کر اُسے بھیجا اور کون کون سے مُعجزے دِکھانے کا اُسے حُکم د یا ہے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "تب موسیٰ اور ہارُون نے جا کر بنی اسرائیل کے سب بزرگوں کو ایک جگہ جمع کیا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور ہارُون نے سب باتیں جو خداوند نے موسیٰ سے کہی تھین اُن کو بتائیں اور لوگوں کے سامنے مُعجزے کئے ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب لوگوں نے اُن کا یقین کیا اور یہ سُن کر خداوند نے بنی اسرائیل کی خبر لی اور اُنکے دُکھوں پر نظر کی اُنہوں نے اپنے سر جُھکا کر سجدہ کیا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 5,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اِس کے بعد موسیٰ اور ہارُون نے جا کر فِرعون سے کہا کہ خداوند اِسرائیل کا خدا یُوں فرماتا ہے کہ میرے لوگو ں کو جانے دے تاکہ وہ بیابان میں میرے لئے عید کریں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "فِرعون نے کہ خداوند کون ہے کہ میں اُسکی بات کو مان کر بنی اِسرائیل کو جانے دُوں ؟میں خداوند کو نہیں جانتا اور میں بنی اسرئیل کو جانے بھی نہیں دُونگا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تب اُنہوں نے کہا کہ عبرانیوں کا خدا ہم سے ملا ہے سو ہم کو اجازت دے کہ ہم تین دن کی منزل بیابان میں جا کر خداوند اپنے خدا کے لئے قُربانی کریں تانہ ہو کہ وہ ہم میں وبا بھیج دے یا ہمکو تلوار سے مروا دے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب مصر کے بادشاہ نے اُن کو کہا اے موسیٰ اور ہارون تم کیوں اُن لوگوں کو اُن کے کام سے چھڑواتے ہو؟تم جاکر اپنے اپنے بوجھ کو اُٹھائو۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور فرعون نے یہ بھی کہا دیکھو یہ لوگ اس ملک میں بہت ہو گے ہیں اور تم اُن کو اُن کے کام سے بٹھاتے ہو۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اُسی دن فرعون بیگار لینے والوں اور سرداروں کو جو لوگوں پر تھے حکم کیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "کہ اب اگے کو تم اُن لوگوں کو اینٹیں بنانے کےلئے بھُس نہ دیناجیسے اب تک دیتے رہے۔وہ خود ہی جا کر اپنے لئے بُھس بٹوریں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اُن سے اُتنی ہی اینٹیں بنوانا جتنی وہ اب تک بناتے آئے ہیں۔تم اُس میں سے کچھ نہ گھٹانا کیونکہ وہ کاہل ہو گئے ہیں۔اسی لئے چلا چلا کر کہتے ہیں کہ ہم کو جانے دوکہ ہم اپنے خدا کے لئے قربانی کریں۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "سو ان سے زیادہ سخت محنت لی جائے تا کہ کام میں مشغُول رہےاور جھوٹی باتوں سے دل نہ لگائیں۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب بیگار لینے والوں اور سرداروں نے جو لوگوں پر تھے جا کر اُن سے کہا کہ فرعون کہتا ہےمیں تم کو بھُس نہیں دینے کا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تم خود ہی جائو اور جہاں کہیں تم کو بھُس ملے وہاں سے لائو کیونکہ تمارا کام کچھ بھی گھٹایا نہیں جائے گا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "چنانچہ وہ لوگ تمام مصر میں مارے مارے پھرنے لگے کہ بھُس کے عوض کُھونٹی جمع کریں۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور ایک بیگار لینے والے یہ کہہ کر جلدی کراتے تھے کہ تم اپنا روز کا کام جیسے بُھس پا کر کرتے تھے اب بھی کرو۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور بنی اسرائیل میں سے جو جو فرُعون کے بیگار لینے والوں کی طرف سے اُن لوگوں پر سردار مقرر ہوے تھے اُن پر مار پڑی اور اُن سے پوچھا گیا کہ کیا سبب ہے کہ تم نے پہلے کی طرح آج اور کل پوری پوری اینٹیں نہیں بنوائیں۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب اُن سرداروں نے جو بنی اسرائیل میں سے مقرر ہوے تھے فرُعون کے آگے جا کر فریاد کی اور کہا کہ تُو اپنے خادموں سے ایسا سلوک کیوں کر تا ہے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تیرے خادموں کوبھُس تو دیا نہیں جاتا اور وہ ہم سے کہتے رہتے ہیں کہ اینٹیں بنائواور دیکھ تیرے خادم مار بھی کھاتے ہیں پر قصور تیرے لوگوں کا ہے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُس نے کہا تم سب کاہل ہوکاہل۔ اسی لئے تم کہتے ہو کہ ہم کو جانے دے کہ خداوند کے لئے قربانی کریں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "سو اب تم جاو کام کرو کیونکہ بُھس تم کو ملے گااور اینٹوں کو تمہیں اسی حساب سے دینا پڑے گا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "جب بنی اسرائیل کہ سرداروں سے یہ کہا گیا کہ تم اپنی اینٹوں اور روزمرہّ کہ کام میں کچھ بھی کمی نہیں کرنے پائو گے تو وہ جان گئے کہ وہ کیسے وبال میں پھنسے ہوئے ہیں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "جب وہ فرعون کے پاس سے نکلے آ رہے تھے تو اُنکو موسیٰ اور ہارون ملاقات کےلئے راستہ پر کھڑے ملے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تب اُنھوں نے اُن سے کہہ کہ خداوند ہی دیکھےاور تمہارا انصاف کرے کیونکہ تم نےہم کو فرُعون اور اُس کے خادموں کی نگاہ میں ایسا گھِنونا کیا ہے کہ ہمارے قتل کے لئے اُن کے ہاتھ میں تلوار دے دی ہے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "تب موسیٰ خداوند کے پاس لوٹ کر گیا اورکہا کہ اے خداوند تُو نے اُن لوگوں کو کیوں دُکھ میں ڈالا اور مجھے کیو ں بھیجا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "کیو نکہ جب سے میں فرُعون کے پاس تیر ے نام سے باتیں کرنے گیا اُس نے اُن لوگوں سے برائی ہی برائی کی اور تُو نے اپنے لوگوں کو ذرا بھی رہائی نہ بخشی ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 6,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب خداوند نے موسیٰ سے کہا کہ اب تُو دِیکھیےگا کہ میں فِرعون کے ساتھ کیا کرتا ہوں ۔ تب وہ زور آور ہاتھ کے سبب سے اُنکو جانے دِیگا اور زورآور ہاتھ ہی کے سبب سے وہ اُنکو اپنے مُلک سے نکال دے گا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "پھر خدا نے موسیٰ سے کہا میں خداوند ہوں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور میں ابرہام اور اضحاق اور یعقوب کو خدا یِ قادرِمُطلق کے طور پر دِکھائی دیا لیکن اپنے یہوواہ نام سے اُن پر ظاہر نہ ہو ا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور میں نے اُن کے ساتھ اپنا عہد بھی باندھا ہے کہ مُلکِ کعنان جو اُنکی مُسافرت کا مُلک تھا اور جس میں وہ پردیسی تھے اُنکو دُونگا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور میں نے بنی اسرائیل کے کراہنے کو بھی سُن کر جنکو مصریوں نے غلامی میں رکھ چھوڑ ا ہے اپنے اُس عہد کو یاد کیا ہے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "سُو تُو بنی اسرائیل سے کہہ کہ میں خداوند ہوں اور میں تُمکو مصریوں کے بوجھوں کے نیچے سے نکال لُونگا ۔اور میں تُمکو اُنکی غُلامی سے آزاد کرونگا اور میں اپنا ہاتھ بڑھا کر اور اُنکو بڑی بڑی سزائیں دیکر تُمکو رہائی دُونگا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور میں تُمکو لےلُونگا کہ میری قوم بن جاؤ اور میں تُمہارا خدا ہونگا اور تُم جان لُوں گے کہ میں خداوند تُمہارا خدا ہوں جو تم کو مصریوں کے بوجھوں کے نیچے سے نکالتا ہوں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور جس مُلک کو ابراہام اور اضحاق اور یعقوب کو دینے کی قسم میں نے کھائی تھی اُس مین تم کو پہنچا کر اُسے میراث کر دُونگا خداوند میں ہوں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور موسیٰ نے بنی اسرائیل کو یہ بایتں سُنا دی پر اُنہوں نے دل کی کڑھن اور غُلامی کی سختی کے سبب سے موسیٰ کی بات نہ سُنی ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "پھر خداوند نے موسیٰ کو فرمایا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "کہ جا کر مصر کے بادشاہ فِرعون سے کہہ کہ بنی اسرائیل کو اپنے مُلک میں سے جانے دے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "موسیٰ نے خداوند سے کہا کہ دِیکھ بنی اسرائیل نے تو میری سُنی نہیں ۔پس میں جو نامختُون ہونٹ رکھتا ہو ں فِرعون میری کیونکر سُنیگا ؟",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب خداوند نے موسیٰ اور ہارُون کو بنی اسرائیل اور مصر کے بادشاہ کے حق میں اِس مضمون کا حُکم دیا کہ وہ بنی اسرائیل کو مُلِک مصر سے نکال لے جائیں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اُنکے آبائی خاندانوں کے سرداریہ تھے رُوبن جو اسرائیل کا پہلوٹھا تھا ۔ اُسکے بیٹے حنوک اور فلّواور حسرون اور کرمی تھے ۔ یہ رُوبن کے گھرانے تھے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "بنی شمعون یہ تھے ۔ یموئیل اور یمین اور اُہد اور یکین اور صحرا اور ساؤل جو ایک کنعانی عورت سے پیدا ہوا تھا ۔یہ شمعون کے گھرانے تھے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور بنی لاوی جن سے اُنکی نسل چلی اُنکے نام یہ ہیں ۔ جیرسون اور قہات اور مراری ۔اور لاوی کی عمر ایک سو سینتیس برس کی ہوئی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "بنی جیرسون لبِنی اور سمعی تھے ۔ اِن ہی سے اِنکے خاندان چلے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور بنی قہات عمرام اور اضہار ا ور خُبرون اور عُزِئیل تھے اور قہات کی عُمر ایک سو تینتیس بر س کی ہو ئی ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور بنی مراری محلی اور موشی تھے ۔لاویوں کے گھرانے جن سے اُنکی نسل چلی یہی تھے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور عمرام نے اپنے باپ کی بہن یوکبد سے بیاہ کیا ۔ اُس عورت کے اُس سے ہارُون اور موسیٰ پیدا ہوئے اور عمرام کی عُمر ایک سو سینتیس برس کی ہوئی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "بنی اضہار قورح اور نفج اور زکری تھے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور بنی عِزئیل یسائیل اور الصفن اور ستری تھے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور ہارُون نے نحسون کی بہن عمینداب کی بیٹی الیسبع سے بیاہ کیا ۔اُس سے ندب اور ابہیو اور الیعزر اور اتمِرپیدا ہوئے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور بنی قورح اشیر اور القنہ اور ابیاسف تھے اور یہ قورچوں کے گھرانے تھے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور ہارُون کے بیٹے الیعزر نے فوطیئل کی بیٹیوں میں سے ایک کے ساتھ بیاہ کیا ۔ اُس سے فینحاس پیدا ہوا ۔ لاویوں کے باپ دادا کے گھرانوں کے سردار جن سے ان کے خاندان چلے یہی تھے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "یہ وہ پارون اور موسیٰ ہیں جن کو خداوند نے فِرمایا کہ بنی اسرائیل کو اُنکے جتھوں کے مُطابق مُلک مصر سے نکال لے جاؤ ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "یہ وہ ہیں جنہوں نے مصر کے بادشاہ فِرعون سے کہا کہ ہم بنی اسرائیل کو مصر سے نکا ل لے جائینگے ۔ یہ وہی موسیٰ اور ہارون ہیں ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "جب خداوند نے مُلک مصر میں موسیٰ سے باتیں کیں تو یوں ہوا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "کہ خداوند نے موسیٰ سے کہا میں خداوند ہوں ۔ جو کُچھ میں تُجھے کہوں تُو اُسے مصر کے باد شاہ فِرعون سے کہنا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "موسیٰ نے خداوند سے کہا دِیکھ میرے تو ہونٹو ں کا ختنہ نہیں ہو ا ۔ فِرعون کیونکر میری سُنیگا ؟۔",
                    },
                    
                ],
            },
            {
                "chap_num": 7,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر خدا وند نے موسیٰ سے کہا دِیکھ میں نے تجھے فِرعون کے لئے گویا خدا ٹھہریا اور تیرا بھائی ہارُون تیرا پیغمبر ہو گا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "جو جو حُکم میں تجھےدُوں سو تُو کہنا اور تیرا بھائی ہارون اُسے فِرعون سے کہے کہ وہ بنی اسرائیل کو انپے مُلک سے جانے دے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور میں فِرعون کے دل کو سخت کرونگا اور اپنے نشان اور عجائب مُلک مصر میں کثرت سے دِکھا ؤنگا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تو بھی فِرعون تُمہاری نہ سُنیگا ۔ تب میں مصر کو ہاتھ لگاؤنگا اور اُسے بڑی بڑی سزائیں دے کر اپنے لوگوں بنی اسرائیل کے جتھوں کو مُلک مصر سے نکال لاؤنگا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور میں جب مصر پر ہاتھ چلاؤنگا اور بنی اسرائیل کو ان میں سے نکال لاؤنگا تب مصری جانینگے کہ میں کاخداوند ہوں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "موسیٰ اور ہارون نے جیسا خداوند نے اُن کو حُکم دیا ویسا ہی کیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور موسیٰ اِسی برس اور ہارون تراسی برس کا تھا جب وہ فرعون سے ہم کلام ہوئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور خداوند نے موسیٰ اور ہارون سے کہا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "کہ جب فرعون تُم کو کہے کہ اپنا معجزہ دکھاؤ تو ہارون سے کہنا کہ اپنی لاٹھی کو لے کر فرعون کہ سامنے ڈال دے تاکہ وہ سانپ بن جائے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور موسیٰ اور ہارون فرعون کہ پاس گئے اور انہوں نے خداوند کے حکم کہ مطابق کیا اور ہارون نے اپنی لاٹھی فرعون اور اُس کہ خادموں کہ سامنے ڈال دی اور وہ سانپ بن گئی ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب فرعو ن نے بھی داناؤں اور جادوگروں کو بلوایا اور مصر کہ جادو گروں نے بھی اپنی جادو سے ایسا ہی کیا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "کیونکہ انہوں نے بھی اپنی اپنی لاٹھی سامنے ڈالی اور وہ سانپ بن گیئں لیکن ہارون کی لاٹھی اُن کی لاٹھیوں کو نگل گئی ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور فرعون کا دل سخت ہوگیا اور جیسا خداوند نے کہدیا تھا اُس نے اُن کی نہ سنُی۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب خداوند نے موسیٰ سے کہا کہ فرعون کا دل مُتصّب ہے ۔وہ ان لوگوں کو جانے نہیں دیتا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اب تُو صُبح کو فرعون کہ پاس جا۔وہ دریا پر جائیگا۔سو تُو لب دریا اُس کی ملاقات کے لئے کھڑا رہنا اور جو لاٹھی سانپ بن گئی تھی اُسے ہاتھ میں لے لینا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس سے کہناکہ خداوند عبرانیوں کہ خدا نے مجھے تیرے پاس یہ کہنے کو بھیجا ہے کہ میرے لوگوں کو جانے دے تاکہ وہ بیابان میں میری عبادت کریںاور اب تک تُو نے کُچھ سماعت نہیں کی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "پس خداوند یُوں فرماتا ہے کہ تُو اِسی سے جان لیگا کہ میں خداوند ہوں۔دیکھ میَں اپنے ہاتھ کی لاٹھی کو دریا کہ پانی پر مارونگا اور وہ خون ہو جائیگا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جو مچھلیاں دریا میں ہیں مر جائینگی اور دریا سے تعفن اُٹھیگا اور مصریوں کو دریا کا پانی پینے سے کر اہیت ہو گی ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور خداوند نے موسیٰ سے کہا کہ ہارون سے کہہ اپنی لاٹھی لے اور مصر میں جتنا پانی ہے یعنی دریا ؤں اور نہرؤں اور جھیلوں اور تالابوں پر اپنا ہاتھ بڑھا تاکہ وہ کُون بن جائیں اور سار ےمُلک مصر میں پتھر اور لکڑی کے برتنوں میں بھی خُون ہی خُون ہو گا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور موسیٰ اور ہارون نے خداوند کے حُکم کے مُطابق کیا ۔ اُس نے لاٹھی اُٹھا کر اُسے فِرعون اور اُس کے خادموں کے سامنے دریا کے پانی پر مارا اور دریا کا پانی سب خُون ہو گیا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور دریا کی مچھلیاں مر گئیں اور دریا سے تعفن اُٹھنے لگا اور مصر ی دریا کا پانی پی نہ سکے اور تمام مُلک مصر میں خُون ہی خُون ہو گیا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "تب مصر کے جادُوگرؤں نے بھی اپنے جادُو سے ایسا ہی کیا پر فِرعون کا دل سخت ہو گیا اور جیسا خداوند نے کہہ دیا تھا اُس نے اُن کی نہ سُنی ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور فِرعون لَوٹکر اپنے گھر چلا گیا اور اُسکے دل پر کُچھ اثر نہ ہوا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور سب مصریوں نے دریا کے آس پاس پینے کے پانی کے لئے کُوئیں کھودڈالے کیونکہ وہ دریا کا پانی نہیں پی سکتے تھے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور جب سے خداوند نے دریا کو مارا اُسکے بعد سات دن گُزرے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 8,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر خداوند نے موسیٰ سے کہا کہ فِرعون کے پاس جا اور اُس سے کہہ خداوند یُوں فِرماتا ہے کہ میرے لوگوں کو جانے دے تاکہ وہ میری عبادت کریں۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اگر تُو اُن کو جانے نہ دے گا تو دِیکھ میں تیرے مُلک کو مینڈکوں سے مارُونگا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور دریا بےشمار مینڈکوں سے بھر جائے گا اور وہ آ کر تیرے گھر میں اور تیر ی آرام گاہ میں اور تیرے پلنگ پر اور تیرے ملازموں کے گھروں میں اور تیری رعنیت پر اور تیرے تنوروں اور آٹا گوندھنے کے لگنوں میں گھستے پھرینگے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور تُجھ پر اور تیری رعیت اور تیرے نوکروں پر چڑھ جائینگے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور خداوند نے موسیٰ کو فِرمایا کہ ہارُون سے کہہ اپنی لاٹھی لے کر اپنا ہاتھ دریا اور نہروں اور جھیلوں پر بڑھا اور مینڈکوں کو مُلِک مصر پر چڑھا لا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "چنانچہ جتنا پانی مصر میں تھا اُس پر ہارون نے اپنا ہاتھ بڑھایا اور مینڈک چڑھ آے اور مُلِک مصر کو ڈھانک لیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور جادُوگروں نے بھی اپنے جادُو سے ایسا ہی کیا اور مُلِک مصر پر مینڈک چڑھا لائے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب فِرعون نے موسیٰ اور ہارون کو بُلوا کر کہا کہ خداوند سے شفاعت کرو کہ مینڈکوں کو مُجھ سے اور میری رعیت سے دفع کرے اور میں اُن لوگوں کو جانے دُونگا تاکہ وہ خداوند کے لئے قُربانی کریں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "موسیٰ نے فِرعون سے کہا تجھے مجھ پر یہی فخر رہے میں تیرے اور تیرے نوکروں اور تیری رعیت کے واسطے کب کے لئے شفاعت کروں کہ مینڈک تجھ سے اور تیرے گھروں سے دفع ہوں اور دریا ہی میں رہیں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُس نے کہا کل کے لئے ۔ تب اُس نے کہا تیرے ہی کہنے کے مطابق ہو گا تا کہ تُو جانے کے خداوند ہمارے خدا کی مانند کوئی نہیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور مینڈک تجھ سے اور تیرے گھروں سے اور تیرے نوکروں سے اور تیری رعیت سے دُور ہو کر دریا ہی میں رہا کریں گے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پھر موسیٰ اور فِرعون کے پاس سے نکل کر چلے گے اور موسیٰ نے خداوند سے مینڈکوں کے بارے میں جو اُس نے فِرعون پر بھیجے تھ فِریاد کی ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور خداوند نے موسیٰ کی درخواست کے موافق کیا اور سب گھروں اور صحنوں اور کھیتوں کے مینڈک مر گئے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور لوگوں نے اُن کو جمع کر کر کے اُن کے ڈھر لگا دیے اور زمین سے بدبُو آنے لگی ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "پر جب فِرعون نے دِیکھا کہ چھٹکاکر مل گیا تو اُس نے اپنا دل سخت کر لیا اور جیسا خداوند نے کہہ دیا تھا اُن کی نہ سُنی ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تب خداوند نے موسیٰ سے کہا ہارون سے کہہ اپنی لاٹھی بڑھا کر زمین کی گرد کو مار تاکہ وہ تمام مُلک مصر میں جُوئیں بن جائے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اُنہوں نے ایسا ہی کیا اور ہارون نے اپنی لاٹھی لے کر اپنا ہاتھ بڑھایا اور زمین کی گرد کو مارا اور انسان اور حیوان پر جُو ئیں ہوگئیں اور تمام مُلک مصر میں زمین کی ساری گرد جُوئیں بن گئی ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جادُوگروں نے کوشش کی کہ اپنے جادُو سے جُوئیں پیدا کریں پر نہ کر سکے اور انسان اور حیوان دونوں پر جُوئیں چڑھی رہیں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تب جادُوگروں نے فِرعون سے کہا کہ یہ خداکا کام ہے پر فِرعون کا دل سخت ہو گیا اور جیسا خداوند نے کہہ دیا تھا اُس نے ان کی نہ سُنی ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب خداوند نے موسیٰ سے کہا صبح سویرے اُٹھ کر فِرعون کے آگے جا کھڑا ہو نا ۔ وہ دریا پر آئے گا ۔ سو تُو اُس سے کہنا خداوند یُوں فِرماتا ہے کہ میرے لوگوں کو جانے دے کہ وہ میری عبادت کریں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "ورنہ اگر تُو اُن کو جانے نہ دے گا تو دِیکھ میں تجھ پر اور تیرے نوکروں اور تیری رعیت پر اور تیرے گروں میں مچھروں کے غول کے غول بھیجونگا اور مصریوں کے گھر اور تمام زمین جہاں جہاں وہ ہیں مچھروں کے غولوں سے بھر جائیگی ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور میں اُس دن جشن کے علاقہ کو جس میں میرے لوگ رہتے ہیں جدا کر ونگا اور اُس میں مچھروں کے غول نہ ہو نگےتا کہ تُو جان لے کہ دنیا میں خداوند میں ہی ہوں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور میں اپنے لوگوں اور تیرے لوگوں میں فرق کرونگا اور کل تک یہ نشان ظہور میں آئےگا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "چنانچہ خداوند نے ایسا ہی کیا اور فرعون کے گھر اور اُ س کے نوکرں کے گھروں اور سارے ملک مصر میں مچھروں کے غول کے غول بھر گےاور اُن مچھروں کے غولوں کے سبب سے ملک کا ناس ہو گیا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "تب فرعون نے موسیٰ اور ہارون کو بلوا کر کہا کہ تم جائو اور اپنے خدا کےلئے اسی ملک میں قربانی کرو ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "مویٰ نے کہا ایسا کرنا مناسب نہیں کیونکہ ہم خداوند اپنےخدا کےلئے اُس چیز کی قربانی کریں گے جس چیز سے مصری نفرت کرتے ہیں۔سو اگر ہم مصریوں کی آنکھوں کے آگے اُس چیز کی قربانی کریں جس سے وہ نفرت رکھتے ہیں تو کیا وہ ہم کو سنگسار نہ کر ڈالینگے۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "پس ہم تین دن کی راہ بیابان میں جا کر خداوند اپنے خدا کےلئے جیسا وہ ہم کو حکم دے گاقربانی کریں گے۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "فرُعون نے کہا میں تم کو جانے دونگا تا کہ تم خداوند اپنے خدا کےلئے بیابان میں قربانی کرولیکن تم بہت دور مت جانااور میرے لئے شفاعت کرنا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "موسیٰ نے کہا دیکھ میں تیرے پاس سے جاکر خداوند سے شفاعت کرونگا کہ مچھروں کے غول فرُعون اوراُس کے نوکروں اور اُس کی رعیّت کے پاس سے کل ہی دور ہو جائے فقط اتنا ہو کہ فرعون آگے کو دُعا کر کہ لوگوں کو خداوند کے لئے قربانی کرنے کو جانےدینے سے انکار نہ کر دے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور موسیٰ نے فرعون کے پاس جا کر خداوند سے شفاعت کی ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "خداوند نے موسیٰ کی درخواست کے موافق کیا اور اُس نے مچھروں کے غولوں کو فرعون اور اُس کے نوکروں اور اُس کی رعّیت کے پاس سے دور کر دیا یہاں تک کے کہ ایک بھی باقی نہ رہا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "پر فرعون نے اس بار بھی اپنا دل سخت کر لیا اور اُن لوگوں کو جانے نہ دیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 9,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تب خداوند نے موسیٰ سے کہا فرعون کے پاس جا کر اُس سے کہہ کہ خداوند عبرانیوں کا خدا یوں فرماتا ہے کہ میرے لوگوں کو جانے دے تا کہ وہ میری عبادت کریں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "کیونکہ اگر تُو انکار کرے اور اُن کو جانے نہ دے اور اب بھی اُن کو روکے رکھے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تو دیکھ خداوند کا ہا تھ تیرے چوپایوں پر جو کھیتوں میں ہیں یعنی گھوڑوں ،گدھوں،اونٹوں ،گائے بیلوں اور بھیڑ بکریوں پر ایسا پڑے گا کہ اُن میں بڑی بھاری مری پھیل جایئگی۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "خداوند اسرائیل کے چوپایوں کو مصریوں کے چوپایوں سے جُدا کرے گا اور جوبنی اسرائیل کے ہے اُن میں سے ایک بھی نہیں مرے گا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور خداوند نے ایک وقت مقرر کر دیا اور بتا دیا کہ کل خداوند اس ملک میں یہی کام کرے گا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خداوند نے دوسرے دن ایسا ہی کیا اور مصریوں کہ سب چوپائے مر گئےلیکن بنی اسرائیل کے چوپایوں میں سے ایک بھی نہ مرا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "چنانچہ فرعون نے آدمی بھیجے تو معلوم ہوا کہ اسرائیلیوں کے چوپایوں میں سے ایک بھی نہیں مرا ہےلیکن فرعون کا دل متّصب تھا اور اُس نے لوگوں کو جانے نہ دیا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور خداوند نے موسیٰ اور ہارون سے کہا کہ تم دونوں بھّٹی کہ راکھ اپنی مٹھیوں میں لےلواور موسیٰ اُسے فرعون کے سامنے آسمان کی طرف اُڑا دے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور وہ سارے ملک مصر میں باریک گرد ہو کر مصر کے آدمیوں اور جانوروں کے جسم پر پھوڑے اور پھپولےبن جائے گی۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "سو وہ بھٹّی کی راکھ لے کر فرعون کے آگے جا کھڑے ہوئے اور موسیٰ نے اُسے آسمان کی طرف اُڑا دیا اور وہ آدمیوں اور جانوروں کے جسم پر پھوڑے اور پھپولے بن گئی۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور جادوگر پھوڑوں کے سبب سےموسیٰ کے آگے کھڑے نہ رہ سکے کیونکہ جادو گروں اور سب مصریوں کے پھوڑے نکلے ہوے تھے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خداوند نے فرعون کے دل کو سخت کر دیا اور اُس نے جیسا خداوند نے موسیٰ سے کہہ دیا تھا اُن کی نہ سُنی ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "پھر خداوند نے موسیٰ سے کہہ کہ صبح سویرے اُتھ کر فرعون کے آگے جا کھٹرا ہو اور اُسے کہہ کہ خداوند عبرانیوں کا خدا یوں فرماتا ہے کہ میرے لوگوں کو جانے دے تاکہ وہ میری عبادت کرے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": " کیونکہ میں اب کی بار اپنی سب ملائیں تیرے دل اورتیر ے نوکروں اور تیری رعیّت پرنازل کرونگاتا کہ تُو جان لے کہ تمام دُنیا میں میری مانند کوئی نہیں ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": " اور میں نے تو ابھی ہاتھ بڑھا کر تجھے اور تیری رعیّت کو وبا سے مارا ہوتا اور تُو زمین پر سے ہلاک ہو جاتا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": " پر میں نے تجھے فی الحقیقت اسلئے قائم رکھا ہے کہ اپنی قوت تجھے دکھائوں تا کہ میرا نام ساری دُنیا میں مشہور ہو جائے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": " کیا تُو اب بھی میرے لوگوں کے مقابلہ میں تکّبر کرتا ہے کہ اُن کو جانے نہیں دیتا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "دیکھ میں کل سے اسی وقت ایسے بڑے بڑے اولے برساوُنگا جو مصر میں جب سے اُس کی بنیاد ڈالی گئی آج تک نہیں پڑے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "پس آدمی بھیج کر اپنے چوپایوں کو اور جو کچھ تیرا مال کھیتوں میں ہےاُس کو اندر کر لے کیونکہ جتنے آدمی اور جانور میدان میں ہونگے اور گھر میں نہیں پہنچائے جائیں گے اُن پر اولے پڑے گے اور وہ ہلاک ہو جائیں گے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "سو فرعون کہ خادموں میں جوجو خداوند کے کلام سے ڈرتا تھا وہ اپنے نوکروں اور چوپایوں کوگھر میں بھگا لے آیا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور جنہوں نے خداوند کے کلام کا لحاظ نہ کیا انھوں نے اپنے نوکروں اور چوپایوں کو میدان میں رہنے دیا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خداوند نے موسیٰ سے کہہ کہ اپنا ہاتھ آسمان کی طرف بڑھا تاکہ سب ملک مصر میں نسان اور حیوان کھیت کی سبزی پر جو ملک مصر میں ہےاولے گریں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور موسیٰ نے اپنی لاٹھی آسمان کی طرف اُٹھائی اور خداوند نے رعد اور اولے بھیجےاور آگ زمین تک آنے لگی اور خداوند نے ملک مصر پراولے برسائے۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "پس اولے گرے اوراولوں کے ساتھ آگ ملی ہوئی تھی اور وہ اولے ایسے بھاری تھے جب سے مصری قوم آباد ہوئی ایسے اولے ملک میں کبھی نہیں پڑے تھے۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اولوں نے سارے ملک مصر میں اُن کو جو میدان میں تھے کیا انسان کیا حیوان سب کو مارااور کھیتوں کی ساری سبزی کو بھی اولے مار گئےاور میدان کے بھی سب درختوں کو توڑ ڈالا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "مگر جشن کے علاقہ میں جہاں بنی اسرائیل رہتے تھے اولے نہیں گرے۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "تب فرعون نے موسیٰ اور ہارون کو بلوا کر اُن سے کہا کہ میں نے اس دفعہ گناہ کیا۔خداوند صادق ہے اور میری قوم ہم دونوں بدکار ہے۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "خداوند سے شفاعت کرو کیونکہ کہ یہ زور کا گرجنا اور اولوں کا برسنا بہت ہو چُکااور میں تم کو جانے دُونگااور تم اب رُکے نہیں رہو گے۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "تب موسیٰ نے اُسے کہا کہ میں شہر سے باہر نکلتے ہی خداوند کے آگے ہاتھ پھیلاونگااور رعد موقوف ہوجائے گااور اولے بھی پھر نہ پڑنیگےتاکہ تُو جان لے کہ دُنیا خداوند کی ہی ہے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "لیکن میں جانتا ہوں کہ تُو اور تیرے نوکر اب بھی خداوند خدا سے نہیں ڈرو گے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "پس سُن اور جو کو تُو اولے مار گئےکیونکہ جو کی بالیں نکل چُکی تھی اور سُن میں پھول لگے ہوے تھے۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "پر گیہوں اور کٹھیا گیہوں مارے نہ گےکیونکہ وہ بڑھے نہ تھے۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور موسیٰ نے فرعون کے پاس سے شہر کے باہر جا کر خداوند کے آگے ہاتھ پھیلائے۔سو رعد اور اولے موقوف ہوگئےاور زمین پر بارش تھم گئی۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "جب فرعون نے دیکھا کہ مینہ اور اولے اور رعد موقوف ہو گے تو اُس نے اور اُس کے خادموں نے اور زیادہ گناہ کیا کہ اپنا دل سخت کر لیا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور فرعون کا دل سخت ہو گیا اور اُس نے بنی اسرائیل کو جیسا خداوند نے موسیٰ کی معرفت کہہ دیا تھا جانے نہ دیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 10,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اورخداوند نے مُوسیٰ سے کہا کہ فرعون کے پاس جا کیونکہ مَیں ہی نے اُسکے دِل اور اُنکے نوکروں کے دل کو سخت کر دِیا ہے تاکہ مَیں اپنے یہ نِشان اُنکے بیچ دِکھاؤں۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور تُو اپنے بیٹے اور اپنے پوتے کو میرے نِشان اور وہ کام جو میَں نے مصر میں اُنکے درمیان کئے سُنائے اور تُم جان لو کہ خداوند مَیں ہی ہُوں۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور مُوسیٰ اور ہارون نے فرعون کے پاس جا کر اُس سے کہا کہ خُداوند عبرانیوں کا خُدا یُوں فرماتا ہے کہ تُو کب تک میرے سامنے نِیچا بننے سے اِنکار کریگا؟میرے لوگوں کو جانےدے کہ وہ میری عِبادت کریں۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "ورنہ اگر تُو میرے لوگوں کو جانے نہ دیگا تو دیکھ کل میں تیرے مُلک میں ٹِڈیاں لے آؤنگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ زمین کی سطح کو اَیسا ڈھانک لینگی کہ کوئی زمین کو دیکھ بھی نہ سکیگا اور تُمہارا جو کُچھ اولوں سے بچ رہا ہے وہ اُسے کھا جائینگی اور تُمہارے جتنے درخت مَیدان میں لگے ہیں اُنکو بھی چٹ کر جائینگی ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور وہ تیرے اور تیرے نوکروں بلکہ سب مصریوں کے گھروں میں بھر جائینگی اور اَیسا تیرے آباواجداد نے جب سے وہ پیدا ہُوئے اُس وقت سے آج تک نہیں دیکھا ہوگا اور وہ نوٹکر فرعون کے پاس سے چلا گیا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب فرعون کے نوکر فرعون سے کہنے لگے کہ یہ شخص کب تک ہمارے لِئے پھندا بنا رہیگا ؟اِن لوگوں کو جانے دے تاکہ وہ خُداوند اپنے خدا کی عبادت کریں ۔ کیا تجھے خبر نہیں کہ مصر برباد ہوگیا ؟",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب مُوسیٰ اور ہاروُن فرعون کے پاس پھر بُلالئے گئے اور اُس نے اُنکو کہا کہ جاؤاور خداوند اپنے خدا کی عبادت کرو پر وہ کَون کَون ہیں جائینگے ؟",
                    },
                    {
                        "verse_num": 9,
                        "text": "مُوسیٰ نے کہا کہ ہم اپنے جوانوں اور بُڈھوں اور اپنے بیٹوں اور بیٹیوں اور اپنی بھیڑ بکریوں اور اپنے گائے بیلوں سمیت جائینگے کیونکہ ہمکو اپنے خُدا کی عِید کر نی ہے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تب اُس نے اُنکو کہا کہ خُداوند ہی تُمہارے ساتھ رہے ۔ میں تو ضرور ہی تُمکو بّچوں سمیت جانے دُونگا ۔ خبردار ہو جاؤ ۔ اِس میں تُمہاری خرابی ہے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "نہیں ۔ اَیسا نہیں ہونے پائیگا ۔ سو تُم مرد ہی مرد جاکر خُداوند کی عِبادت کرو کیونکہ تُم یہی چاہتے تھے اور وہ فرعون کے پاس سے نِکال دِئے گئے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تب خُداوند نے مُوسیٰ سے کہا کہ مُلِک مِصر پر اپنا ہاتھ بڑھا تاکہ ٹڈیا ں مُلِک مِصر پر آئیں اور ہر قِسم کی سبزی کو جو اِس مُلک میں اولوں سے بچ رہی ہے چٹ کر جائیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "پس موسیٰ نے مُلِک مِصر پر اپنی لاٹھی بڑھائی اور خُداوند نے اُس سارے دِن اور ساری رات پُرواآندھی چلائی اور صبح ہوتے ہوتے پُرواآندھی ٹِڈیاں لے آئی ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اورٹِڈیاں سارے مُلِک مصر پر چھاگئیں اور وہیں مصر کی حدوُد میں بسیرا کِیا اور اُنکا دَل اَیسا بھاری تھا کہ نہ تو اُن سے پہلے اَیسی ٹِڈیاں کبھی آئیں نہ اُنکے بعد پھر آئینگی ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "کیونکہ اُنہوں نے تمام رُویِ زمین کو ڈھانک لِیا اَیسا کہ مُلک میں اندھیرا ہوگیا اور اُنہوں نے اُس مُلک کی ایک ایک سبزی کو اور درختوں کے میووں کو جواولوں سے بچ گئے تھے چٹ کر لِیا اور مُلِک مصر میں نہ تو کِسی درخت کی نہ کھیت کی کِسی سبزی کی ہریالی باقی رہی۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تب فرعون نے جلد مُوسیٰ اور ہارون کو بُلوا کر کہا کہ میں خُداوند تُمہارے خُدا کا اور تُمہارا گنہگار ہوں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "سو فقط اِس بار میرا گُناہ بخشو اور خُداوند اپنے خُدا سے شفاعت کرو کہ وہ صِرف اِس مُوت کو مُجھ سے دُور کر دے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "سو اُس نے فرعون کے پاس سے نکلکر خُداوند سے شفاعت کی ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور خُداوند نے بیچھواآندھی بھیجی جو ٹِڈیوں کو اُڑا کر لے گئی اور اُنکو بحِر قُلزم میں ڈالدیا اور مصر کی حُدود میں ایک ٹِڈی بھی باقی نہ رہی ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "پر خُداوند نے فرعون کے دِل کو سخت کر دیا اور اُس نے بنی اِسرائیل کو جانے نہ دِیا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "پھر خُداوند نے مُوسیٰ سے کہا کہ اپنا ہاتھ آسمان کی طرف بڑھا تاکہ مُلِک مصر میں تاریکی چھا جائے ۔ اُیسی تاریکی جسے ٹٹول سکیں۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور مُوسیٰ نے اپنا ہاتھ آسمان کی طرف بڑھایا اور تین دِن تک سارے مُلک مصر میں گہری تاریکی رہی ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تین دِن تک نہ تو کسِی نے کسِی کودیکھااور نہ کوئی اپنی جگہ سے ہلا پر سب بنی اسرائیل کے مکانوں میں اُجالا رہا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب فرعون نے مُوسیٰ کو بُلواکر کہاکہ تُم جاؤ اور خُداوند کی عِبادت کرو ۔ فقط اپنی بھیڑ بکریوں اور گائے بَیلوں کو یہیں چھوڑ جاؤ اور جو تُمہارے بال بچے ہیں اُنکو بھی ساتھ لیتے جاؤ ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "مُوسیٰ نے کہا کہ تُجھے ہمکو قُربانیوں اور سوختنی قُربانیوں کے لئے جانور دینے پڑینگے تاکہ ہم خُداوند اپنے خُدا کے آگے قُربانی کریں۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "سو ہمارے چوپائے بھی ہمارے ساتھ جائینگے اور اُنکا ایک کُھر تک بھی پیچھے نہیں چھوڑا جائیگا کیونکہ اُن ہی میں سے ہمکو خُداوند اپنے خُدا کی عِبادت کا سامان لینا پڑیگا اور جب تک ہم وہاں پہنچ نہ جائیں ہم نہیں جانتے کہ کیا کیا لیکر ہمکو خُداوند کئی عِبادت کر نی ہوگی ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "لیکن خُداوند نے فرعون کے دل کو سخت کر دیا اور اُس نے اُنکو جانے ہی نہ دیا ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور فرعون نے اُسے کہا میرے سامنے سے چلاجا اور ہوشیار رہ ۔ پھر میرا مُنہ دیکھنے کو مت آنا کیونکہ جس دِن تُو نے میرا منہ دیکھا تُو مارا جائیگا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "تب مُوسیٰ نے کہا کہ تُو نے ٹھیک کہا ہے ۔ میں پھر تیرا مُنہ کبھی نہیں دیکھُونگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 11,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے مُوسیٰ سے کہا کہ میں فرعون اور مصریوں پر ایک بلا اور لاونگا۔اُس کے بعد وہ تم کو یہاں سے جانے دے گا اور جب وہ تم کو جانے دئیگا تو یقیناتم سب کو یہاں سے بالکل نکالدئیگا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "سو اب تُو لوگوں کے کان میں یہ بات ڈال دے کے اُن میں سے ہر شخص اپنے پڑوسی اور ہر عورت اپنی پڑوسن سے سونے چاندی کے زیور لے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور خداوند نے اُن لوگوں پر مصریوں کو مہربان کر دیا اور یہ آدمی موسیٰ بھی ملک مصر میں فرعون کے خادموں کے نزدیک اور اُن لوگوں کی نگاہ میں بڑا بزرگ تھا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور موسیٰ نے کہا کہ خداوند یوں فرماتا ہے کہ میں آدھی رات کو نکل کر مصر کے بیچ میں جاونگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور ملک مصر کے سب پہلوھٹے فرعون جو تخت پر بیٹھا ہے اُس کے پہلوھٹے سے لیکر وہ لونڈی جو چکی پیستی ہے اُس کے پہلوھٹے تک اور سب چوپایوں کے پہلوھٹے مر جائے گے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور سارے ملک مصر میں ایسا بڑا ماتم ہو گا جیسا نہ کبھی پہلے ہوا اور نہ پھر کبھی ہو گا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "لیکن اسرائیلوں میں سے کسی پر خواہ انسان ہو خواہ حیوان ایک کتا بھی نہیں بھونکیگا تا کہ تم جان لو کہ خداوند مصریوں اور اسرائیلوں میں کیسا فرق کرتا ہے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور تیرے یہ سب نوکر میرے پاس آکر میرے آگے سر نگو ں ہونگے اور کہینگے کہ تو بھی نکل اور تیرے سب پیرو بھی نکلیں۔اُس کے بعد میں نکل جاونگا۔یہ کہہ کر وہ بڑے طیش میں فرعون کے پاس سے نکل کر چلا گیا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اورخداوند نے موسیٰ سے کہا کہ فرعون تماری اسی سبب سے نہیں سنیگاتاکہ عجائب ملک مصر میں بہت زیادہ ہو جائیں۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور موسیٰ اور ہارون نے یہ کرامات فرعون کو دکھائیں اور خداوند نے فرعون کے دل کو سخت کر دیا کہ اُس نے اپنے ملک سے بنی اسرائیل کو جانے نہ دیا",
                    },
                    
                ],
            },
            {
                "chap_num": 12,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر خداوند نے ملک مصر میں موسیٰ اور ہارون سے کہاکہ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "یہ مہینہ تمہارے لئے مہینوں کا شروع اور سال کا پہلا مہینہ ہو",
                    },
                    {
                        "verse_num": 3,
                        "text": "پس اسرائیلیوں کی ساری جماعت سے یہ کہہ دوکہ اسی مہینے کےدسویں دن ہر شخص اپنے آبا ئی خاندان کے مطابق گھر پیچھے ایک برہ لے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اگر کسی کےگھرانےمیںبرہ کو کھانےکے لئے آدی کم ہوں تو وہ اور اُسکا ہمسایہ جو اُسکےگھر کے برابررہتا ہو دونوں ملکر نفری کے شُمار کے موافق ایک برہ لے رکھیں ۔تم ہر ایک آدمی کے کھانے کی مقدارکے مطابق برّہ کا حساب لگانا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تمُارا بّرہ بے عیب اور یکسالہ نر ہو اور اَیسا بّچہ یاتو بھیڑوں میں سے چن کر لینا یا بکر یوں میں سے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور تُم اُسے اِس مہینے کی چودھویں تک رکھ چھوڑنا اور اِسرائیلیوں کے قبیلوں کی ساری جماعت شام کو اٰسے زبح کریں ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور تھوڑا سا خُون لے کر جن گھروں میں وہ اُسے کھائیں اُن کے دروازوں کے دونُوں بازُوؤں اور اُوپر کی چوکھٹ پر لگا دیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور وہ اُس کے گوشت کو اُسی رات آگ پر بھُون کر بےخمیری روٹی اور کڑوے ساگ پات کے ساتھ کھا لیں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اُسے کچّا یا پانی میں اُبال کر ہرگز نہ کھانا بلکہ اُس کو سر اور پائے اور اندرُونی اعضا سمیت آگ پر بھُون کر کھانا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس میں سے کچُھ بھی صبح تک باقی نہ چھوڑنا اور اگر کچُھ اُس میں سے صبح تک باقی رہ جائے تو اُسے آگ میں جلادینا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور تُم اُسے اِس طرح کھانا اپنی کمر باندھے اور اپنی جوتیاں پاؤں میں پہنے اور اپنی لاٹھی ہاتھ میں لئے ہوئے ۔ تم اُسے جلدی جلدی کھانا کیونکہ یہ فسح خُداوند کی ہے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اِس لئے کہ میں اُس رات مُلک مصر میں سے ہو کر گزرونگا اور انسان اور حیوان کے سب پہلوٹھوں کو جو مُلک مصر میں ہیں مارُونگا اور مصر کے سب دیوتاؤں کو بھی سزا دونگا مَیں خُداوند ہوں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور جن گھروں میں تم ہو اُن پر وہ خُون تُمہاری طرف سے نشان ٹھہریگا اور مَیں اُس خُون کو دِیکھ کر تُم کو چھوڑتا جاؤنگا اور جب مَیں مصریوں کو مارُونگا تو وبا تُمہارے پاس پھٹکنے کی بھی نہیں کہ تم کو ہلاک کرے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور وہ دِن تُمہارے لئے ایک یادگار ہوگا اور تم اُس کو خداوند کی عیدکا دن سمجھ کر ماننا ۔ تم اُسے ہمیشہ کی رسم کر کے اُس دن کو نسل در نسل عید کا دن ماننا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "سات دن تک تم بےخمیری روٹی کھانا اور پہلے ہی دن سے خمیر اپنے اپنے گھر سے باہر کر دینا اِس لئے کہ جو کوئی پہلے دن سے ساتویں دن تک خمیری روٹی کھائے جو شخص اسرائیل میں سے کاٹ ڈالا جائے گا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور پہلے دن تُمہارا مقدس مجمع ہو اور ساتویں دن بھی مقدس مجمع ہو اِن دونوں دِنوں میں کوئی کام نہ کیا جائے ۔ سوا اُس کھانے کے جیسے ہر ایک آدمی کھائے فقط یہی کیا جائے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور تم بےخمیری روٹی کی یہ عید منانا کیونکہ مَیں اُسی دِن تُمہارے جتھوں کو مُلک مصر سے نکا لُونگا ۔ اِس لئے تُم اُس دِن کو ہمیشہ کی رسم کر کے نسل درنسل ماننا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "پہلے مہینے کی چودھویں تاریخ کی شام سے اکیسویں تاریخ کی شام تک تم بے خمیری روٹی کھانا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "سات دِن تک تمہارے گھروں میں کُچھ بھی خمیر نہ ھو کیونکہ جو کوٰئ کسی خمیری چیز کو کھا ئے وہ خمیری چیز کو کھائےوہ خواہ مُسافر ہوخواہ اُسکی پیدایش اُسی مُلک کی ہو اِسرائیل کی جماعت سے کاٹ ڈالا جائیگا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تُم کوئی خمیری چیز نہ کھانا بلکہ اپنی سب بستیوں میں بے خمیری روٹی کھانا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تب موسیٰ نے اسرائیل کے سب بزرگوں کو بُلواکر اُن کو کہا کہ اپنے اپنے خاندان کے مطابق ایک ایک بّرہ نکال رکھو اور یہ فسح کا بّرہ ذبح کرنا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اورتُم زُوفے کا ایک گُچھّا لیکر اُس خُون میں جو باسن میں ہو گا ڈبونا اور اُسی باسن کے خُون میں سے کُچھ اُوپر کی چَوکٹ اور دروازہ کے دونوں بازوؤں پر لگا دینا اور تم میں سے کوئی صبح تک اپنے گھر کے دروازہ سے باہر نہ جائے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "کیو نکہ خداوند مصریوں کو مارتا ہو ا گزریگا اور جب خداوند اُوپر کی چوکٹ اور دروازہ کے دونوں بازوؤں پر خُون دِیکھیگا تو وہ اُ س دروازہ کو چھوڑ جائیگا اور ہلاک کرنے والے کو تم کو مارنے کے لئے گھر کے اندر آنے نہ دیگا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور تم اِس بات کو اپنے اور اپنی اولاد کے لئے ہمیشہ کی رسم کر کے ماننا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور جب تُم اُس مُلک میں جو خدوند تُمکو اپنے وعدہ کے مافق دیگا داخل ہو جائو تو اس عبادت کو برابر جاری رکھنا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور جب تمہاری اَولاد تُم سے پوچھے کہ اِ س عبادت سے تمہارامقصد کیاہے۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "تو تُم یہ کہنا کہ یہ خُداوند کی فسح کی قُربانی ہے جو مِصر میں مِصریوں کو مارتے وقت بنی اِسرائیل کےگھروں کوچھوڑگیااوریُوںہمارےگھروںکوبچالیا۔تب لوگوں نےسرجُھکاکرسجدہ کِیا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اوربنی اِسرائیل نےجاکرجیساخُداندنےمُوسی اورہارُون کوفرمایاتھاوَیساہی کِیا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اورآدھی رات کوخُدوندنےمُلک مِصرکے سب پہلوٹھوںکوفرعون جواپنےتخت پربیٹھاتھااُسکےپہلوٹھےسےلیکر وہ قَیدی جوقَیدخانہ میں تھااُسکےپہلوٹھےتک بلکہ چَوپایوں کےپہلوٹھوں کوبھی ہلاک کردِیا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور فرعون اوراُسکےسب نوکراورسب مِصری رات ہی کو اُٹھ بیٹھے اورمِصرمیں بڑاکُہرام مچا کیونکہ ایک بھی اَیسا گھر نہ تھا جِسں میں کوئی نہ مرا ہو ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب اُس نے رات ہی رات میں مُوسی اور ہارُون کوبُلواکرکہا کہ تُم بنی اِسرائیل کو لیکر میری قَوم کے لوگوں میں سے نکِل جا و اور جیسا کہتے ہوجاکر خُداوند کی عِبات کرو ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اوراپنے کہنے کے مُطابق اپنی بھیڑبکریاں اور گائے بَیل بھی لیتے جاو اور میرے لئے بھی دُعاکرنا ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور مِصری اُن لوگوں سے بجد ہونےلگے تاکہ اُنکو مُلک مِصر سے جلد باہر چلتا کریں کیونکہ وہ سمجھے کہ ہم سب مرجائینگے ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "سواِن لوگوں نے اپنے گُندھے گُندھائے آٹے کو بغیر خمیر دئے لگنوں سمیت کپڑوں میں با ندھ کر اپنے کندھوں پر دھرلِیا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور بنی اسرائیل نے مُوسیٰ کے کہنے کے مُوافِق یہ بھی کِیا کہ مِصریوں سے سونے چاندی کے زیور اور کپڑے مانگ لئے ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور خُداوند نے ان لوگوں کو مِصریوں کی نِگاہ میں اَیسی عِزت بخشی کہ جو کُچھ اُنہوں نے ما نگا اُنہوں نے دے دیا سو انہوں نے مصر یو ں کو لو ٹ لیا۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور بنی اسرائیل نے رعمسیس سے سکّات تک پیدل سفر کِیا اور بال بّچوں کو چھوڑ کر وہ کوئی چھ لاکھ مرد تھے ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور اُنکے ساتھ ایک مِلی جلی گروہ بھی گئی اور بھیڑ بکریاں اور گائے بیل اور بہت چوپائے اُنکے ساتھ تھے ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "اور اُہنوں نے اُس گندھے ہو ئے آٹے کی جسے وہ مصر سے لائے تھے بےخمیری روٹیاں پکایئں کیونکہ وہ اُس میں خمیر دِینے نہ پائے تھے اِسلئے کہ وہ مصر سے ایسے جبراً نکال دِئے گئے کہ وہاں ٹھر نہ سکے اور نہ کُچھ کھانا اپنے لِئے تیار کرنے پائے ۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "اور بنی اسرائیل کو مصر میں بُودوباش کرتے ہوئے چارسَو تیس برس ہوئے تھے ۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور اُن چار سَو تیس برسوں کے گُزرجانے پر ٹھیک اُسی روز خُداوند کا لشکر مُلِک مِصر سے نکل گیا ۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "یہ وہ رات ہے جسے خُداوند کی خاطر ماننا بہت مُناسب ہے کیونکہ اِس میں وہ اُنکو مُلِک مصِر سے نِکال لایا ۔ خُداوند کی یہ وہی رات ہے جِسے لازِم ہے کہ سب بنی اِسرائیل نسل در نسل خوب مانیں۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "پھر خُداوند نے مُوسیٰ اور ہارُون سے کہا کہ فسح کی رسم یہ ہے کہ کوئی بیگانہ اُسے کھانے نہ پائے ۔",
                    },
                    {
                        "verse_num": 44,
                        "text": "لیکن اگر کوئی شخص کِسی کا زرخرید غُلام ہو اور تُو نے اُس کا ختنہ کر دیا ہو تو وہ اُسے کھائے ۔",
                    },
                    {
                        "verse_num": 45,
                        "text": "پر اجنبی اور مزدوُر اُسے کھانے نہ پائے ۔",
                    },
                    {
                        "verse_num": 46,
                        "text": "اور اُسے ایک ہی گھر میں کھائیں یعنی اُسکا ذرا بھی گوشت تُو گھر سے باہر نہ لے جانا اور تُم اُسکی کوئی ہڈی توڑنا۔",
                    },
                    {
                        "verse_num": 47,
                        "text": "اِسرائیل کی ساری جماعت اِس پر عمل کرے ۔",
                    },
                    {
                        "verse_num": 48,
                        "text": "اور اگر کوئی اجنبی تیرے ساتھ مُقیم ہو اور خُداوند کی فسح کو ماننا چاہتا ہو اُسکے ہاں کے سب مرد اپنا ختنہ کرائیں ۔تب و ہ پاس آکر فسح کرے ۔ یُوں وہ اَیسا سمجھاجائیگا گویا اُسی مُلک کی اُسکی پیدایش ہے پر کوئی نا مختون آدمی اُسے کھانے نہ پائے ۔",
                    },
                    {
                        "verse_num": 49,
                        "text": "وطنی اور اُس اجنبی کے لئے جو تمہارے بیچ مُقیم ہو ایک ہی شریعت ہوگی ۔",
                    },
                    {
                        "verse_num": 50,
                        "text": "پس سب بنی اِسرائیل نے جیسا خُداوند نے مُوسیٰ اور ہارون کو فر مایا ویَسا ہی کیا۔",
                    },
                    {
                        "verse_num": 51,
                        "text": "اور ٹھیک اُسی روز خُداوند بنی اِسرائیل کے سب جتھوں کو مُلِک مصر سے نکال لے گیا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 13,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے مُوسیٰ کو فرمایا کہ ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "سب پہلوٹھوں کو یعنی جو بنی اِسرائیل میں خواہ اِنسان ہو خواہ حیوان پہلوٹھی کے بچے ہوں اُنکو میرے لئے مُقدس ٹھہراکیونکہ وہ میرے ہیں۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور مُوسیٰ نے لوگوں سے کہا کہ تُم اِس دِن کو یاد رکھنا جس میں تُم مصر سے جو غلامی کا گھر ہے نکلے کیونکہ خُداوند اپنے زورِ بازو سے تُم کو وہاں سے نکال لایا ۔اس میں خمیری روٹی کھائی نہ جائے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تُم ابیب کے مہینے میں آج کے دن نکلے ہو ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "سو جب خُداوند تجھ کو کِنعانیوں اور حِتّیوں اور اموریوں اور حویوں اور یبوسیوں کے ملک میں پہنچا دے جسے تُجھ کو دینے کی قسم اُس نے تیرے باپ دادا سے کھائی تھی اور جس میں دودھ اور شہد بہتا ہے تو تُو اِسی مہینے میں یہ عبادت کیا کرنا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "سات دن تک تو تُو بے خمیری روٹی کھانا اور ساتوٰیں دن خُداوند کی عید منانا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "بے خمیری روٹی ساتوں دن کھائی جائے اور خمیری روٹی تیرے پاس دکھائی بھی نہ دے اور نہ تیرے مُلک کی حدود میں کہیں کچھ خمیر نظر آئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور تُو اُس روز اپنے بیٹے کو یہ بتانا کہ اس دن کو میں اس کام کے سبب سے مانتا ہوں جو خُداوند نے میرے لئے اُس وقت کیا جب میں مُلک مصِر سے نکلا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "یہ ہی تیرے پاس گویا تیرے ہاتھ میں ایک نشان اور تیری دونوں آنکھوں کہ سامنے ایک یادگار ٹھہرے تاکہ خُداوند کی شریعت تیری زبان پر ہوکیونکہ خُداوند نے تجھ کو اپنے زورِبازو سے ملک مصر سے نکلا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "پس تُو اِس رسم کو اِسی وقت مُعیِّن میں سال بسال ماناکرنا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور جب خُداوند اُس قَسم کے مُطابق جو اُس نے تجھ سے اور تیرے باپ دادا سے کھائی تُجھ کو کنعانیوں کے مُلک میں پہنچا کر وہ مُلک تُجھکو دے دے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تو تُو پہلوٹھی کے بچوں کو اور جانوروں کے پہلوٹھوں کو خُداوند کےلئے الگ کر دینا ۔ سب نر بچے خُداوند کے ہونگے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور گدھے کے پہلے بّچے کے فِدیہ میں بّرہ دینا اور اگر تُو اُسکا فدیہ نہ دے تو اُسکی گردن توڑڈالنا اور تیرے بیٹوں میں جتنے پہلوٹھے ہوں اُن سب کا فدیہ تُجھ کو دینا ہوگا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور جب آیندہ زمانہ میں تیرا بیٹا تُجھ سے سوال کرے کہ یہ کیا ہے ؟تو تُو اُسے یہ جواب دینا کہ خُداوند ہمکو مصر سےجو غلامی کا گھر ہے بزورِبازُو نکال لایا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جب فرعون نے ہمکو جانے دینا نہ چاہا تو خُداوند نے مُلِک مصر میں اِنسان اور حیوان دونوں کے پہلوٹھے مار دِئے اِسلئے میں جانوروں کے سب نر بچّوں کو اپنی اپنی ماں کے رِحم کو کھولتے ہیں خُداوند کے آگے قُربانی کرتا ہُوں لیکن اپنے بیٹوں کے سب پہلوٹھوں کا فدیہ دِیتا ہوں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور یہ تیرے ہاتھ پر ایک نشان اور تیری پیشانی پر ٹیکوں کی مانند ہوں کیونکہ خُداوند اپنے زورِبازو سے ہمکو مصر سے نِکال لایا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جب فرعون نے اُن لوگوں کو جانے کی اِجازت دے دی تو خُدا انکو فلستیوں کے مُلک کے راستہ سے نہیں لے گیا اگرچہ اُدھر سے نزدِیک پڑتا کیونکہ خُدا نے کہا اَیسا نہ ہو کہ یہ لوگ لڑائئ بھڑائی دیکھ کر پچھتا نے لگیں اور مصر کو لوٹ جائیں ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "بلکہ خُدا اِنکو چکّر کھِلا کر بحِر قلزم کے بیابان کے راستہ سے لے گیا اور بنی اِسرائیل مُلِکمصر سے مُسلّح نکلے تھے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور مُوسیٰ یُوسُف کی ہڈیوں کو ساتھ لیتا گیا کیو نکہ اُس نے بنی اِسرائیلسے کہکر کہ خُدا ضرور تُمہاری خبر لیگا اِس بات کی سخت قسم لے لی تھی کہ تُم یہاں سے میری ہڈیاں اپنے ساتھ لیتے جانا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اُنہوں نے سکات سے کُوچ کر کے بیابان کے کنارے ایتام میں ڈیرا کیا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خُداوند اُنکودِن کو راستہ دِکھانے کے لئے ستُون میں اور رات کو روشنی دینے کے لئے آگ کے ستُون میں ہو کر اُنکے آگے چلاکر تا تھا تاکہ وہ دِن اور رات دونوں چل سکیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "وہ بادل کا ستُون دِن کو اور آگ کا ستُون رات کو اُن لوگوں کے آگے ہٹتا نہ تھا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 14,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے موسیٰ سے فرمایا ۔کہ",
                    },
                    {
                        "verse_num": 2,
                        "text": "بنی اسرائیل کو حُکم دے کے وہ لَوٹکر مجدال اور سُمندر کے بیچ فی ہخیروت کے مُقابل لعبل صفون کے آگے ڈیرے لگایئں ۔ اُسی کے آگے سُمندر کے کنارے کنارے ڈیرے لگانا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "فِرعون بنی اسرائیل کے خق میں کہے گا کہ وہ زمین کی اُلجھنوں میں آکر بیابان میں گِھر گئے ہیں ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور مَیں فِرعون کے دل کو سخت کرونگا اور وہ اُن کا پیچھا کریگا اور مَیں فِرعون اور اُس کے سارے لشکر پر ممُتاز ہونگا اور مصری جان لینگے کہ خداوند مَیں ہوں اور اُنہوں نے ایسا ہی کیا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "جب مصر کے بادشاہ کو خبر ملی کہ وہ لوگ چل دئے تو فِرعون اور اُس کے خادموں کا دل اُن لوگوں کی طرف سے پھر گیا اور وہ کہنے لگے کہ ہم نے یہ کیا کیا کہ اسرائیلیوں کواپنی خدمت سے چُھٹی دے کر اُن کو جانے دیا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب اُس نے اپنا رتھ تیار کروایا اور اپنی قوم کے لوگوں کو ساتھ لیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے چھے سو چُنے ہو ئے رتھ بلکہ مصر کے سب رتھ لیے اور ان سبھوں میں سرداروں کو بٹھایا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور خداوند نے مصر کے بادشاہ فرعون کے دل کو سخت کر دیا اور اُس نے بنی اسرائیل کا پیچھا کیا کیو نکہ بنی اسرائیل بڑے فخر سے نکلے تھے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور مصری فوج نے فرعون کے سب گھوڑوں اور رتھوں اور سواروں سمت اُن کا پیچھا کیا اور اُن کو جب وہ سمندر کے کنارے فی ہخیروت کے پاس بغل صفون کے سامنے ڈیرا لگا رہے تھے جا لیا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور جب فرعون نزدیک آ گیا تب بنی اسرائیل نے آنکھ اُٹھا کر دِیکھا کہ مصری اُن کا پیچھا کیے چلے آتے ہیں اور وہ نہایت خوف ذدہ ہو گئے تب بنی اسرائیل نے خداوند سے فریاد کی ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور موسیٰ سے کہنے لگے کیا مصر میں قبریں نہ تھیں جو تُو ہم کو وہاں سے مرنے کے لئے بیا بان میں لے آیا ہے ، تُو نے ہم سے یہ کیا کیا کہ ہم کو مصر سے نکال لایا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "کیا ہم تُجھ سے مصر میں یہ بات نہ کہتے تھے کہ ہم کو رہنے دے کہ ہم مصریوں کی خدمت کریں ؟ کیونکہ ہمارے لئے مصریوں کی خدمت کرنا بیابان میں مرنے سے بہتر ہو تا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تب موسیٰ نے لوگوں سے کہا ڈرو مت چُپ چاپ کھٹر ے ہو کر خداوند کی نجات کے کام کو دِیکھو جو وہ آج تُمہارے لئے کریگا کیو نکہ جن مصریوں کو تم آج دِیکھتے ہو اُن کو پھر کبھی ابدتک نہ دِیکھوگے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "خداوند تمہاری طرف سے جنگ کریگا اور تم خاموش رہوگے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور خداوند نے ماسیٰ سے کہا کہ تُو کیوں مُجھ سے فریاد کر رہا ہے ؟ بنی اسرائیل سے کہہ کہ وہ آگے بڑھیں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور تُو اپنی لاٹھی اُٹھا کر اپنا ہاتھ سمندر کے اُوپر بڑھا اور اُسے دو حصے کر اور بنی اسرائیل سمندر کے بیچ میں سے خشک زمین پر چل کر نکل جائینگے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور دِیکھ مَیں مصریوں کے دل سخت کر دونگا اور وہ اُن کا پیچھا کریں گے اور مَیں فرعون اور اُس کی سپاہ اور اُس کے رتھوں اور سواروں پر ممتاز ہونگا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جب مَیں فرعون اور اُسکے رتھوں اور سواروں پر ممتاز ہو جائونگا تو مصری جان لینگے کہ مَیں ہی خداوند ہوں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور خدا کا فرشتہ جو اسرائیلی لشکرکے آگے آگے چلا کرتا تھا جا کر اُن کے پیچھے ہو گیا اور بادل کا ستون اُن کے سامنے سے ہٹکر اُنکے پیچھے جا ٹھہرا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "یُوں وہ مصریوں کے لشکر اور اسرائیلی لشکر کے بیچ میں ہو گیا ۔ سو وہاں بادل بھی تھا اور اندھیرا بھی تو بھی رات کو اُس سے روشنی رہی۔ پس وہ رات بھر ایک دُوسرے کے پاس نہیں آئے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "پھر موسیٰ نے اپنا ہاتھ سمندر کے اوپر بڑھایا اور خداوند نے رات بھر تُندپُوربی آندھی چلا کر اور سمندر کو پیچھے ہٹا کر اُسے خشک زمین بنا دیا اور پانی دوحصے ہو گیا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور بنی اسرائیل سمندر کے بیچ میں سے خشک زمین پر چلکر نکل گئے اور اُنکے دہنے اور بائیں ہاتھ پانی دیوار کی طرح تھا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور مصریوں نے تعاقُب کیا اور فرعون کے سب گھوڑے اور رتھ اور سوار اُنکے پیچھے پیچھے سمندر کے بیچ میں چلے گئے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور رات کے پچھلے پہر خداوند نے آگ اور بادل کے ستون میں سے مصریوں کے لشکر پر نظرکی اور اُنکے لشکر کو گھبرا دیا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اُس نے اُنکے رتھوں کے پہیوں کو نکال ڈالا ۔ سو اُنکا چلانا مُشکل ہو گیا ۔ تب مصڑی کہنے لگے آؤ ہم اسرائیلیوں کے سامنے سے بھاگیں کیو نکہ خداوند اُنکی طرف سے مصریوں کے ساتھ جنگ کرتا ہے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور خاوند نے ماسیٰ سے کہا کہ اپنا ہاتھ سمندر کے اُوپر بڑھا تاکہ پانی مصریوں اور اُنکے رتھوں اور سواروں پر پھر بہنے لگے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور موسیٰ نے اپنا ہاتھ سمندر کے اُوپر بڑھایا اور صبح ہوتے ہو تے سمندر پھر اپنی اصلی قُّوت پر آ گیا اور مصری اُلٹے بھاگنے لگے ساور خداوند نے سمندر کے بیچ ہی میں مصریوں کو تہ وبالا کر دیا ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور پانی پلٹ کر آیا اور اُس نے رتھوں اور سواروں اور فرعون کے سارے لشکر کو جو اسرائیلیوں کا پیچھا کرتا ہوا سمندر میں گیا تھا غرق کر دیا اور ایک بھی اُن میں سے باقی نہ چُھو ٹا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "پر بنی اسرائیل سمندر کے بیچ میں سے خشک زمین پر چلکر نکل گئے اور پانی اُنکے دہنے اور بایئں ہاتھ دیوار کی طرح رہا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "سو خداوند نے اُس دن اسرائیلیوں کو مصریوں کے ہاتھ سے اِس طرح بچایا اور اسائیلیوں نے مصریوں کو سمندر کے کنارے مرے ہوئے پڑے دِیکھا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور اسرائیلیوں نے وہ بڑی قدرت جو خداوند نے مصریوں پر ظاہر کی دِیکھی اور وہ لوگ خداوند سے ڈرے اور خداوند پر اور اُسکے بندہ موسیٰ پر ایمان لائے ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 15,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور یُوں کہنے لگے : مَیں خداوند کی ثنا گائُونگا کیونکہ وہ جلال کے ساتھ فتحمند ہوا ۔ اُس نے گھوڑے کو سوار سمت سمندر میں ڈال دیا خداوند میرا زُور اور راگ ہے ۔ وہی میری نجات بھی ٹھہرا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "وہ میرا خُدا ہےمَیں اُ سکی بڑائی کرونگا ْ وہ میرے باپ کا خُداہے ۔ میں اُسکی بُزرگی کرونگا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "خُداوند صاخِب جنگ ہے یہوداہ اُسکا نام ہے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "فرعون کے رتھوں اور لشکر کو اُس نے سمندرمیں ڈالدیا اور اسکے چیدہ سردار بحرِ قلزم میں غرق ہوئے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "گہرے پانی نےاُنکو چھپا لِیا۔وہ پتھر کی مانند تہ میں چلے گئے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اے خداوند ؛ تیرا دہنا ہاتھ قدرت کے سبب سے جلالی ہے۔ اَے خُداوند ؛تیرا دہنا ہاتھ دُشمن کو چکنا چور کر دیتا ہے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تُو اپنی عظمت کے زور سے اپنے مُخالفوں کو تہ و بالا کرتا ہے ۔تو اپنا قہر بھیجتا ہے اور وہ اُن کو کھو نٹی کی مانند بھسم کر ڈالتا ہے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تیرے نتھنوں کے دم سے پانی کا ڈھیر لگ گیا سیلاب تُو دے کی طرح سیدھے کھڑے ہو گئے اور گہرا پانی سمندر کے بیچ میں جم گیا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "دشمن نے تو یہ کا تھا میں پیچھا کرونگا ۔میں جا پکڑونگا میں لوٹ کا مال تقسیم کرونگا ۔ان کی تباہی سے میرا کلیجہ ٹھنڈا ہو گا ۔میں اپنی تلوار کھنچ کر اپنے ہی ہاتھ سے اُن کو ہلاک کرونگا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "تُو نے اپنی آندھی کی پُھونک ماری تو سمندر نے اُنکو چھپالیا ۔وہ زور کےپانی میں سیسے کی طرح ڈُوب گئے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "مبعودوں میں اَسے خُداوند ۔تیری مانند کَون ہے ؟ کَون ہے جو تیری مانند اپنے تقدُس کے باعث جلالی اور اپنی مدح کے سبب سے رُعب والااور صاحبِ کرامات ہے ؟",
                    },
                    {
                        "verse_num": 12,
                        "text": "تُو نے اپنا دہنا ہاتھ بڑھایا تو زمین اُنکو نِگل گئی ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اپنی رحمت سے تُو اُن لوگوں کی جِنکو تُو نے خلاصی بخشی راہنمائی کی ۔ اور اپنے زور سے تو اُنکو اپنے مُقدّس مکان کو لے چلا ہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "قُومیں سُنکر تھّرا گئی ہیں ۔ اور فلستین کے باشِندوں کی جان پر آبنی ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "ادوم کے رئیس حیران ہیں ۔ موآب کے پہلوانوں کو کپکپی لگ گئی ہے ۔ کنعان کے سب باشِندوں کے دِل پگھلے جاتے ہیں۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "خَوف وہراس اُن پر طاری ہے ۔ تیرے بازُو کی عظمت کے سبب سے وہ پتھر کی طرح بے حِس و حرکت ہیں ۔ جب تک اے خُداوند تیرے لوگ جنکو تُو نے خریدا ہے پار نہ ہو جائیں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تُو اُنکو وہاں لے جا کر اپنی میراث کے پہاڑ پردرخت کی طرح لگائیگا۔ تُو اُنکو اُسی جگہ لے جائیگا جسے تُو نے اپنی سکُونت کے لئے بنایا ہے ۔ اَے خُداوند ! وہ تیری جایِ مُقّدس ہے جسے تیرے ہاتھوں نے قائم کِیا ہے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "خُداوند ابدُالآباد سلطنت کر یگا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اِس گیت کا سبب یہ تھا کہ فرعون کے سوار گھوڑوں اور رتھوں سمیت سمندر ہیں گئے اور خُداوند سمندر کے پانی کو اُن پر لوٹا لایا ۔ لیکن بنی اِسرائیل سمندر کے بیچ میں خُشک زمین پر چلکر نِکل گئے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب ہارون کی بہن مریم نبِیّہ نے دف ہاتھ میں لِیا اور سب عورتیں دف لئے ِ ناچتی ہُوئی اُسکے پیچھے چلیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور مریم اُنکے گانے کے جواب میں یہ گاتی تھی :۔ خُداوند کی حمدوثنا گاؤ کیونکہ وہ جلال کے ساتھ فتحمند ہئوا ہے ۔ اُس نے گھوڑے کو اُسکے سوار سمیت سمندر میں ڈالدیاہے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "پھر مُوسیٰ بنی اِسرائیل کو بِحرقلزم سے آگے لے گیا اور وہ شور کے بیابان میں آئے اور بیابان میں چلتے ہُوئے تین دن تک اُنکو کوئی پانی کا چشمہ نہ ملا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور جب وہ مارہ میں میں آئے تو مارہ کا پانی پی نہ سکے کیونکہ وہ کڑوا تھا۔ اِسی لئے اُس جگہ کا نام مارہ پڑگیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب وہ لوگ مُوسیٰ پر بڑبڑا کر کہنے لگے کہ ہم کیا پئیں۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اُس نے خُداوند سے فریاد کی ۔ خُداوند نے اُسے ایک پیڑدِکھایا جسِے جب اُس نے پانی میں ڈالاتو پانی میٹھا ہوگیا ۔ وہیں خُداوند نے اُنکے لئِے ایک آئین اور شریعت بنائی اور وہیں یہ کہکر اُنکی آزمائش کی ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "کہ اگر تُو دِل لگا کر خُداوند اپنے خُدا کی بات سُنے اور وُہی کام کرے جو اُسکی نظر میں بھلا ہے اور اُسکے حُکموں کو مانے اور اُسکے آئین پر عمل کرے تو مَیں اُن بیماریوں میں سے جو میں نے مصریوں پر بھیجیں تُجھ پر کوئی نہ بھیجُونگا کیونکہ میں میَں خُداوند تیرا شافی ہُوں",
                    },
                    {
                        "verse_num": 27,
                        "text": "پھر وہ ایلیم میں آئے جہاں پانی کے بارہ چشمے اور کھجُور کے سّتر درخت تھے اور وہیں پانی پانی کے قریب اُنہوں نے اپنے ڈیرے لگائے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 16,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر وہ ایلیم سے روانہ ہوئے اور بنی اسرائیل کی ساری جماعت ملک مصر سے نکلنے کے بعد دوسرے مہینے کیپندرھویں تاریخ کو سَین کے بیابان میں جوایلیم اور سَینا کے درمیان ہے پہنچی۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اُس بیابان میں ساری جماعت مُوسیٰ اور ہارُون پر بڑ بڑانے لگی۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور بنی اسرائیل کہنے کا شکہ ہم خداوند کے ساتھ سے ملک مصر میں جب ہی مار دیے جاتے ہم گوشت کی ہانڈیوں کے پاس بیٹھ کر دل بھر کر روٹی کھاتے تھے کیونکہ تُم تو ہم کو اس بیابان میں اسلئے لے آئے ہو کہ سارے مجمع کو بُھوکا مارو۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب خداوند نے موسیٰ سے کہا میں آسمان سے تمہارے لئے روٹیاں برسانگا۔سو یہ لوگ نکل نکل کر فقط ایک ایک دن کا حصّہ ہر روز بٹور لیا کریں کہ اِس سے میں اُن کی آزمائش کرونگا کہ وہ مری شریعت پر چلینگے یا نہیں۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُس چھٹے دن ایسا ہو گا کہ وہ ہر روز جیتنا پکائینگے وہ اُس سے جیتا روز جمع کرتے ہیں دُونا ہو گا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب موسیٰ اور ہارُون نے سب بنی اسرائیل سے کہا کہ شام کو تُم جان لو گے کہ جو تمکو مُلک مصر سے نکالکر لایا ہے وہ خداوند ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور صُبح کو تُم خُداوند کا جال دیکھو گے کیونکہ تُم جو خداوند پر بڑبُڑانے لگتے ہو اُسے وہ سُنتا ہے اور ہم کون ہیں جو تُم ہم پر بڑ بڑاتے ہو؟",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور موسیٰ نے یہ بھی کہا کہ شام کو خُداوند تُمکو کھانے کو گوشت اور صُبح کو پیٹ بھر کر کھانے کو دے گاکیونکہ تم جو خداوند پر بڑ بڑاتے ہو اُسے وپ سُنتا ہے اور ہماری کیا حقیقت ہے؟تمہارا بڑ بڑانا ہم پر نہیں بلکہ خدا وند پر ہے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "پھر موسیٰ اور ہارُون نے بنی اسرائیل کی ساری جماعت سے کہا کہ تم خداوند کے نزدیک آئو کیونکہ اُس نے تمہارا بڑبڑانا سُن لیا ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور جب اسرائیل بنی اسرائیل سے یہ باتیں کہہ رہا تھا تو اُنہوں نے بیابان کی طرف نظر کہ اور اُنکو خداوند کا جلال بادل میں نظر آیا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور خداوند نے موسیٰ سے کہہ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "میں نے بنی اسرائیل کا بڑ بڑانا سُن لیا ہے سو تُو اُن سے کہہ دےکہ شام کو تُم گوشت کھائو گے اور صُبح کو روٹی سے سیر ہوگےاور تُم جان لو کہ میں خداوند تمہارا خدا ہوں۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور یوں ہوا کہ شام کو اتنی بیڑیں آئیں کہ اُن کا خٰمہ گاہ کو ڈھانک لیا اور صُبح کو خیمہ گاہ کہ آس پاس اوس پڑی ہوئی تھی۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور جب وہ اوس جو پڑی تھی سوکھ گئی تو کیا دیکھتے ہیں کہ بیابا ن میں ایک چھوٹی چھوٹی گول گول چیز ایسے پڑی جیسے پالے کے دانے ہوتے ہیں زمین پر پڑی ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "بنی اسرائیل اُسے دیکھکر آپس میں کہنے لگے مَن؟ کیونکہ وہ نہیں جانتے تھے کہ وہ کیا ہے۔تب موسیٰ نے کہا کہ وہی روٹی ہے جو خداوند نے تمکو کھانے کو دی ہے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "سو خداوند کا حکم یہ ہے کہ تُم اُسے اپنے اپنے کھانے کی مقدار کے موافق یعنی اپنت آدمیوں کے شمار کے مطابق فی کس ایک اومر جمع کرنا اور ہر شخص اُتنے ہی آدمیوں کےلئے جمع کرے جتنے اُسکے ڈیرے میں ہوں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "بنی اسرائیل نے ایسا ہی کیا اور کسی نے زیادہ اور کسی نے کم جمع کیا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جب اُنہو ں نے اُسے اومر سے ناپا تو جس نے زیادہ جمع کیا کچھ زیادہ نہ پایا اور اُسکا جس نے کم جمع کیا تھا کم نہ ہوا ۔اُن اُن میں سے ہر ایک نے اپنے کھانے کی مقدار کے مطابق جمع کیا تھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور موسیٰ نے اُن سے کہدیا تھا کہ کوئی اُس میں سے کچُھ صبح تک باقی نہ چھوڑے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تو بھی اُنہوں نے موسیٰ کی بات نہ مانی بلکہ بعضوں نے صُبح کے لئے کچھ باقی رہنے دیا سو اُس میں کیڑے پڑ گئے اور وہ سڑ گیا۔سو موسیٰ آن سے ناراض ہوا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور وہ ہر صُبح اپنے اپنے کھانے کی مقدار کے مطابق جمع کر لیتے تھے اور دھُوپ تیز ہوتے ہی وہ پگھل جاتا تھا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور چحٹے روز ایسا ہوا کہ جتنی روٹی وہ روز جمع کرتے تھے اُس سے دُونی جمع کی یعنی فی کس دو اومراور جماعت کے سب سرداروں نے آکر یہ موسیٰ کو بتایا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اُس نے اُن کو حُکم دیا کہ خداوند کا حُکم یہ ہے کہ کل خاص آرام کا دن یعنی خداوند کا سبت کا دن ہے جو تُمکو پکانا ہو پکا لو اور جو اُبالنا ہو اُبال لو اور جو بچ رہے اُس کو اپنے لئے صُبح کے لئے محفوظ رکھو۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "چنانچہ اُنہوں نے جیسا موسیٰ نے کہا تھا اُسے صُبح تک رہنے دیا اور وہ نہ سڑا اور نہ اُس میں کیڑے پڑے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور موسیٰ نے کہا آج اُسی کو کھائو کیونکہ آج خداوند کا سبت ہےاسلئے وہ تُمکو آج میدان میں نہیں ملیگا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "چھ دن تم اُسے جمع کرنا پر ساتویں دن سبت ہے۔اُس میں وہ نہیں ملیگا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور ساتویں دن ایسا ہوا کہ اُن میں سے بعض آدمی مَن بٹورنے گئےپر اُن کو کچھ نہیں ملا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "تب خداوند نے اُن سے کہا کہ تم لوگ کب تک میری شریعت کو ماننے سے انکار کرتے رہو گئے؟",
                    },
                    {
                        "verse_num": 29,
                        "text": " دیکھو چونکہ خداوند نے تُمکو سبت کا دن دیا ہے اسی لئے وہ چھٹے دن دو دن کا کھانا دیتا ہے۔سو تم اپنی اپنی جگہ رہو اور ساتویں دن کوئی اپنی جگہ سے باہر نہ جائے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "چنانچہ لوگوں نے ساتویں دن آرام کیا۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور بنی اسرائیل نے اُسکا نام مَن رکھا اور وہ دھنئے کے بیج کی طرح اور اُسکا مزہ شہد کے پوئے کی طرح تھا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور موسیٰ نے کہا کہ خداوند یہ حُکم دیتا ہے کہ اُسکا ایک اومر بھر کر اپنی نسل کےلئے رکھ لوتا کہ وہ اُس روٹی کو دیکھتے جو میں نے تُمکو بیابان میں کھلائی جب میں تُمکو ملک مصر سے نکالکر لایا۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور موسیٰ نے ہارون سے کہا ایک مرتبان لے اور ایک اومر مَن اُس میں بھر کر اُسے خداوند کے آگے رکھ دے تاکہ وہ تمہاری نسل کےلئے رکھتا رہے۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور جیسا خداوند نے موسیٰ کو حُکم دیا تھا اُسی کے مطابق ہارون نے اُسے شہادت کے صندوق کے آگے رکھ دیا تاکہ وہ رکھتا رہے۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور بنی اسرائیل جب تک آبائو ملک میں نہ آئے یعنی چالیس برس تک مَن کھاتے رہے۔الغرض جب تک وہ ملک کنعان کی حدود تک نہ آئے مَن کھاتے رہے۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور ایک اومر ایفہ کا دسواں حصّہ ہے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 17,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر بنی اسرائیل کی ساری جماعت نسِین کے بیابان سے چلی اور خُداوند کے حُکم کے مُطابق سفرکرتی ہو ئی رفیدیم میں آکر ڈیرا کیا ۔وہاں اُن لوگوں کے بینے کو پانی نہ مِلا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "وہاں وہ لوگ موسیٰ سے جھگڑا کر کے کہنے لگے کہ ہم کو پینے کو پانی دے ۔موسیٰ نے اُں سے کہا تُم مُجھ سے کیوں جھگڑتے ہو اور خُداوند کو کیوں آزماتے ہو ؟",
                    },
                    {
                        "verse_num": 3,
                        "text": "وہاں اُں لوگوں کو بڑی پیاس لگی ۔ سو وہ لوگ موسیٰ پر بڑبڑانے لگے اور کہا کہ تُم ہم کو اور ہمارے بچوں اور چوپا یوں کو پیاسا مرنے کے لئے ہم لوگوں کو کیوں مُلِک مصر سے نکال لایا ؟",
                    },
                    {
                        "verse_num": 4,
                        "text": "موسیٰ نے خُداوند سے فِریاد کر کے کہا کہ مَیں اِن لوگوں سے کیا کُروں ؟ وہ سب تو ابھی مجھے سنگسار کرنے کو تیار ہیں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "خُداوند نے موسیٰ سے کہا کہ لوگوں کے آگے ہو کر چل اور بنی اسرائیل کے بُزرگوں میں سے چند کو اپنے ساتھ لےلے اور جس لاٹھی سے تُو نے دریا پر مارا تھا اُسے اپنے ہاتھ میں لیتا جا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "دِیکھ مَیں تیرے آگے جا کر وہاں حورِب کی ایک چٹان پر کھڑا رہونگا اور تُو اُس چٹان پر مارنا تو اُس میں سے پانی نکلے گا کہ یہ لوگ پِئیں ۔ چنانچہ موسیٰ نے بنی اسرائیل کے بزرگوں کے سامنے یہی کیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے اُس جگہ کا نام متسہ اور مریبہ رکھا کیونکہ بنی اسرائیل نے وہاں جھگڑا کیا اور یہ کہہ کر خُداوند کا امتحان کیا کہ خُداوند ہمارے بیچ میں ہے یا نہیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب عمالیقی آکر رفیدیم میں بنی اسرائیل سے لڑنے لگے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور موسیٰ نے یشوع سے کہا کہ ہماری طر ف کے کُجھ آدمی چُن کر لے جا اور عمالیقیوں سے لڑ اور مَیں کل خُدا کی لاٹھی اپنے ہاتھ میں لیے ہوئے پہاڑ کی چُوٹی پر کھڑا رہونگا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "سو مُوسیٰ کے حُکم کے مطابق یشوع عمالیقیوں سے لڑنے لگا اور مُوسیٰ اور ہاروُن اور حور پہاڑ کی چوٹی پر چڑھ گئے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور جب تک مُوسیٰ اپنا ہاتھ اُٹھائے رہتا تھا بنی اِسرائیل غالب رہتے تھے اور جب وہ ہاتھ لٹکا دیتا تھا تب عمالیقی غائب ہوتے تھے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور جب مُوسیٰ کے ہاتھ بھر گئے تو اُنہوں نے ایک پتھر لیکر مُوسیٰ کے نیچے رکھ دِیا اور وہ اُس پر بیٹھ گیا اور ہارون اور حور ایک اِدھر سے دُوسرا اُدھر سے اُسکے ہاتھوں کو سنبھالے رہے ۔ تب اُسکے ہاتھ آفتاب کے غروُب ہونے تک مضبوطی سے اُٹھے رہے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور یشوع نے عمالیق اور اُسکے لوگوں کو تلوار کی دھار سے شکست دی ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب خُداوند نے مُوسیٰ سے کہا اِس بات کی یاد گاری کے لئے کتاب میں لکھ دے اور یشوع کو سنا دے کہ میں عمالیق کا نام و نشان دُنیا سے بِالکل مِٹا دُونگا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور مُوسیٰ نے ایک قُربانگاہ بنائی اور اُس کا نام یہواہ نِسّی رکھا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس نے کہا خُداوند نے قسم کھائی ہے ۔ سو خُداوند عمالیقیوں سے نسل در نسل جنگ کرتا رہیگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 18,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور جو کچھ خُداوند نےمُوسیٰ اور اپنی قَوم اِسرائیل کے لئے کِیا اور جس طرح سے خُداوند نے اِسرائیل کو مصر سے نکالا سب مُوسیٰ کےسُسر یترو نےجو مِدیان کا کاہن تھا سُنا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور مُوسیٰ کے سسر یترو نے مُوسیٰ کی بیوی صفورہ کو جو میکے بھیج دی گئی تھی ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُسکے دونوں بیٹوں کو ساتھ لِیا ۔ اِن میں سے ایک کا نام مُوسیٰ نے یہ کہکر الیعز جیر سوم رکھا تھا کہ مَیں پر دیس میں مُسافر ہُوں۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور دوسرے کا نام الیعزر یہ کہکر رکھا تھا کہ میرے باپ کا خُدا میرا مدد گار ہوا اور اُس نے مُجھے فرعون کی تلوار سے بچایا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور مُوسیٰ کا سسر یترو اُسکے بیٹوں اور بیوی کو لیکر مُوسیٰ کے پاس اُس بیابان میں آیا جہاں خُدا کے پہاڑکے پاس اُسکا ڈیرا لگاتھا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور مُوسیٰ سے کہا کہ میں تیرا سسر یترو تیری بیوی کو اور اُسکے ساتھ اسکے دونوں بیٹوں کو لیکر تیرے پاس آیا ہوں۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب مُوسیٰ اپنے سسر سے ملنے کو باہر نکلا اور کو رنش بجا لا کر اُسکو چُوما اور وہ ایک دوسرے کی خیروعافیت پُوچھتے ہوئے خَیمہ میں آئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور مُوسیٰ نے اپنے سسر کو بتایا کہ خُداوند نے اِسرائیل کی خاطر فرعون کے ساتھ کیا کیا کِیا اور اِن لوگوں پر راستہ میں کیا کیا مُصیبتیں پڑیں اور خُداوند اُنکو کس کس طرح بچاتا آیا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور تیو ان سب اِحسانوں کے سبب سے خُداوند نے اِسرائیل پر کئے کہ اُنکو مصریوں کے ہاتھ سے نجات بخشی باغ باغ ہوا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور تیرونے کہا خُداوند مُبارک ہو جس نے تُمکو مصریوں کے ہاتھ اور فرعون کے ہاتھ سے نجات بخشی اور جس نے اس قوم کو مصریوں کے پنجہ سے چھڑایا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اب میں جان گیا کہ خُداوند سب معبودوں سے بڑا ہے کیونکہ وہ اُن کاموں میں جو اُنہو ں نے غرورسے کئے اُن پر غالب ہُوا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور مُوسیٰ کے سسر تیرو نے خُدا کے لئے سوختنی قربانی اورذبیحے چڑھائے اور ہارون اور اِسرائیل کے سبب بزرگ مُوسیٰ کے سسر کے ساتھ خُدا کے حضور کھانا کھانے آئے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور دوسرے دن مُوسیٰ لوگوں کی عدالت کرنے بیٹھا اور لوگ مُوسیٰکے آس پاس صُبح سے شام تک کھڑے رہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور جب مُوسیٰ کے سسر نے سب کچھ جو وہ لوگوں کے لئے کرتا تھا دیکھ لیا تو اُس سے کہا یہ کیا کام ہے جو تُو لوگوں کے لئے کرتا ہے ؟ تُو کیوں آپ اکیلا بیٹھتا ہے اور سب لوگ صُبح سےشام تک تیرے آس پاس کھڑے رہتے ہیں۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "مُوسیٰ نے اپنے سسر سے کہا اِسکا سبب یہ ہے کہ لوگ میرے پاس خُدا سے دریافت کرنے کے لئے آتے ہیں۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جب اُن میں کُچھ جھگڑا ہوتا ہےتو وہ میرے پاس آتےہیں اور میں اُنکے درمیان اِنصاف کرتا اور خُداکےا حکاماور شریعت اُنکو بتاتا ہُوں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تب مُوسیٰ کے سسر نے اُس سے کہا کہ تو اچھا کام نہیں کرتا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اِس سے تُو بلکہ یہ لوگ بھی جو تیرے ساتھ ہیں قطی گُھل جا ئینگے کیو نکہ یہ کام تیرے لئے بہت بھاری ہے۔ تُو اکیلا اِسے نہیں کر سکتا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "سو اب تُو میری بات سُن ۔ میَں تُجھے صلاح دیتا ہوں اور خُدا تیرے ساتھ رہے ۔ تُو اِن لوگوں کے لئے خُدا کے سامنے جایا کر اور اِنکے سب معاملے خُدا کے پاس پہنچا دِیا کر ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور تُو رسوم اور شریعت کی باتیں اِنکو سِکھایا کر اور جس راستہ اِنکو چلنا اور ہر کام اِنکو کرنا ہو وہ اِنکو بتا یا کر۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور تُو اِن لوگوں میں سے ایسےلالق اشخاص چُن لے جو خُدا ترس اور سچے اور رشوت کے دشمن ہوں اور اُنکو ہزار ہزار اور سو سو اور پچاس پچاس اور دس دس آدمیو ں پر حاکم بنا دے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "کہ وہ ہر وقت لوگوں کا اِنضاف کِیا کریں اور اَیسا ہو کر بڑے بڑے مقدمے تو وہ تیرے پاس لائیں اور چھوٹی چھوٹی باتوں کا فیصلہ حُود ہی کر دِیا کریں۔ یُوں تیرا بوجھ ہلکا ہو جا ئیگا اور وہ بھی اُسکے اُٹھانے میں تیرے شریک ہونگے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اگر تُو یہ کام کرے اور خُدا بھی تُجھے ایسا ہی حکم دے تو تُو سب کچھ جھیل سکیگا اور یہ لوگ بھی اپنی جگہ اطمینان سےجا ئینگے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور مُوسیٰ نے اپنے سسر کی بات مانکر جیسا اُس نے بتایا تھا ویسا ہ ہی کیا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "چُنانچہ مُوسیٰ نے سب اِسرائیلیوں میں سے لا لق اشخاص چُنے اور اُنکو ہزار ہزار اور سو سو اور پچاس پچاس اور دس دس آدمیوں کے اوپر حاکم مُقرر کیا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "سو یہی ہر وقت لوگوں کا اِنضاف لگے ۔ مشکل مقدمات تو وہ موسیٰ کے پاس لے آتے تھے پر چھوٹی چھوٹی باتوں کا فیصلہ خُود ہی کر دیتے تھے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "پھر موسیٰ نے اپنے سسر کو رخصت کیا اور وہ اپنے وطن کو روانہ ہو گیا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 19,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "ور بنی اِسرائیل کو جس دن مُلِک مصر سے نکلے تین مہینے ہو ئے اُصی دن وہ سینا کے بیابان میں آئے ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور جب وہ رفیدیم سے روانہ ہو کر سِینا کے بیابان میں آئے تو بیا بان ہی میں ڈیرے لگالئے ۔ سو وہیں پہاڑ کے سامنے اِسرائیلیوں کے ڈیرے لگے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور مُوسیٰ اُس پر چڑھکر خُدا کے پاس گیا اور خُداوند نے اُسے پہاڑ پر سے پُکار کر کہا کہ تو یعقوب کے خاندان سے یوں کہہ اور بنی اِسرائیل کو سُنا دے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "کہ تُم نے دیکھا کہ میں نے مصریوں سے کیا کیا کیا اور تُمکا گویا عُقاب کے پروں بیٹھاکر اپنے پاس لے آیا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "سو اب اگر تُم میری بات مانو اور میرے عہد پر چلو تو سب قوموں میں سے تم ہی میرےمیری خاص مِلکیت ٹھہرو گے کیو نکہ ساری زمیں میری ہے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور تم میرے لئے کاہنوں کی ایک مملکت اور ایک مقدس قوم ہوگے ۔ ان ہی باتوں کو تو بنی اِسرائیل کو سنا دینا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب مُوسیٰ نے آکر اور اُن لوگوں کے بزرگوں کو بلا کر اُنکے رُوبرو وہ سب باتیں جو خُدا وند نے اسے فرمائی تھیں بیان کیں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور سب لوگوں نے ملکر جواب دیا کہ جو کچھ خُداوند نے فرمایا ہے وہ سب ہم کر ینگے اور مُوسیٰ نے لوگوں کا جواب خُداوند کو جا کر سنا یا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور خُداوند نے مُوسیٰ سے کہا کہ دیکھ میں کالے بادل میں اسلئے تیرے پاس آتا ہوں کہ جب میں تُجھ سے باتیں کروں تو یہ لوگ سُنیںاور سدا تیرا یقین کریں اور مُوسیٰ نے لوگوں کی باتیں خُداوند سے بیان کیں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور خُداوند نے مُوسیٰ کہا کہ لوگوں کے پاس جا اور آج اور کل اُنکو پاک کر اور وہ اپنے کپڑے دھولیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور تیسرے دان تیار رہیں کیونکہ خُداوند تیسرے دن لوگوں کو دیکھتے دیکھتے کوہ سینا پر اتریگا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور تو لوگوں کے لئے طرف حد باندھ کر اُن سے کہہ دینا کہ خبردار تُم نہ اس پہاڑ پر چڑھنا اور نہ اسکے دامن کو چھونا ۔ جو کوئی پہاڑ کو چھوئے ضرور جان سے مارڈلا جائے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "مگر اُسے کوئی ہاتھ نہ لگائے بلکہ وہ لا کلام سنگسار کیا جائے یا تیرے چھیدا جائے خواہ وہ انسان ہو خواہ ہو حیوان وہ جیتا نہ چھوڑا جائے اور جب نر سنگا دیر تک پھونکا جائے تو وہ سب پہاڑ کے پاس آجائیں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب مُوسیٰ پہاڑ پر سے اُترکر لوگوں کے پاس گیا اور اُس نے لوگوں کو پاک صاف کیا اور اُنہوں نے اپنے کپڑے دھولئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اُس نے لوگوں سے کہہ کہ تیسرے دن تیار رہنا اور عورت کے نزدیک نہ جانا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "جب تیسرا دن آیا تو صبح ہوتے ہی بادل گرجنے اور بجلی چمکنے لگی اور پہاڑ پر کالی گھٹا چھا گئی اور قرناکی آواز بہت بلند ہوئی اور سب لوگ ڈیروں میں کانپ گئے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور مُوسیٰ لوگوں کو خیمہ گاہ سے باہر لایا کہ خُدا سے مِلائے اور وہ پہاڑ سے نیچے آکھڑے ہوئے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور کوہ سینا اُوپر سے نیچے تک دُھوئیں سے بھر گیا کیونکہ خُداوند شُعلہ میں ہو کر اُس پر اُترا اور دھواں تنُور کے دھوئیں کی طرح اوپر کو اٹھ رہا تھا اور وہ سارا پہاڑ زور سے ہل رہا تھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور جب قرناکی آواز نہایت ہی بلند ہوتی گئی تو مُوسیٰ بولنے لگا اور خُدانے آواز کے ذریعہ سے اُسے جواب دیا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور خُداوند کوہ سینا کی چوٹی پر اُترااور خُدواند نے پہاڑ کی چوٹی پر مُوسیٰ کو بلایا۔سو مُوسیٰ اُوپر چڑھ گیا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور خُداوند نے موسیٰ سے کہا کہ نیچے اتر کر لوگوں کو تاکید اًً سمجھا دے تا ایسا نہ ہو کہ وہ دیکھنے کے لئے حدوں کو توڑ کر خُداوند کے پاس آجائیں اور اُن میں سے بہتیرے ہلاک ہو جائیں۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور کاہن بھی جو خُداوند کے نز دیک آیا کرتے ہیں اپنے تئیں پاک کریں کہیں ایسا نہ ہو کہ خُاوند اُن پر ٹوٹ پڑے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تب مُوسیٰ نے خُداوند سے کہا کہ لوگ کوہ سینا پر نہیں چڑھ سکتے کیونکہ تو نے تو ہمکو تاکیداًً کہا ہے کہ پہاڑ کے چوگرد حد بندی کرکے اُسے پاک رکھو ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "خُادوند نے اُسے کہا نیچے اُتر جا اور ہارون کو اپنے ساتھ لیکرآ پر کاہن اور عوام حدیں توڑ کر خُداوند کے پاس اوپر نہ آئیں تا نہ پڑ ے۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "چنانچہ مُوسیٰ نیچے اتر کر لوگوں کے پاس گیا اور یہ باتیں اُنکو بتائیں ۔",
                    },
                ],
            },
            {
                "chap_num": 20,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُدا نے یہ سب باتیں اُنکو بتائیں۔ ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "خُداوندتیرا خُدا جو تُجھے مُلِک مصر سے غلامی کے گھر سے نکال لایا میں ہُوں۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "میرے حضور تُو غیر معبودوں کو نہ ماننا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تو اپنے لئے کوئی تراشی ہوئی مُورت نہ بنا نا ۔ نہ کسی چیز کی صورت بنانا جو آسمان میں یا نیچے زمین پر یا زمین کے نیچے پانی میں ہے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تو اُنکے آگے سجدہ نہ انکی عبادت کرنا کیونکہ میں خُداوند تیرا خُدا غیور خُدا ہوں اور جو مجھ سے عداوت رکھتے ہیں انکی اولاد کو تیسری اور چوتھی پشت تک باپ دادا کی بدکاری کی سزا دیتا ہوں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور ہزاروں پر جو مجھ سے محبت رکھتے اور میرے حکموں کو مانتے ہیں رحم کرتا ہوں ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تو خُداوند اپنے خُدا کا نام بے فائدہ نہ لینا کیونکہ جو اسکا نام بے فائدہ لیتا ہے خُداوند اسے بے گناہ ٹھہرائیگا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "یاد کر کے سبت کا دن پاک ماننا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "چھ دن تک تو محنت کر کے اپنا سارا کام کاج کرنا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "لیکن ساتواں دن خُداوند تیرے خُدا کا سبت ہے اس میں نہ کوئی کام کرے نہ تیرابیٹا نہ تیری بیٹی نہ تیرا غلام نہ تیری لونڈی نہ تیرا چوپایہ نہ کوئی مسافر جو تیرے ہاں تیرے پھاٹکوں کے اندر ہو۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "کیونکہ خُداوند نے چھ دن میں آسمان اور زمین اور سمندر جو کچھ ان میں ہے وہ سب بنایا اور ساتویں دن آرام کیا اسلئے خُداوند نے سبت کے دن کو برکت دی اور اسے مقدس ٹھہرایا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تو اپنے باپ اور اپنی ماں کی عزت کرنا تاکہ تیری عمر اس مُلِکک میں جو خُداوند تیرا خُدا تُجھے دیتا ہے دراز ہو ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تو خُون نہ کر ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تُو زِنانہ کر۔ّ",
                    },
                    {
                        "verse_num": 15,
                        "text": "تُو چوری نہ کر۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "تو اپنے پڑوسی کے خلاف جھوٹی گواہی دینا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تُو اپنے پڑوسی کے گھر کا لالچ نہ کرنا ۔ تو اپنے پڑوسی کی بیوی کا لالچ نہ کرنا اور نہ اسکے غلام اور اسکی لونڈی اور اسکے بیل اور اسکے گدھے کا اور نہ اپنے پڑوسی کی کسی اور چیز کا لالچ کرنا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور سب لوگوں نے بادل گرجتے اور بجلی چمکتے اور قرناکی آواز ہوتے اور پہاڑ سے دھواں اُٹھتے دیکھا اور جب لوگوں نے دِیکھا تو کانپ اُٹھے اور دور کھٹرے ہوگئے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور مُوسیٰ سے کہنے لگے تُو ہی ہم سے باتیں کیا کر اور ہم سن لیا کریں گے لیکن خُدا ہم سے باتیں نہ کرے تانہ ہو کہ ہم مر جائے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "مُوسیٰ نے لوگوں سے کہا کہ تم ڈرو مت کیو نکہ خُدا اس لئے آیا ہے کہ تمہارا امتحان کرے اور تم کو اُس کا خوف ہو تاکہ تم گناہ نہ کرو ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور وہ لوگوں دور ہی کھڑے رہے اور مُوسیٰ اُس گہری تاریکی کے نزدیک گیا جہاں خُدا تھا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُداوند نے مُوسیٰ سے کہا تُو بنی اِسرائیل سے یہ کہنا کہ تُم نے خود دِیکھاکہ میں نے آسمان پر سے تمہارے ساتھ باتیں کیں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تم میرے ساتھ کسی کو شریک نہ کرنا یعنی چاندی یا سونے کے دیوتا اپنے لئے نہ گھڑلینا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور تو مٹی کی ایک قربانگاہ میرے لئے بنایا کرنا اور اُس پر اپنی بھیڑ بکریوں اور گائے بیلوں کی سوختنی قربانیاں اور سلامتی کی قربانیاں چڑھنا جہاں جہاںمیں اپنے نام کی یاد گاری کراؤنگا وہاں میں تیرے پاس ؤکر تجھے برکت دونگا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اگر تُو میرے لئے پتھر کی قربانگاہ بنائے تو تراشے ہوئے پتھر سے بنانا کیونکہ اگر تو اس پر اپنے اوزار لگائے تو تُو اسے ناپاک کر دیگا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور تُو اُس پرسیڑھیو ں سے ہر گز نہ چڑھناتانہ ہو کہ تیری برہنگی اُس پر ظاہر ہو۔",
                    },
                    
                ],
            },
            {
                "chap_num": 21,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "وہ احکام جو تُجھے اُنکو بتانے ہیں یہ ہیں۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اگر تو کوئی عبرانی غلام خریدے تو وہ چھ برس خدمت کرے اور ساتویں برس مُفت آزاد ہو کر چلاجائے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اگر وہ اکیلاآیا ہو تو اکیلا ہی چلا جائے اور اگر وہ بیاہا ہو تو اُسکی بیوی بھی اُسکے ساتھ جائے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اگر اُسکے آقانے اُسکا بیا ہ کرایا ہو اور اُس عورت کے سے بیٹے اور بیٹیاں ہوئی ہوں تو وہ عورت اور اُسکے بچےاُس آقا کے ہو کر رہیں اور وہ اکیلا چلا جائے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "پر اگر وہ غلام صاف کہہ دے کہ میں اپنے آقا سے اور اپنی بیوی اور بّچوں سے محبّت رکھتا ہوں ۔ میں آزاد ہو کر نہیں جائُونگا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تو اُسکا آقا اُسے خُدا کے پاس لے جائے اور اُسے دروازہ پر ےا دروازہ کی چوکھٹ پر لاکر سُتاری سے اُسکا کان چھیدے تب وہ ہمیشہ اُسکی خدِمت کرتا رہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اگر کوئی شخص اپنی بیٹی کو لوَنڈی ہونے کے لئے بیچ ڈالے تو وہ غلا موں کی طرح چلی نہ جائے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اگر اْ سکا آقا جِس نے اْس سے نِسبت کی ہے اْسے خوْش نہ ہو تو وہ اْسکا فِدیہ منظْور کرے پر اْسے یہ اِختیار نہ ہو گا کہ اْسکو کسِی اجنبی قَوم کے ہاتھ بیچے کیونکہ اْس نے اْس سے دغابازی کی۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور اگر وہ اُسکی نِسبت اپنے بیٹے سے کر دے تو وہ اُس سے بیٹیوں سا سلُوک کرے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اگر وہ دُوسری عورت کر لے تو بھی وہ اُس کے کھا نے کپڑے اور شادی کے فرض سے قاصر نہ ہو ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اگر وہ اُس سے یہ تینوں باتیں نہ کرے تو وہ مُفت بے روپے دِئے چلی جائے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اگر کوئی کسِی آدمی کو اَیسا مارے کہ وہ مرجائے تو وہ قطعی جان سے مارا جائے",
                    },
                    {
                        "verse_num": 13,
                        "text": "پر اگر وہ شخص گھات لگا کر نہ بیٹھا ہو بلکہ خُدا ہی نے اُسے اُسکے حوالہ کر دیا ہو تو مَیں اَیسے حال میں ایک جگہ بتادُونگا جہاں وہ بھاگ جائے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اگر کوئی دِیدہ ودانِستہ اپنے ہمسایہ پر چڑھ آئے تاکہ اُسے مکر سے مار ڈالے تو تُو اُسے میری قُربانگا ہ سے جُدا کر دینا تاکہ وہ مارا جائے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جو کوئی اپنے باپ یا اپنی ماں کو مارے وہ قطعی جان سے مارا جائے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور جو کوئی کِسی آدمی کو چُرائے خواہ وہ اُسے بیچ ڈالے خواہ وہ اُسکے ہاں ملے وہ قطعی مار ڈالا جائے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جو اپنے باپ یا اپنی ماں پر لعنت کرے وہ قطعی مار ڈالا جاے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اگر وہ شخص جھگڑیں اور ایک دُوسرے کو پتھر یا مُکا مارے اور وہ مر ے تو نہیں پر بستر پر پڑا رہے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تو جب وہ اُٹھکر اپنی لاٹھی کے سہارے باہر چلنے پھرنے لگے تب وہ جِس نے مارا تھا بری ہو جائے اور فقط اُسکا ہرجانہ بھر دے اور اُسکا پورا علاج کرا دے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اگر کوئی اپنے غُلام یا لَونڈی کو لاٹھی سے ایسا مارے کہ وہ اُسکے ہاتھ سے مر جائے تو اُسے ضرور سزا دی جائے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "لیکن اگر وہ ایک دُو دِن جِیتا رہے تو آقا کو سزا نہ دی جائے اِسلئے کہ وہ غُلام اُسکا مال ہے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اگر لوگ آپس میں مار پیٹ کریں اور کسی حاملہ کو ایسی چوٹ پہنچایئں کہ اُسے اِسقاط ہو جائے پر اور کوئی نُقصان نہ ہو تو اُس سے جتنا جُرمانہ اُسکا شوہر تجویز کرے لیا جائے اور وہ جس طرح قاضی فیصلہ کریں جُرمانہ بھر دے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "لیکن اگر نُقصان ہو جائے تو تُو جان کے بدلے جان لے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور آنکھ کے بدلے آنکھ ۔ دانت کے بدلے دانت اور ہاتھ کے بدلے ہاتھ ۔ پاؤں کے بدلے پاؤں ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "جلانے کے بدلے جلانا ۔ زخم کے بدلے زخم اور چوٹ کے بدلے چوٹ ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور اگر کوئی اپنے غُلام یا اپنی لونڈی کی آنکھ پر ایسا مارے کہ وہ پُھوٹ جائے تو وہ اُسکے آنکھ کے بدلے اُسے آزاد کر دے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اگر کوئی اپنے غُلام یا اپنی لونڈی کا دانت مار کر توڑ دے تو وہ اُسکے دانت کے بدلے اُسے آزاد کر دے ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اگر بیل کسی مرد یا عورت کو اِیسا سِینگ مارے کہ وہ مر جائے تو وہ بیل ضرور سنگسار کیا جائے اور اُسکا گوشت کھا یا نہ جائے لیکن بیل کا مالک بے گناہ ٹھہرے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "پر اگر اُس بیل کی پہلے سے سَینگ مارنے کی عادت تھی اور اُسکے مالک کو بتا بھی دیا گیا تھا تو بھی اُس نے اُسے باندھکر نہیں رکھا اور اُس نے کِسی مرد یا عورت کو مار دیا ہو تو بیل سنگسار کیا جائے اور اُسکا مالک بھی مارا جائے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور اگر اُس سے خُون بہامانگا جائے تو اُسے اپنی جان کے فدیہ میں جتنا اُسکے لِئے ٹھہرایا جائے اُتنا ہی دینا پڑیگا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "خواہ اُسنے کسی کے بیٹے کو مارا ہو یا بیٹی کو اِسی حُکم کے مُوافق اُسکے ساتھ عمل کیا جائے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اگر بیل کسی کے خُلام یا لونڈی کو سینگ سے مارے تو مالک اُس غُلام یا لونڈی کے مالک کو تیس مِثقال روپے دے اور بیل سنگسار کیا جائے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور اگر کوئی آدمی گڑھا کھولے یا کھودے اور اُسکا مُنہ نہ ڈھانپے اور کوئی بیل یا گدھا اُس میں گر جاے ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "تو گڑھے کا مالک اِسکا نُقصان بھر دے اور اُنے کے مالک کو قمیت دےاور مرے ہو ئے جانور کو خُود لےلے ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اگر کسی کا بیل دُوسرے کے بیل کو اَیسی چوٹ پہنچائے کہ وہ مر جائے تو وہ جِیتے بیل کو بیچیں اور اُسکا دام آدھا آدھا آپس میں بانٹ لیں اور اِس مرے ہو ئے بیل کو اَیسے ہی بانٹ لیں ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور اگر معلوم ہو جائے کہ اُس بیل کی پہلے سے ہی سینگ مارنے کی عادت تھی اور اُسکے مالک نے اُسے باندھکر نہیں رکھا تو اُسے قطعی بیل کے بدلے بیل دِینا ہو گا اور وہ مرا ہوا جانور اُسکا ہوگا",
                    },
                    
                ],
            },
            {
                "chap_num": 22,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اگر کوئی آدمی بیل یا بھیڑچُرالے اور اُسے ذبح کر دے یا بیچ ڈالے تو وہ ایک بیل کے کے بدلے پانچ بیل اور ایک بھیڑکے بدلے چار بھیڑیں بھرے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اگر چور سیندھ مارتے ہو ئے پکڑا جائے اور اُس پر اَیسی مار پڑے کہ وہ مر جائے تو اُسکے خُون کا کوئی جُرم نہیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اگر سوْرج نکل چکے تو اُس کا خون جرم ہو گا بلکہ اسے نقصان بھرنا پڑیگا اور اگر اُسکے پاس کچھ نہ ہو تو وہ چوری کے لئے بیچا جائے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اگر چوری کا مال اسکے پاس جیتا مِلے خُواہ وہ بیل ہو یا گدھا یا بھیڑ تو وہ اسکا دُونا بھر دے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اگر کوئی آدمی کسی کھیت یا تاکِستان کو کھلوا دے اور اپنے جانور کو چھوڑ دے کہ وہ دوسرے کے کھیت کو چرلے تو اپنے کھیت یا تاکستان کی اچھی سے اچھی پیداوار میں سے اسکا معاوضہ دے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اگر آگ بھڑ کے اور کانٹو ں میں لگ جائے اور اناج کے ڈھیر یا کھڑی فصل یا کھیت کو جالا کر بھسم کر دے تو جس نے آگ جلائی ہو وہ ضرور معاوضہ دے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اگر کوئی اپنے ہمسایہ کو نقد یا جنس رکھنے کو دے اور وہ اُس شخص کے گھر سے چوری ہو جائے تو اگر چور پکڑا جائے تو دونا اُسکو بھرنا پڑیگا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پر اگر چور پکڑا نہ جائے تو اُس گھر کا مالک خُدا کے آگے لایا جائے تا کہ معلوم ہو جائے کہ اُس نے اپنے ہمسایہ کے مال کو ہاتھ نہیں لگایا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "ہر قسم کی خیانت کے معاملہ میں خواہ بیل کا خواہ گدھے یا بھیڑیا کپڑے یا لسی اور کھوئی ہوئی چیز کا ہوجسکی نسبت کو ئی بول اُٹھے کہ وہ چیز یہ ہے تو فریقین کا مُقدمہ خُدا کے حضور لا یا جائے اور جسے خُدا مجرم ٹھہرائے وہ اپنے ہمسایہ کو دونا بھر دے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اگر کوئی اپنے ہمسایہ کے پاس گدھا یا بیل یا بھیڑیا کوئی اور جانور امانت رکھے اور وہ بغیر کسی کے دیکھے مر جائے یا چوٹ کھا ئے یا ہنکا دیا جائے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تو ان دونوں کے درمیان خُداوند کی قسم ہو کہ اُس نے اپنے ہمسایہ کے مال کو ہاتھ نہیں لگایا اور مال کو ہاتھ نہیں لگایا اور مالک اسے سچ مانے اور دوسرا اسکا معاوضہ نہ دے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پر اگر وہ اسکے پاس سے چوری ہو جائے تو وہ اسکے مالک کو معاوضہ دے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اگر اسکو کسی درندے نے پھاڑ ڈالا ہو تو وہ اسکو گواہی کے طور پیش کردے اور پھاڑے ہوئے کا نقصان نہ بھرے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اگر کوئی شخص اپنے ہمسایہ سے کوئی جانور عاریت لے اور وہ زخمی ہوجئے یا مر جائے اور مالک وہاں موجود نہ ہو تو وہ ضرور اسکا معاوضہ دے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "پر اگر مالک ساتھ ہو تو اسکا نقصان نہ بھرے اور اگر کرایہ کی ہوئی چیز ہو تو اسکا نقصان اسکے کرایہ میں آگیا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اگر کوئی آدمی کسی کنواری کو جسکی نسبت نہ ہوئی ہو پھسلا کر اس سے مبا شرت کرے تو وہ ضرور ہی اسے مہر دیکر اس سے بیاہ کرے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "لیکن اگر اسکا باپ ہرگز راضی نہ ہو کہ اس لڑکی کو اسے دے تو وہ کنواریوں کے مہر کے موافق اسے نقدی دے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تو جادو گرنی کو جینے نہ دینا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "جو کوئی کسی جانور سے مبا شرت کرے وہ قطعی جان سے ماراجائے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "جو کوئی واحد خُداوند کو چھوڑ کر کسی اور معبود کے آگے قربانی چڑھائے وہ بالکل نا بود کر دیا جائے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور تو مسافر کو نہ ستانا نہ اس پر ستم کرنا اسلئےب کہ تم بھی مُلِک مصر میں مسافر تھے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "تم کسی بیوہ یا یتیم لڑکے کو دکھ نہ دینا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اگر تو انکو کسی طرح سے دکھ دے اور وہ مجھ سے فریاد کریں تو مَیں ضرور انکی فریاد سنونگا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور میرا قہر بھڑ کیگا اور میں تمکو تلوار سے مار ڈالونگا اور تمہاری بیویاں بیوہ اور تمہارے بچے یتیم ہوجا ئینگے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اگر تو میرے لوگوں میں سے کسی مُحتاج کو جو تیرے پاس رہتا ہو کچھ قرض دے تو اس سے قرضخواہ کی طرح سلُوک نہ کرنا اور نہ اس سے سود لینا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اگر تو کسی وقت اپنے ہمسایہ کے کپڑے گرد رکھ بھی لے تو سورج کے ڈوبنے تک اسکو واپس کر دینا ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "کیونکہ فقط وہی اسکا ایک اوڑھنا ہے۔ اسکے جسم کا وہی لباس ہے۔ پھر وہ کیا اوڑھکر سوئیگا ؟ پس جب وہ فریاد کریگا تو میں اسکی سنونگا کیونکہ میں مہربان ہوں۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "تُو خُدا کو نہ سُنا اور نہ اپنی قوم کے سردار پر لعنت بھیجنا۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "تُو اپنی کثیر پیدا وار اور اپنے کو لُھو کے رس میں سے مجھے نذر دنیازدینے ص میں دیر نہ کر نا اور اپنے بیٹوں میں سے پہلوٹھے کو مجھے دینا۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اپنی گایوں اور بھیڑوں سے بھی اِیسا ہی کر نا ۔ سات دن تک تو بچہ اپنی ماں کے ساتھ رہے ۔ آٹحویں دن تُو اُس کو مجھے دینا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تم میرے لئے پاک آدمی ہو نا ۔اِسی سبب سے درِندوں کے پھاڑے ہُو ئے جانور کا گوشت جو میدان میں پڑا ہو ا ملے مت کھا نا ۔ تُم اُسے کُتوں کے آگے پھینک دینا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 23,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تُو جھوٹی بات نہ پھیلانا اور نا راست گواہ ہو نے کے لئے شرِیروں کا ساتھ نہ دینا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "بُرائی کرنے کے لئے کِسی بھیڑ کی پیروی نہ کرنا اور نہ کسی مُقدمہ میں اِنصاف کا خُون کرانے کے لئے بھیڑ کا مُنہ دیکھ کر کُچھ کہنا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور نہ مُقدمہ میں کنگال کی طرفداری کرنا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تُو تیرے دُشمن کا بیل یا گدھا تُجھے بھٹکتا ہوا ملے تو تُو ضرور اُسے اُسکے پاس پھیر کر لے آنا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اگر تُو اپنے دُشمن کے گدھے کو بوجھ کے نیچے دبا ہوا دیکھے اور اُسکی مدد کرنے کو جی بھی نہ چاہتا ہو تو بھی ضرور اُسے مدد دینا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تُو اپنے کنگال لوگوں کے مُقدمہ میں اِنصاف کا خُون نہ کر نا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "جُھوٹے مُعاملہ سے دُور رہنا اور بے گُناہوں اور صادِقوں کو قتل نہ کرنا کیو نکہ مَیں شریرکو راست نہیں ٹھہراؤنگا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تُو رِشوت نہ لینا کیو نکہ رِشوت بِیناؤں کو اندھا کر دیتی ہے اور صادقوں کی با توں کو پلٹ دیتی ہے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور پردیسی پر ظُلم نہ کرنا کیو نکہ تُم پردیسی کے دل کو جانتے ہو اِسلئے کہ تُم خُود بھی مُلِک مصر میں پردیسی تھے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور چھ برس تک تُو زمین میں بونا اور اُسکا غلّہ جمع کر نا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "پر ساتویں برس اُسے یُوں ہی چھوڑدینا کہ پڑتی رہے تاکہ تیری قُوم کے مسکین اُسے کھایئں اور جو اُن سے بچے اُسے جنگل کے جانور چرلیں ۔ اپنے انگور اور زیتون کے باغ سے بھی اَیسا ہی کرنا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "چھ دن تک اپنا کام کاج کرنا اور ساتویں دن آرام کرنا تاکہ تیرے بیل اور گدھے کو آرام مِلے اور تیری لَونڈی کا بیٹا اور پردیسی تازہ دم ہو جایئں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور تُم سب باتوں میں جو مَیں نے تُم سے کہی ہیں ہوشار رہنا اور دُوسرے معبُودوں کا نام تک نہ لینا بلکہ وہ تیرے مُنہ سے سُنائی بھی نہ دے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تُو سال بھر میں تین بار میرے لِئے عید منانا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "عید فطیر کو ماننا ۔ اپس میں میرے حُکم کے مُطابق ابیب مہینے کے مُقّررہ وقت پر سات دِن تک بے خمیری روٹیاں کھانا ( کیو نکہ اُسی مہینے میں تُو مِصر سے نکلا تھا ) اور کو ئی میرے آگے خالی ہاتھ نہ آئے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور جب تیرے کھیت میں جِسے تُو نے محنت سے بویا پہلا پھل آئے تو فصل کا ٹنے کی عید ماننا اور سال کے آخر میں جب تُو اپنی مِحنت کا پھل کھیت سے جمع کرے تو جمع کرنے کی عید منانا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور سال میں تینوں مرتبہ تُمہارے ہاں کے سب مرد خُداوند خُدا کے آگے حاضر ہو ا کریں ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تُو خمیری روٹی کے ساتھ میرے ذبیحہ کا خُون نہ پڑھا نا اور میری عید کی چربی صُبح تک باقی نہ رہنے دینا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تُو اپنی زمین کے پہلے پھلوں کا پہلا حِصہ خُداوند اپنے خُدا کے گھر میں لانا ۔ تُو حلوان کو اُسکی ماں کے دُودھ میں نہ پکانا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "دیکھ مَیں ایک فرشتہ تیرے آگے بھیجتا ہوں کہ راستہ میں تیرا نگہبان ہو اور تجھے اُس جگہ پہنچا دے جسے مَیں نے تیار کیا ہے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تُم اُسکے آگے ہوشار رہنا اور اُسکی بات ماننا ۔ اُسے ناراض نہ کرنا کیو نکہ وہ تُمہاری خطا نہیں بخشیگا اِسلئے کہ میرا نام اُس میں رہتا ہے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "پر اگر تُو سچ مچ اُسکی بات مانے اور جو مَیں کہتا ہوں وہ سب کرے تو مَیں تیرے دُشمنوں کا دُشمن اور تیرے مُخالِفوں کا مُخالف ہُونگا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اِسلئے کہ میرا فرشتہ تیرے آگے آگے چلیگا اور تجھے اموریوں اور حِتّیوں اور فرزّیوں اور کنعانیوں اور حوّیوں اور یبوسیوں میں پہنچا دیگا اور مَیں انکو ہلاک کر ڈالُونگا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تُو اُنکے معُنودوں کو سجدہ نہ کر نا نہ اُنکی عبادت کر نا نہ انکے سے کام کر نا بلکہ اُنکو بالکل اُلٹ دینا اور اُنکے سُتونوں کو ٹُکڑے ٹُکڑے کر ڈالنا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور تُم خُداوند اپنے خُدا کی عبادت کرنا تب وہ تیری روٹی اور پانی پر برکت دیگا اور مَیں تیرے بیچ سے بیماری کو دُور کر دُونگا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور تیرے مُلک میں نہ تو کسی کے اِسقاط ہو گا اور نہ کوئی بانجھ رہیگی اور مَیں تیری عمر پوری کرونگا ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "مَیں اپنی ہیبت کو تیرے آگے آگے بھیجونگا اور مَیں اُن سب لوگوں کو جنکے پاس تُو جائیگا شکت دُونگا اور مَیں اَیسا کرونگا کہ تیرے سب دُشمن تیرے آگے اپنی پُشت پھیردینگے ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "مَیں تیرے آگے زنبوُروں بھیجونگا جو حوّی اور کنعانی اور حِتّی کو تیرے سامنے سے بھگا دینگے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "مَیں اُنکو ایک ہی سال میں تیرے آگے سے دُور نہیں کرونگا تا نہ ہو کہ زمین ویِران ہو جائے اور جنگلی دِرندے زیادہ ہو کر تجھے ستانے لگیں ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "بلکہ مَیں تھوڑا تھوڑا کر کے اُنکو تیرے سامنے سے دُور کرتا رہونگا جب تک تُو شُمار میں بڑھ کر مُلک کا وارث نہ ہو جائے ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "مَیں بِحرقُلزم سے لے کر فلستیوں کے سمندر تک اور بیابان سے لےکر نِہر فرات تک تیری حدّیں با ندھُونگا کیونکہ مَیں اُس مُلک کے باشندوں کو تُمہارے ہاتھ میں کردُونگا اور تُو اُنکو اپنے آگے سے نکا ل دیگا ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "تُو اُن سے یا اُنکے معبودوں سے کوئی عہد نہ باندھنا ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "وہ تیرے مُلک میں رہنے نہ پایئں تا نہ ہو کہ وہ تجھ سے میرے خِلاف گُناہ کرایئں کیو نکہ اگر تُو اُن کے معبودوں کی عبا دت کرے تو یہ تیرے لِئے ضرور پھنداہوجائیگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 24,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اُس نے مُوسیٰ سےکہا کہ تُو ہارُون اور ندب اور ابہیو اور بنی اِسرائیل کے ستر بُزرگو ں کو لیکر خپداوند کے پاس اُوپر آاور تُم دُور ہی سے سجدہ کرنا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور مُو سیٰ اکیلا خُداوند کے نزدیک آئے پر وہ نزدیک نہ آئیں اور اَور لو گ اُسکے ساتھ اُوپر نہ چڑھیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور مُو سیٰ نے لو گو ں کے پاس جا کر خُداوند کی سب با تیں اوراحکام اُنکو بتا دِئے اور سب لو گو ں نے ہم آواز ہو کر جو اب دِیا کہ جِتنی با تیں خُداوند نے فرما ئی ہیں ہم اُن سب ما ئنیگے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور مُو سیٰ نے خُداوند کیسب با تیں لکھ لیں اور صُبح کو سو یرے اُٹھ کر پہاڑ کے نیچے ایک قُر با نگاہ اور بنی اِسرائیل کے بارہ قبیلوں کے حساب سے بارہ سُتون بنائے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُس نے بنی اِسرائیل کے جو انو ں کو بھیجا جنہوں نے سو ختنی قُر با نیاں چڑھا ئیں اور بیلوں کو ذبح کر کے سلامتی کے ذبحیے خُداوند کے لئے گُذرانے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور مُوسیٰ نے آدھا خُون لیکر با سنوں میں رکھّا اور آدھا قُربانگاہ پر چھڑک دیا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "پھر اُس نے عہد نامہ لیا اور لو گوں کو پڑھکر سُنا یا ۔ اُنہوں نے کہا کہ جو کُچھ خُداوند نے فرما یا ہے اُس سب کو ہم کر نیگے اور تا بع رہے گئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب مُو سیٰ نے اُس خُون کو لیکر لو گوں پر چھڑکا اور کہا دیکھو یہ اُس عہدکا خُون ہے جو خُداوند نے اِن سب با توں کے بارے میں تُمہارے ساتھ با ند ھا ہے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "تب مُو سیٰ اور ہا رُون اور ندب اور ابہیو اور بنی اِسرائیل کے ستّربُزرگ اُوپر گئے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُنہوں نے اِسرائیل کے خُدا کو دیکھا اور اُسکے پاؤں کے نیچے نیلم کے پتھر کا چبُوترا سا تھا جو آسمان کی ما نند شفاف تھا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُس نے بنی اِسرائیل کے شرفا پر اپنا ہا تھ نہ بڑھا یا ۔ سو اُنہوں نے خُدا کو دیکھا اور کھا یا اور پِیا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خُداوند نے مُوسیٰ سے کہا کہ پہاڑپر میرے پاس آاور وہیں ٹھہرا رہ اور مَیں تجھے پتھر کی لَو حیں اور شریعت اور احکام جو مَیں نے لکھّےہیں دُونگا تاکہ تُو اُنکو سکھا ئے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور مُوسیٰ اور اُسکا خادم یشوع اُٹھے اور مُوسیٰ خُدا کے پہاڑ کے اُوپر گیا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور بُزرگوں سے کہہ گیا کہ جب تک ہم لَوٹکر تُمہارے پاس نہ آجا ئیں تُم ہمارے لئے یہیں ٹھہر ے ر ہو اور دیکھو ہا رُون اور جو تُمہارے ساتھ ہیں ۔ جِس کسی کا کو ئی مُقدّمہ ہو وہ اُنکے پاس جا ئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "تب مُوسیٰ پہاڑ کے اُوپر گیا اور پہاڑ پر گھٹا چھا گئی ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور خُداوند کا جلال کوہِ سینا پر آکر ٹھہر ا اور چھ دن تک گھٹا اُس پر چھا ئی ر ہی اور ساتویں دن اُس نے گھٹا میں سے مُوسیٰ کو بُلایا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور بنی اِسرائیل کی نگاہ میں پہاڑ کی چو ٹی پر خُداوند کے جلال کا منظربھسم کر نے والی آگ کی مانند تھا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور مُوسیٰ گھٹا کے بیچ میں ہو کر پہاڑ پر چڑھ گیا اور وہ پہاڑ پر چا لیس دن اور چا لیس رات ر ہا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 25,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے مُوسیٰ کو فرمایا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "بنی اِسرائیلی سے یہ کہنا کہ میرے لئے نذر لا ئیں اور تُم اُن ہی سے میری نذر لینا جو اپنے دل کی خُوشی سے دیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور جن چیزوں کی نذر تُمکو اُن سے لینی ہے وہ یہ ہیں :۔ سو نا اور چاند ی اور پیتل ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور آسمانی اور ارغوانی اور سُر خ رنگ کا کپڑا اور باریک کتان اور بکری کی پشم ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور مینڈھوں کی سُرخ رنگی ہو ئی کھالیں اور تخس کی کھالیں اور لیکر کی لکڑی ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور چراغ کے لئے تیل اور مسح کر نے کے تیل کے لئے اور بخُور کے لئے مصا لح ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور سنگ سلُیمانی اور افُود اور سینہ بند میں جڑانے کے نگینے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور وہ میرے لئے ایک مُقدس بنائیں تاکہ مَیں اُنکے درمیان سکُونت کُروں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور مسکن اور اُسکے سارے سامان کا جو نمونہ مَیں تجھے دکھاؤں ٹھیک اُسی کے مُطابق تُم اُسے بنانا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور وہ لیکر کی لکڑی کی ایک صنُدوق بنا ئیں جسکی لمبائی ڈھائی ہا تھ اور چوڑائی ڈیڑھ ہاتھ اور اُونچائی ڈیڑھ ہا تھ ہو ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور تُو اُسکے اندر اور با ہر خا لص سو نا منڈھنا اور اُسکے اُوپر گرداگرد ایک زرّین تا ج ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اُسکے لئے سو نے کے چار کڑے ڈھالکراُسکے چاروں پا یوں میں لگا نا ۔ دو کڑے ایک طرف ہو ں اور دوہی دُوسری طرف ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور لیکر کی لکڑی کی چوبیں بنا کر اُن پر سو نا منڈھنا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اِن چوبوں کو صنُدوق کے اطراف کے کڑوں میں ڈالنا کہ اُنکے سہارے صنُدوق اُٹھ جا ئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "چو بیں صنُدوق کے کڑوں کے اندر لگی رہیں اور اُس سے الگ نہ کی جا ئیں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور تُو اُس شہادت نا مہ کو جو مَیں تجھےدُونگا اُسی صنُدوق میں رکھنا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور تُو کفّارہ کا سر پوش خالص سو نے کا بنا نا جِسکا طُول ڈھائی ہاتھ اور عرض ڈیڑھ ہاتھ ہو ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور سونے کے دو کروبی سرپوش کے دونوں سروں پر گھڑکر بنا نا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "ایک کر وبی کو ایک سرے پر اور دُوسرے کروبی کو دُوسرے سرے پر لگانا اور تُم سر پو ش کو اور دونو ں سروں کے کروبیوں کو ایک ہی ٹُکڑے سے بنا نا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور وہ کروبی اِس طرح اوپر کواپنے پر پھیلاےہوں کہ سر پوش کو اپنے پروش ڈھانک لے اور اُن کے منہ آمنے سامنے سر پوش کی طرح ہوں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور تُو اُس سر پوش کو اُس صنُدوق کے اُوپر لگا یا اور وہ عہد نا مہ جو مَیں دُونگا اُسے اُس صنُدوق کے اندر رکھنا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "وہاں مَیں تجھ سے ملا کرونگا اور اُس سر پوش کے اُوپر سے اور کروبیوں کے بیچ میں سے جو عہد نا مہ کے صنُدوق کے اُوپر ہو نگے اُن سب احکام کے بارے میں جو مَین بنی اِسرائیل کے لئے تجھے دُونگا تجھ سے بات چِیت کیا کرُرنگا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور تُو دو ہا تھ لمبی اور ایک ہاتھ چو ڑی اور ڈیڑھ ہا تھ اُونچی کیکر کی لکڑی کی ایک میز بھی بنا نا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُسکو خا لص سو نے سے منڈھنا اور اُسکے گردا گرد ایک زرّین تاج بنا نا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اُسکے چَوگردچار اُنگل چوڑی ایک کنگنی لگانا اور اُس کنگنی کے گردا گرد ایک زرّین تا ج بنا نا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور سو نے کے چار کڑے اُسکے لئے بنا کر کڑوں کو چاروں کو نو ں میں لگا نا جو چاروں پایوں کے مُقابل ہو نگے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "وہ کڑے کنگنی کے پاس ہی ہوں تاکہ چوبوں کے واسطے جنکے سہارے میز اُٹھائی جا ئے گھروں کا کام دیں ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور کیکر کی لکڑی کی چوبیں بنا کر اُنکو سونے سے منڈ ھنا تاکہ میز اُنہی سے اُٹھائی جائے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور تُو اُسکے طباق اور چمچے اور آفتابے اور اُنڈیلنے کے بڑے بڑے کٹورے سب خالص سو نے کے بنا نا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور تُو اُس میز پر نذر کی رو ٹیاں ہمیشہ میرے رُو برُو رکھنا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تُوخالص سو نے کا ایک شمعدان بنا نا ۔ وہ شمعدان اور اُسکا پایہ اور ڈنڈی سب گھڑ کر بنا ئے جا ئیں اور اُسکی پیالیاں اور لٹو اور اُسکے پُھول سب ایک ہی ٹُکڑے کے بنے ہوں ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اُسکے دونوں پہلُوؤں سے چھ شا خیں با ہر کو نکلتی ہو ں ۔تین شا خیں شمعدان کے ایک پہلُو سے نکلیں اور تین دُوسرے پہلُو سے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "ایک شا خ میں با دام کے پُھول کی صورت کی تین پیا لیا ں ۔ ایک لٹو اور ایک پُھول ہو اور دُوسری شا خ میں بھی با دام کے پُھو ل کی صُورت کی تین پیا لیا ں ایک لٹو اور ایک پُھول ہو ۔ اِسی طرح شمعدان کی چھؤں شا خوں میں یہ سب لگا ہو ا ہو ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور خُود شمعدان میں بادام کے پُھول کی صُورت کی چار پیا لیا اپنے اپنے لٹو اور پھول سمیت ہو ں ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور دو شا خوں کے نیچے ایک لٹو ۔ سب ایک ہی ٹُکڑے کے ہوں اور پھر دو شاخو ں کے نیچے ایک لٹو ۔ سب ایک ہی ٹُکڑے کے ہوں ۔ شمعدان کی چھؤں با ہر کو نکلی ہو ئی شا خیں اَیسی ہی ہو ں ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "یعنی لٹو اور شاخیں اور شمعدان سب ایک ہی ٹُکڑے کے بنے ہوں ۔ یہ سب کا سب خا لص سو نے کے ایک ہی ٹُکڑے سے گھڑ کر بنا یا جا ئے ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور تُو اُسکے لئے چراغ بنا نا ۔ یہی چرالائیں تاکہ شمعدان کے سامنے روشنی ہو ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور اُسکے گُلگیر اور گُلدان خا لص سو نے کے ہوں ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "شمعدان اور یہ سب ظروف ایک قنطار خا لص سو نے کے بنے ہُو ئے ہوں ۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "اور دِیکھ تُو اِنکو ٹھیک اِنکے نمونہ کے مُطابق جو تجھے پہاڑ پر دکھایا گیا بنا نا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 26,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور تُو مسکن کے لئے دس بنانا ۔ یہ بٹے ہو ئے باریک کتان اور آسمانی قِرمزی اور سُرخ رنگ کے کپڑوں کے ہو ں اور اِن میں کسی ماہر اُستاد سے کروبیوں کی صُورت کڑھوانا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "ہر پردہ کی لمبائی اٹھائیس ہاتھ اور چوڑائی چار ہاتھ ہو اور سب پردے ایک ہی نا پ کے ہوں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور پا نچ پر دے ایک دُوسرے سے جو ڑے جا ئیں ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور تُو ایک بڑے پردہ کے حا شیہ میں بٹے ہُو ئے کنا رے کی طرف جو جو ڑا جا ئیگا آسمانی رنگ کے تُکمے بنا نا اور اَیسے ہ دُوسرے بڑے پردہ کے حا شیہ میں جو اِسکے ساتھ ملا یا جا ئیگا تُکمے بنا نا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "پچاس تُکمے ایک بڑے پردہ میں بنا نا اور پچاس ہی دُوسرے بڑے پردہ کے حا شیہ میں جو اِسکے ساتھ ملا یا جا ئیگا بنا نا اور سب تُکمے ایک دُوسرے کے آمنے سا منے ہو ن ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور سو نے کی پچاس گُھنڈیا ں بنا کر اِن پردوں کو اِن ہی گُھنڈیوں سے ایک دُوسر ے کے ساتھ جوڑ دینا ۔ تب وہ مسکن ایک ہو جائیگا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور تُو بکری کے بال کے پردے بنا نا تاکہ مسکن کے اُوپر خیمہ کا کام دیں ۔ اَیسے پردے گیارہ ہو ں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور ہر پردہ کی لمبا ئی تیس ہاتھ اور چو ڑائی چار ہا تھ ہو ۔ وہ گیارہ ہوں ۔ پردے ایک ہی نا پ کے ہو ں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور تُو پا نچ پردے ایک جگہ اور چھ پر دے ایک جگہ آپس میں جوڑ دینا اور چھٹے پردہ کو خیمہ کے سامنے موڑ کر دُہرا کر دینا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور تُو پچا س تُکمے اُس پردہ کے حاشیہ میں جو با ہر سے ملا یا جائیگا اور پچاس ہی تُکمے دُوسری طرف کے پردے کے حاشیہ میں جو با ہر سے ملا یا جا ئیگا بنا نا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور پیتل کی پچاس گُھنڈیاں بنا کر اِن گُھنڈیوں کو تُکموں میں پہنا دینا اور خیمہ کو جو ڑ دینا تاکہ وہایک ہو جا ئے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خیمہ کے ہر دوں کا لٹکا ہو ا حصّہ یعنی آدھا پردہ جو بچ رہیگاوہ مسکن کی پچھلی طرف لٹکا ر ہے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور خیمہ کے پردوں کی لمبائی کئ با قی حصّہ میں سے ایک ہا تھ پر دہ اِدھر سے اور ایک ہا تھ پر دہ اُدھر سے مسکن کی دونوں طرف اِدھر اور اُدھر لٹکا ر ہے تا کہ اُسے ڈھا نک لے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور تُو اِس خیمہ کے لئے مینڈھو ں کی سُرخ رنگی ہو ئی کھالوں کا غلاف اور اُسکے اُوپر تخسوں کی کھا لو ں کا غلاف بنانا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور تُو مسکن کے لئے کیکر کی لکڑی کے تختے بنانا کہ کھڑے کئے جائیں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "ہر تختہ کی لمبا ئی دس ہا تھ اور چوڑائی ڈیڑھ ہا تھ ہو۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور ہر تختہ میں دو دو چُولیں ہو ں جو ایک دُو سری سے ملی ہو ئی ہو ں ۔ مسکن کے سب تختے اِسی طرح کے بنا نا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور مسکن کے لئے جو تختے تُو بنا ئیگا اُن میں سے بیس تختے جنوبی سمت کے لئے ہوں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اِن بیسوں تختوں کے نیچے چا ندی کے چا لیس خا نے بنا نا یعنی ہر ایک تختہ کے نیچے اُسکی دونوں چُولوں کے لئے دو دو خا نے ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور مسکن کی دُوسری طرف یعنی شما لی سمت کے لئے بیس تختے ہو ں",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُنکے لئے بھی چا ندی کے چا لیس ہی خا نے ہو ں یعنی ایک تختہ کے نیچے دو دو خا نے ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور مسکن کے پچھلے حصّہ کے لئے مغربی سمت میں چھ تختے بنا نا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُسی پچھلے حصّہمیں مسکن کے کو نو ں کے لئے دو تختے بنا نا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "یہ نیچے سے دُہر ے ہو ں اور اِسی طرح اُوپر کے سر ے تک آکر ایک حلقہ میں ملا ئے جا ئیں ۔ دو نو ں تختے اِسی ڈھب کے ہو ں ۔ یہ تختے دو نو ں کو نو ں کے لئے ہو نگے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "پس آٹھ تختے اور چا ندی کے سو لہ خا نے ہو نگے یعنی ایک ایک تختہ کے لئے دو دو خا نے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور تُو کیکر کی لکڑی کے بینڈے بنا نا ۔ پا نچ بینڈے مسکن کے ایک پہلو کے تختوں کے لئے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور پا نچ بینڈے مسکن کے دُوسرے پہلُو کے تختوں کے لئے اور پا نچ بینڈے مسکن کے پچھلے حصّہ یعنی سمت کے تختوں کے لئے ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور وسطی مینڈا جو تختوں کے بیچ میں ہو وہ خیمہ کی ایک حدّ سے دُوسری حدّتک پہنچے۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور تُو تختوں کو سو نے سے منڈھنا اور بینڈوں کے گھروں کے لئے سو نے کے کڑے بنا نا اور بینڈوں کو بھی سو نے سے منڈھنا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور تُو مسکن کو اُسی نمونہ کے مُطابق بنا نا جو پہا ڑ پر تجھے دکھا یا گیا ہے ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تُو آسما نی ۔ ارغوانی اور سُرخ کے کپڑوں اور با ریک بٹے ہُو ئے کتان کا ایک پردہ بنا نا اور اُس میں کسی ما ہر اُستاد سے کروبیوں کی صُورت کڑھوانا ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اُسے سو نے سے منڈھے ہو ئے کیکر کے چا ر سُتونوں پر لٹکا نا ۔ اُنکے کُنڈے سو نے کے ہو ں اور چا ند ی کے چار خا نوں پر کھڑے کئے جا ئیں ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور پردہ کو گھُنڈیو ں کے نیچے لٹکا نا اور شہادت کے صنُدوق کو وہیں پردہ کے اندر لے جا نا اور یہ پردہ تُمہارے لئے پا ک مقام کو پاک ترین مقام سے الگ کریگا ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور تُو سر پوش کو پاک ترین مقام میں شہادت کے صنُدوق پر رکھنا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور میز کو پردہ کے باہر دھر کر شمعدان کو اُسکے مقابل مسکن کی جنوبی سمت میں رکھنا یعنی میز شمالی سمت میں رکھنا ۔۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور تُو ایک پردہ کے دروازہ کے لئے آسمانی ارغوانی اور سُرخ رنگ کے کپڑوں اور باریک بٹے ہو ئے کتان اور اُس پر بیل بُو ٹے کڑھے ہُوئے ہوں ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور اِس پردہ کے لئے کیکر کی لکڑی کے پانچ ستُون بنانا اور اُنکو سونے سے منڈھنا اور اُنکے کُنڈے سونے کے ہو ں جنکے لئے تُو پِیتل کے پانچ خانے ڈھا لکر بنا نا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 27,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور تُو کیکر کی لکڑی کی قربانگاہ پانچ ہاتھ لمبی اور پانچ ہاتھ چوڑی بنانا۔وہ قُر بانگاہ چوَکھُونٹی اور اُسکی اُونچائی تین ہاتھ ہو ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور تُو اُسکے لئے چاروں کونوں پر سینگ بنانا اور وہ سینگ اور قُر بانگاہ سب ایک ہی ٹُکڑے کے ہوں اور تُو اُنکو پِیتل سے منڈھنا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور تُو اُسکی راکھ اُٹھانے کے لئے دیگیں اور بیلچے اور کٹورے اور سِیخیں اور انگیٹھیاں بنانا ۔ اُسکے سب ظروُف پِیتل کے بنانا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُسکے لئے پِیتل کی جالی کی جھنجری بنانا اور اُس جالی کے چاروں کونوں پر پِیتل کے چار کڑے لگانا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُس جھنجری کو قُربانگاہ کی چاروں طرف کے کنارے کے نیچے اِس طرح لگانا کہ وہ اُونچائی میں قُربانگاہ کی آدھی دُور تک پہنچے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور تُو قُر بانگاہ کے لئے کیکر کی لکڑی کی چوبیں بناکر اُنکو پیتل سے منڈھنا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور تُو اُن چوبوں کو کڑوں میں پہنا دینا کہ جب کبھی قُر بانگاہ اُٹھائی جائے وہ چوبیں اُسکی دونوں طرف رہیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تختوں سے وہ قُربانگاہ بنانا اور وہ کھوکھلی ہو ۔ وہ اُسے اَیسی ہی بنائیں جَیسی تجھے پہاڑ پر دِکھائی گئی ہے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "پھر تُو مسکن کے لئے صحن بنانا ۔ اُس صحن کی جنوُبی سمت کے لئے باریک بٹے ہوئے کتان کے پردے ہوں جو ملا کر سو ہاتھ لمبے ہو ں ۔ یہ سب ایک ہی سمت میں ہوں ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُنکے لئے بِیس سُتوُن بنیں اور سُتوُنوں کے لئے پیتل کے بیس ہی خانے بنیں اور اِن سُتوُنوں کے کُنڈے اور پٹیاں چاندی کی ہوں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اِسی طرح شمالی سمت کے لئے پردے ملاکر لمبائی میں سَوہاتھ ہو ں۔ اُنکے لئے بھی بِیس ہی سُتوُن اور سُتوُنوں کے لئے بِیس ہی پِیتل کے خانے بنیں اور سُتوُنوں کے کُنڈے اور پٹیاں چاندی کی ہوں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور صحن کی مغربی سمت کی چوڑائی میں پچاس ہاتھ کے پردے ہوں ۔اُنکے لئے دس سُتوُن اور سُتوُنوں کے لئے دس ہی خانے بنیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور مشرقی سمت میں صحن ہو ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور صحن کے دروازہ کے ایک پہلُو کے لئے پندرہ ہاتھ کے پردے ہوں جنکے لئے تین سُتوُن اور سُتوُنوں کے لئے تین ہی خانے بنیں۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور دُوسرے پہلُو کے لئے بھی پندرہ ہاتھ کے پردے اور تین سُتوُن ہی خانے بنیں۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور صحن کے دروازہ کے لئے بیس ہاتھ کا ایک پردہ ہو جو آسمانی ۔ارغوانی اور سُرخ رنگ کے کپڑوں اور باریک بٹےہو ئے کتان کا بنا ہوا ہو اور اُس پر بیل بُوٹے کڑھے ہوں ۔ اُسکے سُتون چار اور سُتوُنوں کے خانے بھی چار ہی ہوں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور صحن کے آس پاس سب سُتوُن چاندی کی پٹیوں سے جڑے ہُوئے ہوں اور اُنکے کُنڈے چاندی کے اور اُنکے خانے پِتیل کے ہوں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "صحن کی لمبائی سَو ہاتھ اور چوڑائی ہر جگہ پچاس ہاتھ اور قنات کی اآونچائی پانچ ہاتھ ہو۔ پردے بارِیک بٹے ہُوئے کتان کے اور سُتُونوں کے خانے پِتیل کے ہو ں۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "مسکن کے قِسم قِسم کے کام کے سب سامان اور وہاں کی میخیں اور صحن کی میخیں یہ سب پِتیل کے ہوں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور بنی اِسرائیل کُو حکم دینا کہ تیرے پاس کُو ٹکر نکلا ہُوا زتیون کا خالص تیل روشنی کے لئے لائیں تاکہ چراغ ہمیشہ جلتا رہے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "خیمہ اجتماع میں اس پردہ کے باہر جو شہادت کے صندوق کے سامنے ہوگا ہارون اور اسکے بیٹےشام سے صبح تک شمعدان کو خُداوند کے رُوبرُو آراستہ رکّھیں ۔ یہ دستور العمل بنی اِسرائیل کے لئے نسل در نسل سدا قائم رہیگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 28,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور تُو بنی اسرائیل میں سے ہارُون کو جو تیرا بھائی ہے اور اُسکے ساتھ اُسکے بیٹوں کو اپنے نزدیک کر لینا تاکہ ہارُون اور اُسکے بیٹے ۔ ندب اور ابہیواور الیعزر اور اِتمرکہانت کے عہدہ پر ہو کر میری خدمت کریں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور تُو اپنے بھائی ہارُون کے لئے عزّت اور زِنیت کے واسطے مُقدس لباس بنا دینا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور تُو اُن سب روشن ضمیروں سے جنکو مَیں نے حکمت کی روح سے بھرا ہے کہہ کہ وہ ہارُون کے لئے لباس بنایئں تاکہ وہ مُقدس ہو کر میرے لِئے کاہن کی خدمت کو انجام دے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور جو لباس وہ بنائینگے یہ ہیں یعنی سِینہ بند اور افوُد اور جبُنہ اور چار خانے کا کُرتہ اور عمامہ اور کمر بند ۔ وہ تیرے بھائی ہارُون اور اُسکے بیٹوں کے واسطے یہ پاک لباس بنائیں تاکہ وہ میرے لئے کاہن کی خدمت کو انجام دے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ سونا اور آسمانی اور ارغوانی اور سُرخ رنگ کے کپڑے اور مہین کتان لیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور وہ افوُد سونے اور آسمانی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور باریک بٹے ہو ئے کتان کا بنایئں جو کسی ماہر اُستاد کے ہاتھ کا کام ہو ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور وہ اِس طرح سے جوڑا جائے کہ اُسکے دونوں مونڈھوں کے سرے آپس میں ملا دئے جاہیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اُسکے اُوپر جو کاریگری سے بنا ہوا پٹکااُسکے باندھنے کے لئے ہو گا اُس پر افوُد کی طرح کام ہو ا اور وہ اُسی کپڑے کا ہو اور سونے اور آسمانی او ر ارغوانی اور سُر خ رنگ کے کپڑوں اور باریک بٹے ہو ئے کتان کا بنا ہوا ہو ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور تُو دو سُلیمانی پتھر لیکر اُن پر اسرائیل کے بیٹوں کے نام کندہ کر انا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُن میں سے چھ نام دُوسرے پتھر پر اُنکی پیدایش کی ترتیب کے مُوافق ہوں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تُو پتھر کے کندہ کار کو لگا کر انگشتری کے نقش کی طرح اسرائیل کے بیٹوں کے نام اُن دونوں پتھروں پر کندہ کراکے اُنکو سونے کے خانوں میں جڑوانا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور دونوں پتھروں کو افُود کے دونوں مونڈھوں پر لگانا تاکہ یہ پتھر اسرائیل کے بیٹوں کا یاد گاری کے لئےکندھوں پر یادگاری کے لئے لگائے رہے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور تُو سو نے خانے بنا نا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور خالص سونے کی دو زنجیروں ڈوری کی طرح گُندھی ہو ئی بنانا اور اِن گُندھی ہو ئی زنجیرکو خانوں میں جڑدینا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور عدل کا سِینہ بند کسی ماہر اُستاد سے بنوانا اور افُود کی طرح سونے اور آسمانی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور باریک بٹے ہو ئے کتان کا بنوانا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "وہ چوکھُونٹا اور دُہراہو ۔ اُسکی لمبائی ایک بالشت اور چوڑائی بھی ایک ہی بالشت ہو ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور چاروں قطاروں میں اُس پر جواہر جڑنا ۔ پہلی قطار میں یا قوت ِسُرخ اور مُکھپراج اور گوہرشب چراغ ہو ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "دُوسری قطار میں زمرّد اور نِیلم اور ہیرا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "تیسری قطار لشم اور یشم اور قوت ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "چوَتھی قطار میں فیروزہ اور سنگ ِ سُلیمانی اور زبرجد ۔ یہ سب سونے کے خانوں میں جڑے جائیں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "یہ جواہر اسرائیل کے بیٹوں کے ناموں کے مُطابق شُمار میں بارہ ہوں اور انگشتر ی کے نقش کی طرح یہ نام جو بارہ قبیلوں کے نام ہونگے اُن پر کندہ کئے جائیں ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور تُو سِینہ بند پر ڈوری کی طرح گُندھی ہو ئی خالص سونے کی دو زنجیریں لگانا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور سِینہ بند کے لئے سونے کے دو حلقے بنا کر اُنکو سِینہ بند کے دونوں سروں پر لگانا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور سونے کی دونوں گُندھی ہُوئی زنجیروں کو اُن دونوں حلقوں میں جو سِینہ بند کے دونوں سروں پر ہو نگے لگا دینا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور دونوں گُندھی ہُوئی زنجیروں کے باقی دونوں سروں کو دونوں پتھروں کے خانوں میں جڑکر اُنکو افُود کے دونوں مونڈھوں پر سامنے کی طرف لگا دینا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور سونے کے اَور دو حلقے بناکر اُنکو سِینہ بند کے دونوں سروں کے اُس حاشیہ میں لگانا جو اندر کی طرف ہے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "پھر سونے کے دو حلقے اَور بنا کر اُنکو افُود کے دونوں مونڈھوں کے نیچے اُسکے اگلے حصّہ میں لگانا جہاں افُود جوڑا جائیگا تاکہ وہ افُود کے کاریگری سے بٹے ہوئے پٹکے کے اُوپر ر ہے ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور وہ سِینہ بند کو لیکر اُسکے حلقوں کو ایک نیلے فیتے سے باندھ دیں تاکہ یہ سِینہ بند افُود کے کاریگری سے بٹے ہوئے پٹکے کے اُوپر بھی رہے اور افود سے بھی الگ نی ہونے پائے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور ہارُون اِسرائیل کے بیٹوں کے نام عدل کے سِینہ بند پر اپنے سِینہ پاک مقام میں داخل ہونے کے وقت خُداوند کے رُوبرُولگائے رہے تاکہ ہمیشہ اُنکی یاد گاری ہوا کرے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور تُو عدل کے سِینہ بند میں اُوریم اور تُمیّم کو رکھنا اور جب ہارُون خُداوند کے حضور جائے تو یہ اُسکے دِل کے اُوپرہوں ۔یُوں ہارُون بنی اِسرائیل کے فَیصلہ کو اپنے دِل کے اُوپر خُداوند کے رُوبُرو ہمیشہ لئےِ رہیگا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تُو افُود کا جُبّہ بِالکل آسمانی رنگ کا بنانا ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اُسکا گر یبان بیچ میں ہو اور زِرہ کے گریبان کی طر ح اُسکے گریبان کے گردا گرد بُنی ہُوئی گو ٹ ہو تا کہ وہ پھٹنے نہ پا ئے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور اُسکے دامن کے گھیرمیں چاروں طرف آسمانی ۔ارغوانی اور سُرخ رنگ کے انار بنانا اور اُنکے درمیان چاروں طرف سونے کی گھنٹیاں لگانا۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "یعنی جُبّہ کے دامن کے پُورے گھیر میں ایک سونے کی گھنٹی ہو اور اُسکے بعد انار ۔ پھر ایک سونے کی گھنٹی ہو اور اُسکے بعد انار۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اِس جُبّہ کےہارُون خدمت کے وقت پہنا کرے تاکہ جب جب وہ پاک مقام کے اندر خُداوند کے حضور جائے یا وہاں سے نکلے تو اُسکی آواز سُنائی دے اَیسا نہ ہو کہ وہ مر جائے ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور تُو خالص سونے کا ایک پتّر بناکر اُس پر انگشتری کے نقش کی طرح یہ کندہ کرنا خُداوند کے لئے مُقدس۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور اُسے نیلے فیتے سے باندھنا تاکہ وہ عمامہ پر یعنی عمامہ کے سامنے کے حصّہ پر ہو ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور یہ ہارُون کی پیشانی پر رہے تاکہ جو کُچھ بنی اسرائیل اپنے پاک ہدیوں کے ذریعہ سے مُقدس ٹھہرائیں اُن مُقدس ٹھہرائی ہوئی چیزوں کی بدی ہارُون اُٹھائے اور یہ اُسکی پیشانی پر ہمیشہ رہے تاکہ وہ خُداوند کے حضور مقبُول ہوں ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "اور کُرتہ باریک کتان کا بُنا ہو ا اور چار خانے کا ہو اور عمامہ بھی باریک کتان ہی کا بنانا اور باریک کمربند بنانا جِس پر بیل بُوٹے کڑھے ہو ں۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "اور ہارُون کے بیٹوں کے لئے کُرتے بنانا اور عزّت اور زینت کے واسطے اُنکے لئے کمر بند اور پگڑیاں بنانا ۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور تُو یہ سب اپنے بھائی ہارُون اور اُسکے ساتھ اُسکے بیٹوں کو پہنانا اور اُنکو مسح اور مخصُوص اور مُقدس کر نا تاکہ وہ سب میرے لئے کاہن کی خدمت کو انجام دیں ۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "اور تپو اُن کے لئے کتان کے پاجامے بنا دینا تاکہ اُنکا بدن ڈھکا رہے ۔ یہ کمرسے ران تک کے ہوں",
                    },
                    {
                        "verse_num": 43,
                        "text": "اور ہارُون اور اُسکے بیٹے جب جب خیمہ اجتماع میں داخل ہوں یا خدمت کرنے کو پاک مکان کے اندر قُر بانگاہ کے نزدیک جائیں اُنکو پہنا کر یں تا اَیس نہ ہو کہ گنہگار ٹھہریں اور مر جا ئیں ۔ یہ دستُور العمل اُسکے اور اُسکی نسل کے لئے ہمیشہ رہیگا ۔",
                    },

                ],
            },
            {
                "chap_num": 29,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اُنکو پاک کر نے کی خاطر تاکہ وہ میرے لئے کاہن کی خدمت کو انجام دیں تُو اُنکے واسطے یہ کرنا کہ ایک بچھڑا اور وہ بے عیب مینڈھے لینا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور بے خمیری روٹی اور بے خمیر کے کلُچے جنکے ساتھ تیل ملا ہو اور تیل کی چُپڑی ہوئی بے خمیری چپاتیاں لینا ۔ یہ سب گہیوں کے میدہ کی بنانا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُنکو ایک ٹوکری میں رکھکر اُس ٹوکری کو بچھڑے اور دونوں مینڈھوں سمیت آگے لے آنا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "پھر ہارُون اور اُسکے بیٹوں کو خیمہ اجتماع کے دروازہ پر لا کر اُنکو پانی سے نہلانا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ لباس لیکر ہارُون کو کُرتہ اور افُود کا جُبّہ اور افُود اور سِینہ بند پہنانا اور افُود کا کاریگری سے بُنا ہوا کمر بند اُسکے باند ھ دینا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور عمامہ کو اُسکے سر پر رکھکر اُس عمامہ کے اُوپر مُقدس تاج لگا دینا",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور مَسَح کر نے کا تیل لیکر اُسکے سر پر ڈالنا اور اُسکو مَسَح کر نا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پھر اُسکے بیٹوں کو آگے لا کر اُنکو کُرتے پہنانا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور ہارُون اور اُسکے بیٹوں کے کمر بند لپیٹ کر اُنکے پگڑیاںباندھنا تاکہ کہانت کے منصب پر ہمیشہ کے لئے اُنکا حق ر ہے اور ہارُون اور اُسکے بیٹو کو مخصُوص کر نا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "پھر تُو اُس بچھڑے کو خیمہ ِاجتماع کے سامنے لانا اور ہارُون اور اُسکے بیٹے اپنے ہاتھ اُس بچھڑے کے سر پر رکھیّں۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "پھر اُس بچھڑے کو خُداوند کے آگے خیمہ اِجتماع کے دروازہ پر ذبح کر نا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اُس بچھڑے کے خُون میں سے کُچھ لیکر اُسے اپنی اُنگلی سے قُربانگاہ کے سِینگوں پر لگانا اور باقی سارا خُون قُربانگاہ کے پایہ پر اُنڈیل دینا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "پھر اُس چربی کو جس سے انتٹریاں ڈھکی ر ہتی ہیں اور جگر پر کی چھلّی کو اور دونوں گُردوں کو اور اُنکے اُوپر کی چر بی کو لیکر سب قُر بانگاہ پر جلانا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "لیکن اُس بچھڑے کےگوشت اور کھال اور گوبر کو خیمہ گاہ کے باہر آگ سے جلادینا اِس لئے کہ یہ خطا کی قُر بانی ہے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "پھر تُو ایک مینڈھے کو لینا اور ہارُون اور اُسکے بیٹے اپنے ہاتھ اُس مینڈھے کے سر پر رکھیّں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور تُو اُس مینڈھے کو کو ذبح کر نا اور اُسکا خُون لیکر قُربانگاہ پر چاروں طرف چھڑکنا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور تُو مینڈھے کو ٹُکڑے ٹُکڑے کاٹنا اور اُسکی انتڑیوں اور پایوں کو دھوکر اُسکے ٹُکڑوں اور اُسکے سر کے ساتھ مِلا دینا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "پھر اِس پُورے مینڈھے کو قُربانگاہ پر جلانا ۔ یہ خُداوند کے لئے سوختنی قُربانی ہے ۔ یہ راحت انگیزخُوشبوُیعنی خُداوند کے لئے آتشین قُربانی ہے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "پھر دُوسرے مینڈھے کو لینا اور ہارُون اور اُسکے بیٹے اپنے ہاتھ اُس مینڈھے کے سر پر ر کھیّں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور تُو اِس مینڈھے کو ذبح کر نا اور اُس کا خُون میں سے کُچھ لیکر ہارُون اور اُسکے بیٹوں کے دہنے کان کی لَوپر اور دہنے ہاتھ اور دہنے پاؤں کے انگُوٹھوں پر لگانا اور خُون کو قُربانگاہ پر چاروں طرف چھڑک دینا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور قُر بانگاہ پر کے خُون اور مسح کر نے کے تیل میں سے کُچھ کُچھ لے کر ہارُون اور اُُسکے لباس پر اور اُسکے ساتھ اُسکے بیٹوں اور اُنکے لباس پر چھڑ کنا تب وہ اپنے لباس سمیت اور اُسکے ساتھ ہی اُسکے بیٹے اپنے اپنے لباس سمیت مُقدس ہونگے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور تُو مینڈھے کی چربی اور موٹی دُم کو اور جِس چربی دے انتٹریاں ڈھکی رہتی ہیں اُسکو اور جِگر پر کی جھلّی کو اور دونوں گُردوں کو اور اُنکے اُوپر کی چربی کو اور دہنی ران کو لینا اِس لئے کہ یہ تخصیصی مینڈھا ہے ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور بے خمیری روٹی کی ٹوکری میں سے جو خُداوند کے آگے دھری ہو گئی روٹی کا ایک گُردہ اور ایک کلُچہ جس میں تیل ملا ہوا ہو اور ایک چپاتی لینا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اِن سبھوں کو ہارُون اور اُسکے بیٹوں کے ہاتھوں پر رکھ کر اُنکو خُداوند کے رُوبرُو ہلانا تاکہ یہ ہلانے کا ہدیہ ہو ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "پھر اُنکو اُنکے ہاتھوں سے لےکر قُر بانگاہ پر سوختنی قُربانی کے اُوپر جلادینا تاکہ وہ خداوند کے آگے راحت انگیز خُوشبوُ ہو یہ خُداوند کے لئے آتشین قُربانی ہے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور تُو ہارُون کے تخصیصی مینڈھے کا سِینہ لے کر اُسکو خُدوند کے رُوبرُو ہلانا تاکہ وہ ہلانے کا ہدیہ ہو۔ یہ تیرا حصّہ ٹھہریگا ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور تُو ہارُون اور اُسکے بیٹوں کے تخصیصی مینڈھے کے ہلانے کے ہدیہ کے سِینہ کو جو ہلایا جا چُکا ہے اور اُٹھائے جانے کے ہدیہ کی ران کو جو اُتھائی جا چُکی ہے لے کر اُن دونوں کو پاک ٹھہرانا ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "تاکہ یہ سب بنی اسرائیل کی طرف سے ہمیشہ کے لئے ہارُون اور اُسکے بیٹوں کا حق ہو کیونکہ یہ اُٹھائے جانے کا ہدیہ ہے ۔ سو یہ بنی اسرائیل کی طرف سے اُن کی سلامتی کے ذبیحوں میں سے اُٹھائے جانے کا ہدیہ ہو گا جو اُنکی طرف سے خُداوند کے لئے اُٹھایا گیا ہے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور ہارُون کے بعد اُسکے پاک لباس اُسکی اولاد کے لئے ہونگے تاکہ اُن ہی میں وہ مسح وا مخصُوص کئے جائے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اُس کا جو بیٹا اُسکی جگہ کاہن ہو وہ جب پاک مقام میں خدمت کرنے کو خیمہ اجتماع میں داخل ہو تو اُنکو سات دِن تک پہنے رہیں ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تُوتخصِیصی مینڈھے کو لے کر اُسکے گوشت کو کِسی پاک جگہ میں اُبالنا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور ہارُون اور اُسکے بیٹے مینڈھے کا گوشت اور ٹوکری کی روٹیاں خیمہ اجتماع کے دروازہ پر کھائیں ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور جن چیزوں سے اُنکو مخُصوص اور پاک کرنے کے لئے کفارہ دیا جائے وہ اُن کو بھی کھائیں لیکن اجنبی شخص اُن میں سے کُچھ نہ کھانے پائے کیو نکہ یہ چیزیں پاک ہیں ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اگر مخُصوص کرنے کے گوشت یا روٹی میں سے کُچھ صبح تک بچا رہ جایئں تو اُس بچے ہو ئے کو آگ سے جلادینا ۔ وہ ہرگز نہ کھایا جائے اِس لئے کہ وہ پاک ہے ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور تُو ہارُون اور اُسکے بیٹوں کے ساتھ جو کُچھ مَیں نے حکُم دِیا ہے وہ سب عمل میں لانا اور سات دِن تک اُنکی تخصیص کرتے ر ہنا ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور تُو ہر روز خطا کی قُربانی کے بچھڑ ےکو کفارہ کے واسطے ذبح کرنا اور تُو قُربانگاہ کو اُس کے کفارہ دینے کے وقت صاف کرنا اور اُسے مسح کرنا تاکہ وہ پاک ہو جائے ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "تُو سات دِن تک قُربانگاہ کے لئے کفارہ دینا اور اُسے پاک کرنا تو قُربانگاہ نہایت پاک ہو جائے گئی اور جو کُچھ اُس سے چھُوجایگا وہ بھی پاک ٹھہرے گا ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور تُو ہر روز سدا ایک ایک برس کے دو دو برّے قُربانگاہ پر چڑھایا کرنا ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "ایک برّہ صبح کو اور دُوسرا برّہ زوال اور غروب کے درمیان چڑھانا ۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "اور ایک برّہ کے ساتھ ایفہ کے دسویں حصّہ کے برابر میدہ دینا جس میں بین کے چوتھے حصّہ کی مقدار میں کُوٹکر نکالا ہوا تیل ملا ہو ا ہو اور بین کے چوتھے حصّہ کی مقدار میں تپاون کے لئے بھی دینا ۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور تُو دُوسرے برّہ کو زوال اور غرو ب کے درمیان چڑھانا اور اُسکے ساتھ صبح کی طرح نذر کی قُربانی اور ویسا ہی تپاون دینا جس سے وہ خُداوند کے لئے راحت انگیز خُوشبوُاور آتشین قُربانی ٹھہرے۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "اِیسی ہی سو ختنی قُربانی تُمہاری پُشت رد پُشت خیمہ اجتماع کے دروازہ پر خداوند کے آگے ہمیشہ ہوا کرے ۔ وہاں مَیں تُم سے مِلونگا اور تُجھ سے باتیں کرونگا ۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "اور وہیں مَیں بنی اسرائیل سے مُلاقات کرونگا اور وہ مقام میرے لئے جلال سے مُقدس ہو گا ۔",
                    },
                    {
                        "verse_num": 44,
                        "text": "اور مَیں خیمہ اجتماع کواور قُربانگاہ کو مقدس کرونگا اور مَیں ہارُون اور اُسکے بیٹوں کو مقدس کرونگا تاکہ وہ میرے لئے کاہن کی خدمت کو انجام دیں۔",
                    },
                    {
                        "verse_num": 45,
                        "text": "اور مَیں بنی اسرائیل کے درمیان سکوُنت کرونگا اور اُنکا خدا ہونے کا ۔",
                    },
                    {
                        "verse_num": 46,
                        "text": "تب وہ جان لینگے کہ مَیں خُداوند اُنکا خُدا ہوں جو اُنکو مُلک مصر سے اِس لئے نکالکر لیا کہ مَین اُن کے درمیان سکوُنت کروں ۔ مَیں ہی خُداوند اُنکا خُدا ہوں ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 30,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور تُو بخُور جلانے کے لئے کیکر کی لکڑی کی ایک قُربانگاہ بنانا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اُسکی لمبائی ایک ہاتھ اور چوڑائی ایک ہاتھ ہو۔ وہ چو کھونٹی رہے اور اُسکی اُونچائی دو ہاتھ ہو اور اُسکے سِینگ اُسی ٹکڑے سے بنائے جائیں۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور تُو اُسکی اوپر کی سطح اور چاروں پہلُوؤں کو جو اُسکے گِردا گردہیں اور اُسکے سینگوں کو خالِص سونے سے منڈھنا اور اُسکے لئے گردا گرد ایک زرِّین تاج بنانا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور تو اس تاج کے نیچے اسکے دونوں پہلوؤں میں سونے کے دو کڑے اسکی دونوں طرف بنانا۔ وہ اسکے اُٹھانے کی چوبوں کے لئے خانوں کا کام دینگے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور چوبیس کیکر کی لکڑی کی بنا کر انکو سونے سے منڈھنا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور تُو اسکو اس پردہ کے آگے رکھنا جو شہادت کے صندوق کے سامنے ہے ۔ وہ سر پوش کے سامنے رہے جو شہادت کے صندوُق کے اوپر ہے جہاں میں تجھ سے ملا کرونگا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اِسی پر ہارون خوشبودار بخُور جلایا کرے ۔ ہر صُبح چراغوں کو ٹھیک کرتے وقت بخُور جلائے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور زوال وغروب کے درمیان بھی جب ہارون چراغوںکو روشن کرے تب بخُور جلائے ۔ خُداوند کے حضور تُمہاری پشت در پُشت ہمیشہ جلایا جائے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور تُم اُس پر اور طرح کا بخُور نہ جلانا نہ اس پر سوختنی قُربانی اور نذر کی قُربانی چڑھانا اور کوئی تپاون بھی اس پر نہ تپانا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور ہارون سال میں ایک بار اسکے سینگوں پر کفارہ دے ۔ تُمہاری پُشت در پُشت سال میں ایک بار اِس خطا کی قُربانی کے خُون سے جو کفارہ کے لئے ہو ا اُسکے واسطے کفارہ دیا جائے ۔ یہ خُداوند کے لئے سب زیادہ پاک ہے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور خُاوند نے موسیٰ سے کہا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "جب تُو بنی اسرائیل کا شُمار کرے جِتنوں کا شُمار ہوا وہ فی مرد شُمار کے وقت اپنی جان کا فدِیہ خُداوند کے لئے دیں تاکہ جب تُو اُنکا شُمار کر رہا ہو اُس وقت کو ئی وبا اُن میں پھیلنے نہ پائے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "ہر ایک جو نکل نکل کر شُمار کئے ِہُوؤں میں ملتا جائے وہ مُقدس کی مثقال کے حساب سے نیم مثقال دے ۔ مثِقال بیِس جِیرہ کی ہو تی ہے ۔ یہ نیم مثِقال خُداوند کے لئے نذر ہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "جتنے ِبِیس برس کے یا اِس سے زیادہ عُمر کے نکل نکل کر شُمار کئےِ ہُوؤں میں ملتے جا ئیں اُن میں سے ہر ایک خُداوند کی نذر دے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "جب تُمہاری جانوں کے کفارہ کے لئے ِ خُداوند کی نذر دی جائے تو دَولتمند نِیم مِثقال سے زیادہ نہ دے اور نہ غریب اُس سے کم دے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور تُو بنی ا سرائیل سے کفارہ کی نقدی لیکر اُسے خیمہ اجتماع کے کام میں لگانا تاکہ وہ بنی اسرائیل کی طرف سے تُمہاری جانوں کے کفارہ کے لئے ِ خُداوند کے حضور یاد گار ہو ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "پھر خُداوند نے موسیٰ سے کہا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تُو دھونے کے لئے پِیتل کا ایک حَوض اور پِیتل ہی کی اُسکی کُرسی بنانا اور اُسے خیمہ اجتماع اور قُربانگاہ کے بیچ میں رکھکر اُس میں پانی بھر دینا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور ہارُون اور اُسکے بیٹے اپنے ہاتھ پاؤں اُس سے دھویا کر یں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "خیمہ اجتماع میں داخل ہو تے وقت پانی سے دھولیا کر یں تاکہ ہلاک نہ ہوں یا جب وہ قُربانگاہ کے نزدیک خِدمت کے واسطے یعنی خُداوند کے لئے سوختنی قُر بانی چڑھانے کو آئیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "تو اپنے اپنے ہاتھ پاؤں دھولیں تاکہ مر نہ جائیں ۔ یہ اُسکے اور اپسکی اَولاد کے لئے نسل درنسل دائمی رسم ہو ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور خُداوند نے موُسیٰ سے کہا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "کہ تُو مُقدس کی مِثقال کے حِساب سے خاص خاص خُوشبُودار مصالِح لینا یعنی اپنے آپ نکلا ہُوا مُرپا پخسَومثِقال اور اُسکا آدھا یعنی ڈھائی سو مِثقال دار چِینی اور خُوشبُودار اگر ڈھائی سَومِثقال۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور تج پا پخسَو مِثقال اور زیتُون کا تیل ایک ہیں ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور تُو اُن سے مَسح کرنے کا پاک تیل بنانا یعنی اُنکو گندھی کی حکمت کے مُطابق ملا کر ایک خُوشبُو دار روغن تیار کرنا ۔ یہی مسح کر نے کا پاک تیل ہو گا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اِسی سے تُو خیمہ اِجتماع کو اور شہادت کے صندُوق کو ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور میز کو اُسکے ظرُوف سمیت اور شمعدان کو اُسکے ظرُوف سمیت اور بخوُر جلانے کی قُربانگاہ کو ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "ساور سو ختنی قُربانی چڑھانے کے مذبح کو اُسکے سب ظرُوف سمیت اور حَوض کو اور اُسکی کُرسی کو مسح کرنا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور تُو اُنکو مُقدس کرنا تاکہ وہ نہایت پاک ہو جائیں جو کُچھ اُن سے چھُوجائیگا وہ پاک ٹھہریگا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور تُو ہارُون اور اُسکے بیٹوں کو مسح کرنا اور اُنکو مُقدس کرنا تاکہ وہ میرے لئے کاہن کی خِدمت کو انجام دیں ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور تُو بنی اسرائیل سے کہہ دینا کہ یہ تیل میرے لئے تُمہاری پُشت در پُشت مسح کرنے کا پاک تیل ہو گا ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "یہ کسی آدمی کے جِسم پر نہ ڈالا جائے اور نہ تُم کو ئی اور روغن اِسکی ترکیب سے بنانا اِسلئے کہ یہ مُقدس ہے",
                    },
                    {
                        "verse_num": 33,
                        "text": "یا اِس میں سے کُچھ کسی اجنبی پر لگائے وہ اپنی قَوم میں سے کاٹ ڈالا جائے ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور خُداوند نے مُوسیٰ سے کہا تُو خُوشبُودار مصالحِ مُراور مصطکی اور لَون اور خُوشبُودار مصالح ِکے ساتھ خالص لُبان وزن میں برابر برابر لینا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور نمک ملا کر اُن سے گندھی کی حکمت کے مُطابق خُوشبُو دار روغن کی طرح صاف اور پاک بخور بنانا ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور اِس میں سے کُچھ خُوب باریک پِیس کر خیمہ اجتماع میں شہادت کے صندُوق کے سامنے جہاں مَیں تجھ سے ملا کرونگا رکھنا ۔ یہ تُمہارے لئے نہایت پاک ٹھہرے ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور جو بخور تُو بنا ئے اُسکی ترکیب کے مُطا بق تُم اپنے لئے کُچھ نہ بنانا ۔ وہ بخور تیرے نزدیک خُداوند کے لئے پاک ہو ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "جو کوئی سُونگھنے کے لئے بھی اُسکی طرح کُچھ بنائے وہ اپنی قُوم میں سے کاٹ ڈالا جائے ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 31,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر خُداوند نے موسیٰ سے کہا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "دِیکھ مَیں نے بضلی ایل بِن اوری بِن حور کو یہوداہ کے قبیلہ میں سے نام لیکر بُلایا ہے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور میَں نے اُسکو حکمت اور فہم اور عِلم اور ہر طرح کی صنعت میں رُوح الّہہ سے معمُور کیا ہے ـ",
                    },
                    {
                        "verse_num": 4,
                        "text": "تاکہ ہُنر مندی کے کاموں کو ایجاد کرے اور سونے اور چاندی اور پیتل کی چیزیں بنائے ـ",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور پتھر کو جڑنے کے لئے کاٹے اور لکڑی کو تراشے جس سے سب طرح کی کاریگری کا کام ہو ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور دیکھ مَیں نے اہلیاب کو جو اخیسمک کا بیٹا اور دان کے قبیلہ میں سے ہے اُسکا سا تھی مُقرر کِیا ہے اور میں نے سب روشن ضمیروں کے دل میں اَیسی سمجھ رکّھی ہے کہ جن جن چیزوں کا میں نے تُجھ کو حُکم دیا ہے اُن سبھوں کو وہ بنا سکیں ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "یعنی خیمئہ اجتماع اور شہادت کا صندُوق اور سر پوش جو اُسکے اُوپر رہیگا اور خیمہ کا سب سامان ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور میز اور اُسکے ظرُوف اور خالِص سونے کا شمعدان اور اُسکے سب ظرُوف اور بخُور جلانے کی قربانگاہ ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور سوختنی قُربانی کی قربانگاہ اور اُسکے سب ظرُوف اور حَو ض اور اُسکی کُرسی ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور بیل بُو ٹے کڑھے ہُو ئے جامے اور ہارُون کاہن کے مُقدس لِباس اور اُسکے بیٹوں کے لِباس تاکہ کاہن کی خدِمت کو انجام دیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور مسح کرنے کا تیل اور مُقدس کے لئے خُوشبُو دار مصالحِ کا بخُور ۔ اِن سبھوں کو وہ جیسا مَیں نے تجھے حُکم دیا ہے ویسا ہی بنائیں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور خُداوند نے موسیٰ سے کہا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تُو بنی اسرائیل سے یہ بھی کہہ دینا کہ تُم میرے سبتوں کو ضرور ماننا ۔ اِسلئے کہ یہ میرے اور تُمہارے درمیان تُمہاری پُشت در پُشت ایک نشان رہیگا تاکہ تُم جانوکہ مَیں خُداوند تُمہارا پاک کرنے والا ہوں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "پس تُم سبت کو ماننا اِسلئے کہ وہ تُمہارے لئے مُقدس ہے ۔ جو کوئی اُسکی بے حُرمتی کرے وہ ضرور مار ڈالا جائے ۔ جو اُس میں کُچھ کام کرے وہ اپنی قُوم میں سے کاٹ ڈالا جا ئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "چھ دِن کام کاج کیا جائے لیکن ساتواں دِن آرام کا سبت ہے جو خُداوند کے لئے مُقدس ہے ۔جو کو ئی سبت کے دِن کام کر ے وہ ضرور مار ڈالا جائے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "پس بنی اسرائیل سبت کو مانیں اور پُشت در پُشت اُسے دائمی عہدجانکر اُسکا لحاظ رکھیں ّ ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "میرے اور بنی اسرائیل کے درمیان یہ ہمیشہ کے لئے ایک نشان رہیگا اِسلئے کہ چھ دِن میں خُداوند نے آسمان اور زمین کو پیدا کیا اور ساتویں دِن آرام کرکے تازہ دم ہُوا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور جب خُداوند کوہِ سینا پر مُوسیٰ سے باتیں کر چُکا تو اُس نے اُسے شہادت کی دولَوحیں دیں ۔ وہ لَوحیں پتھر کی اور خُدا کے ہاتھ کی لکھی ہُوئی تھیں ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 32,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور جب لوگوں نے دِیکھا کہ مُوسیی نے پہاڑ سے اُتر نے میں دیر لگائی تو وہ ہارُون کے پاس جمع ہو کر اُس سے کہنے لگے کہ اُٹھ ہمارے لئے دیوتا بنا دے جو ہمارے آگے آگے چلے کیو نکہ ہم نہیں جانتے کہ اِس مرد مُوسیٰ کو جو ہم کو مُلکِ مصر سے نکا لکر لایا کیا ہو گا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "ہارُون نے اُن سے کہا تُمہاری بیویوں اور لڑکوں اور لڑکیوں کے کانوں میں جو سونے کی بالیاں ہیں اُنکو اُتار کر میرے پاس لے آؤ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "چُنانچہ سب لوگ اُنکے کانوں سئ سونے کی بالیا ں اُتا ر اُتار کر اُنکو ہارُون کے پاس لے آئے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُس نے اُنکو اُنکے ہاتھوں سے لیکر ایک ڈھالا ہوا بچھڑا بنا یا جس کی صُورت چھَینی سے ٹھیک کی ۔ تب وہ کہنے لگے اَے اِسرائیل یہی تیرا وہ دیوتا ہے جو تجھ کو ملکِ مصر سے نکا لکر لایا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "یہ دِیکھ کہ ہارُون نے اُسکے آگے ایک قُربانگاہ بنائی اور اُس نے اِعلان کر دیا کہ کل خُداوند کے لئے عید ہو گی ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور دُوسرے دِن صُبح سویرے اُٹھکر اُنہوں نے قُربانیاں چڑھائیں اور سلامتی کی قُر بانیاں گُذرانیں۔ پھر اُن لوگوں نے بیٹھ کر کھایا پِیا اور اُٹھ کر کھیل کُود میں لگ گئے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "تب خُداوند نے موُسیٰ کو کہا نیچے جا کیو نکہ تیرے لوگ جنکو تُو مُلکِ مصِر سے نکال لایا بگڑ گئے ہیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "وہ اُس راہ سے جسکا مَیں نے اُنکو حُکم دیا تھا بہت جلد پھر گئے ہین ۔ اُنہوں نے اپنے لئے ڈھالا ہوا بچھڑا بنا یا اور اُسے پُو جا اور اُسکے لئے قُر بانی چڑھا کر یہ بھی کہا کہ اے اسرِائیل یہ تیرا وہ دیوتا ہے جو تجھ کو مُلک مصر سے نکا ل کر لایا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور خُداوند نے موسیٰ سے کہا مَیں اِس قُوم کو دِیکھتا ہُو ں کہ یہ گردن کش قوم ہے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اِسلئے تُو مُجھے اب چھوڑ دے کہ میرا غضب ساُن پر بھڑکے اور مَیں اُنکو بھسم کردُوں ااور مَیں تجھے ایک بڑی قوم بناؤنگا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "تب موسیٰ نے خُداوند اپنے خُدا کے آگے سمنت کر کے کہا اَے خُداوند کیوں تیرا غضب اپنے لوگوں پر بھڑکتا ہے جنکو تُو قُوتِ عظیم اور دستِ قوی سے مُلکِ مصِر سے نکال کر لایا ہے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "مصِر لوگ یہ کیوں کہنے پائیں کہ وہ اُنکو بُرائی کے لئے نکال لے گیا تاکہ اُنکو پہاڑوں میں مار ڈالے اور اُنکو رُوی زمین پر سے فنا کر دے ؟ سو تُو اپنے قہر و غضب سے باز رہ اور اپنے لوگو ں سے اِس بُرائی کرنے کے خیال کو چھوڑ دے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تُو اپنے بندوں ابرہام اور اِضحاق اور یعقوب کو یاد کر جن سئ تُو نے اپنی ہی قسم کھا کر یہ کہا تھا کہ مَیں تُمہاری نسل کو آسمان کے تاروں کی مانند بڑھاؤنگا اور یہ سارا مُلک جسکا مَیں نے ذکر کیا ہے تُمہاری نسل کو بخشونگا کہ وہ سدا اُسکے مالک رہیں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب خُداوند نے اپس بُرائی کے خیال کو چھوڑ دیا جو اُس نے کہا تھا کہ اپنے لوگوں سے کر یگا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور موسیٰ شہادت کی دونوں لَوحیں ہاتھ میں لِئے ہو ئے اُلٹا پھرا اور پہاڑ سے نیچے اُترا اور وہ لَوحیں اِدھر سے اور اُدھر سے دونوں طرف سے لکھی ہو ئی تھیں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور وہ لَوحیں خُدا ہی کی بنائی ہوئی تھیں اور جو لکھا ہوا تھا وہ بھی خُدا کا ہی لکھا اور اُن پر کندہ کیا ہوا تھا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور جب یشوع نے لوگوں کی للکار کی آواز سُنی تو موسیٰ سے کہا کہ لشکر گاہ میں لڑائی کا شور ہو رہا ہے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "موسیٰ نے کہا یہ آواز نہ تو فتمندوں کا نعرہ ہے نہ مغلُوبوںکی فریاد بلکہ مجھے تو گانے والوں کی آواز سُنائی دیتی ہے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور لشکر گاہ کے نزدیک آکر اُس نے وہ بچھڑا اور اُنکا ناچنا دیکھا ۔ تب موسیٰ کا غضب بھڑکا اور اُس نے اُن لُوحوں کو اپنے ہاتھوں میں سے پٹک دیا اور اُنکو پہاڑ کے نیچے توڑ ڈالا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اُس نے اُس بچھڑے کو جِسے اُنہوں نے بنایا تھا لیا اور اُسکو آگ میں جلایا اور اُسے باریک پیس کر پانی پر چھڑکا اور اُسی میں سے بنی اسرائیل کو پلوایا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور موسیٰ نے ہارُون سے کہا کہ اِن لوگوں نےتیرے ساتھ کیا کیِاتھا جو تُو نے اُنکو اِتنے بڑے گناہ مین پھنسا دیا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "ہارُون نے کہا کہ میرے مُلک کا غضب نہ بھڑکے ۔ تُو اِن لوگوں کو جانتا ہے بدی پر تُلے رہتے ہیں ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "چنانچہ اِنہی نے مجھے کہا کہ ہمارے لئے دیوتا بنا دے جو ہمارے آگے آگے چلے کیونکہ ہم نہیں جانتے کہ اِس آدمی موسیٰ کو جو ہمکو مُلک مصر سے نکال کر لایا کیا ہو گیا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "تب مَیں اِن سے کہا کہ جس جس کے ہاں سونا ہو وہ اُسے اُُتار لائے ۔ پس اِنہو ں نے اُسے مجھ کو دیا اور مَیں نے اُسے آگ میں ڈالا تو یہ بچھڑا نکل پڑا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "جب موسیٰ نے دیکھا کہ لوگ بے قابو ہو گئے کیونکہ ہارُون نے اُنکو بے لگام چھوڑ کر اُنکو اُنکے دُشمنوں کے درمیان ذلیل کر دیا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "تو موسیٰ نے لشکرگاہ کے دروازہ پر کھڑے ہو کر کہا جو خُداوند کی طرف ہے وہ میرے پاس آجائے ۔ تب سب بنی لا وی اُسکے پاس جمع ہو گئے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اُس نے اُن سے کہا کہ خُداوند اِسرائیل کا خُدایُوں فرماتاہے کہ تُم اپنی اپنی ران سے تلوار لٹکا کر پھاٹک پھاٹک گُھوم گھُوم کر سارے لشکر گاہ میں اپنے اپنے بھائیوں اور اپنے اپنے ساتھیوں اوراپنے اپنے پڑوسیوں کو قتل کرتے پھرو ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور بنی لاوی نے مُو سیٰ کے کہنے کے مُوافُق عمل کِیا چنا نچہ اُس دن لوگوں میں سے قریباً تِین ہزار مرد کھیت آئے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور مُوّسیٰ نے کہا کہ آج خُداوند کے لئے اپنے آپ کو مخصوص کرو بلکہ ہر شخص اپنے ہی بیٹے اور اپنے ہی بھائی کے خلاف ہوتاکہ وہ تمکو آج ہی برکت دے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور دُوسرے دن مُوّسیٰ نے لوگوں سے کہا کہ تُم نے بڑاگُناہ کِیا اور اب مَیں خداوند کے پاس اُوپر جاتاہُوں۔ شاید مَیں تُمہارے گُناہ کا کفارہ دے سکُوں۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور مُوسیٰ خُداوند کے پاس لوٹکر گیا اور کہنے لگا ہائے اِن لوگوں نے بڑا گُناہ کِیا کہ اپنے لئے سونے کا دیوتا بنایا ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اب اگر تُو اِنکا گُناہ معاف کردے تو خیر ورنہ میرانام اُس کِتاب میں سے جو تُونے لکھی ہے ہٹادے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور خُداوند نے مُوسیٰ کہا کہ جِس نے گُناہ کِیا ہے مَیں اُسی کے نام کو اپنی کِتاب میں سے مِٹائونگا ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اب تُو روانہ ہو اور لوگوں کو اُس جگہ لے جا جو مَیں نے تُجھے بتائی ہے ۔دیکھ میرا فرشتہ تیرے آگے آگے چلیگا لیکن مَیں اپنے مُطالبہ کے دن اُنکے گُناہ کی سزا دُونگا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور خُداوند نے اُن لوگوں میں مری بھیجی کیونکہ جو بچھڑا ہارُون نے بنایا وہ اُن ہی کا بنوایا ہُوا تھا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 33,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے موسیٰ سے کہا کہ اُن لوگوں کو اپنے ساتھ لیکر جنکو تُو مُلکِ مصر سے نکال کر لایا یہاں سے اُس کی طرف روانہ جسکے کے بارے میں ابرہام اور اضحاق اور یعقوب سے مَیں نے قسم کھا کر کہا تھا کہ اِسے مَیں تیری نسل کو دُونگا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور مَیں تیرے آگےآگے فرشتہ کو بھیجونگا اور مَیں کنعانیوں اور اموریوںاور جتّیوں اورفرزّیوں اورحوّیوں اور یبوسیوں کو نکال دُونگا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اُس مُلک میں دُودھ اور شہد بہتا ہے اور چونکہ تُو گردن کش قًوم ہے اسلئے مَیں تیرے بیچ میں ہوکرنہ چلُونگا تااَیسانہ ہو کہ مَیں تُجھ کو راہ میں فنا کر ڈالوں ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "لوگ اِس وحشتناک خبر کو سُنکر غمگین ہُوئے اور کسِی نے اپنے زیور نہ پہنے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "کیونکہ خُداوند نےمُوًسیٰ سے کہدیا تھا کہ بنی اِسرائیل سے کہنا کہ تُم گردن کش لوگ ہو ۔ اگر مَیں ایک لمحہ بھی تیرے بیچ میں ہو کر چلُوں تو تُجھ کو فنا کُردُونگا۔سوتُو اپنے زیور اُتار ڈال تاکہ مُجھے معلُوم ہو کہ تیرے ساتھ کیا کرنا چاہئے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "چنانچہ بنی اِسرائیل حورِب پہاڑ سے لیکر آگے آگے اپنے زیوروں کو اُتاے رہے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور موسیٰ خیمہ کو لے کر اُسے لشکر گاہ سے باہر لشکر گاہ سے دور لگا لیا کرتا تھااور اُس کانام خیمہ اجتماع رکھا اور جو خداوند کا طالب ہوتا وہ لشکر گاہ کے باہر اُسی خیمہ کی طرف چلا جاتا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور جب موسیٰ باہر خیمہ کی طرف جاتا تو سب لوگ اُٹھ کر اپنے اپنے ڈیرے کے دروازہ پر کھڑے ہو جاتے اور موسیٰ کے پیچھے دیکھتے رہتے تھے جب تک وہ خیمہ کے اندر داخل نہ ہو جاتا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور جب موسیٰ خیمہ کے اندر چلا جاتا تو ابر کا ستون اُتر کر خیمہ کے دروازہ پر ٹھہرا رہتا اور خُداوند مُوسیٰ سے باتیں کرنے لگتا۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور سب لوگ اُٹھ اُٹھ کر اپنے اپنے ڈیرے کے دروازہ پر سے اُسے سجدہ کرتے تھے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور جیسے کوئی شخص اپنے دوست سے بات کرتا ہے ویسے ہی خُداوند رُو برُو ہو کر مُوسیٰ لشکر گاہ کو لوٹ آتا تھا پر اُسکا خادِم یشوع جو نُون کا بیٹا اور جوان آدمی تھا خیمہ سے باہر نہیں نکلتاتھا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور مُوسیٰ نے خُداوند سے کہا دیکھ تو مجھ سے کہتا ہے کہ ان لوگوں کو لے چل پر مُجھے یہ نہیں بتایا کہ تو کِس کو میرے پاس بھیجیگا حالانکہ تو نے یہ کہا ہے کہ میں تجھکو بنام جانتا ہوں اور تجھ پر میرے کرم کی نظر ہے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "پس اگر مجھ پر تیرے کرم کی نظر ہے تو مجھ کو اپنی راہ بتا جس سے میں تُجھے پہچان لوں تاکہ مجھ پر تیرے کرم کی نظر رہے اور یہ خیال رکھ کہ یہ قوم تیری ہی امت ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تب اس نے کہا میں ساتھ چلُو نگا اور تجھے آرام دونگا۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "مُوسیٰ نے کہا اگر تو ساتھ نہ چلے تو ہمکو یہاں سے آگے نہ لے جا۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "کیونکہ یہ کیونکر معلوم ہوگا کہ مجھ پر اور تیرے لوگوں پر تیرے کرم کی نظر ہے؟کیا اسی طریق سے نہیں کہ تو ہمارے ساتھ ساتھ چلے تاکہ میں اورتیرےلوگ روی زمین کی سب قوموں سے نرالے ٹھہریں۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "خُداوند نے موُ سٔیٰ سے کہا میں یہ کا م بھی جسکا تُو نے زِکر کیا ہے کروُنگا کیو نکہ تُجھ پر میرے کرم کی نظر ہے اور میں تُجھ کو بنام پہچانتا ہُوں۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تب وہ بول اُٹھا کہ میں تیری مِنّت کر تا ہُوں مُجھے اپنا جلال دکھا دے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اُس نے کہا میں اپنی ساری نیکی تیرے سامنے ظاہر کروُنگا اور تیرے ہی سامنے خداوند کے نام کا اعلان کر وُنگا اور میں جس پر مہربانی ہُوں مہربان ہوُنگا اور جس پر کرنا چاہُوں رحم کروُنگا۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور یہ بھی کہا تُو میرا چہرہ نہیں دیکھ سکتا کیونکہ اِنسان مجُھے دیکھ کر زندہ نہیں رہیگا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "پھر خدُاوند نے کہادیکھ میرے قریب ہی ایک جگہ ہے سو تُو اُس چٹا ن پر کھٹرا ہو۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور جب تک میرا جلال گُزرتارہیگا میں تجُھے اُس چٹان کے شِگاف میں رکھُّو نگا اور جب تک میں نکل نہ جاوُں تجھے اپنےہاتھ سے ڈھانکے رہُونگا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اِسکے بعد میں اپنا ہاتھ اُٹھا لُونگا اور تُو میرا پیچھا دیکھیگا لیکن میرا چہرہ دِکھاہی نہیں دیگا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 34,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پھر خُداوند نے موسیٰ سے کہا پہلی لَوحوں کی مانند پتھر کی دو لَوحیں اپنے لئے تراش لینا ار مَیں اُن لَوحوں پر وہی باتیں لکھ دُونگا جو پہلی لَوحوں پر جنکو تُو نے توڑ ڈالا مرقوم تھیں ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور صبح تک تیار ہو جانا اور سویرے ہی کوہِ سینا پر آ کر وہاں پہاڑ کی چوٹی پر میرے سامنے حاضر ہونا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "پر تیرے ساتھ کو ئی اور آدمی نہ آئے اور نہ پہاڑ پر کہیں کو ئی دُوسرا شخص دِکھائی دے ۔ بھیڑ بکریاں اور گائے بیل بھی پہاڑ کے سامنے چرنے نہ پائیں ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور موسیٰ نے پہلی لَوحوں کی مانند پتھر کی دو لَوحیں تراشیں اور صبح سویرے اُٹھ کر پتھر کی دونوں لَوحیں ہاتھ میں لئے ہو ئے خُداوند کے حُکم کئ مُطابق کوہِ سینا پر چڑھ گیا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تب خُداوند ابر میں ہو کر اُسکے ساتھ وہاں کھڑے ہو کر خُداوند کے نام کا اِعلان کیا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خُداوند اُسکے آگے سے یہ پُکارتا ہُوا گُزرا خُداوند خُداوند خُدای رحیم اور مہربان قہر کرنے میں دِھیما اور شفقت اور وفا میں غنی ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "ہزاروں پر فضل کرنے والا ۔گناہ اور تقصیر اور خطا کا بخشنے والا لیکن وہ مُجرم کو ہرگزبری نہیں کریگا بلکہ باپ دادا کے گناہ کی سزا اُنکے بیٹوں اور پوتوں کو تیسری اور چوتھی پُشت تک دیتا ہے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تب مُوسیٰ نے جلدی سے سر جھکا کر سجدہ کیا۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور کہا اَے خُداوند اگر مُجھ پر تیرے کرم کی نظرہے تو اَے خُداوند میں تیری مِنت کرتا ہوں کہ ہمارے بیچ میں ہو کر چل گو یہ قوم گردن کش ہے اور تو ہمارے گُناہ اور خطا کو معاف کراور ہم کو اپنی میراث کر لے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اُس نے کہا دیکھ میں عہد با ند ھتا ہُوں کہ تیرے سب لوگوں کے سامنے اَیسی کرامات کرونگا جو دنیا بھر میں اور کسِی قَوم میں کبھی کی یہں گیئِں اور وہ سب لوگ جنکے بِیچ تُو رہتا ہے خُداوند کے کام کو دیکھینگے کیونکہ جو میں تُم لوگوں سے کرنے کو ہوں وہ ہَیبت ناک کام ہوگا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "آج کے دِن جُو حکم میں تجھے دیتاہُوں تُو اُسے یاد رکھنا ۔دیکھ میں اموریوں اور کنعا نیوں اور حِتّیوںاور فرزّیوں اور حّویوں اور یبوسیوں کو تیرے آگے سے نکالتا ہُوں۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "سو خبردار رہنا کہ جِسں مُلک کو تُو جاتا ہے اُسکے باشِندوں سے کوئی عہدنہ باندھنا ۔اَیسا نہ ہُو کہ وہ تیرے لئِے پھندااٹھہرے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "بلکہ تُم اُنکی قُربانگا ہوں کو ڈھادینا اور اُنکے سُتُونوں کے ٹُکڑےٹُکڑےکردنیا اور اُنکی یسِیرتوںکوکاٹ ڈالنا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "کیونکہ تُجھکو کِسی دُوسرے معبُودکی پرستِش نہیں کرنیہوگی اِسِلئےکہ خُداوند جِسکا نام غُیور ہے وہ خُدا ایِغُیور ہے بھی۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "سواَیسانہ ہو کہ تُو اُس مُلک کے باشِندوں سےکوہی عہدباندھلے اور جب وہ اپنے معُبودوں کی پَیروی میں زِناکار ٹھہریں اور اپنے معُبدوں کے لئِے قُربانی کریں اور کوئی تُجھکو دعوت دے اور تُو اُسکی قُربانی میں سے کُچھ کھا لے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "او تُو اُن کی بیٹاں اپنے بیٹوں سے بیاہے اور اُنکی بیٹاں اپنے معُبودوں کی پیروی میں زِنا کار ٹھہریں اور تیرے بیٹوں کو بھی اپنے معُبودوں کی پیروی میں زِنا کار بنا دیں ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "تُو اپنے لئے ڈھائے ہو ئے دیوتا نہ بنا لینا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "تُو بے خمیری روٹی کی عید مانا کر نا ۔ میرے حُکم کئ مُطابق سات دِن تک ابیب کے مہینے میں وقت ِ مُعیّنہ پر بے خمیری روٹیاں کھانا کیونکہ ماہِاا بیب میں تُو مِصر سے نکلا تھا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "سب پہلوٹھے میرے ہیں اور تیرے چوپایوں میں جو نر پہلوٹھے ہوں کیا بچھڑے کیا بّرے سب میر ے ہو نگے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "لیکن گدھے کے پہلے بچے کا فدیہ بّرہ دیکر ہو گا اور اگر تُو فدیہ نہ چا ہے تو اُسکی گردن توڑ ڈالنا پر اپنے سامنے سب خالی ہاتھ دِکھائی نہ دے۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "چھ دِن کام کاج کرنا لیکن ساتویں دِن آرام کرنا۔ہل جوتنے اور فصل کاٹنے کے مَوسم میں بھی آرام کرنا۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور تُو گہیوں کے پہلے پھل کاٹنے کے وقت ہفتوںکی عِید اور سال کے آخر میں فصل جمع کر نے کی عِید مانا کرنا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تیرے سب مرد سا ل میں تِین ار خُداوند خُدا کے آگے جو اِسٔرائیل کا خُدا ہے حاضِر ہوں۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "کیونکہ مَیں قَوموں کو تیرے آگے سے نکال کر تیریسرحدوں کو بڑ ھا دونگا اور جب سال میں تِیں بار تُو خُداوند اپنے خُداکے آگے حاضِر ہو گا تو کوئی تیری زمین کا لالچ نہیں کرے یگا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "تُو میری قُربانی کا خُون خمیری روٹی کے ساتھ نہ گزراننا اور عِید فسح کی قُربانی سے کچھ صبح تک نہ رہنے دینا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اپنی زمین کی پہلی پَیداوار کا پھل خُداوند اپنے خدا کے گھر میں لانا ۔حلو ان کو اُسی کی ما ں کے دوُدھ میں نہ پکانا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور خُداوند مُوسیٰ سے کہا کہ تُو یہ با تیں لِکھ کیونکہ ان ہی باتوں کے مفہوم کے مطابق تُجھ سے ااسئرایئل سے عہِد باندھتا ہوں۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "سو وہ چالِیس رات وہیں خُداوند کے پاس رہا اور نہ روٹی کھائی نہ پانی پِیا اور اُس نے اُن لَوحوںپراُس عہد کی باتوں کو یعنی دس احکام کو لِکھا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور جب مُوسیٰ شہادت کی دونوں لوحیں اپنے ہاتھ میں لیے ہُوئے کوہِ سیئنا سے اُترا آتا تھا تو پہاڑ سے نِیچے اُتر تے وقت اُسے خبرنہ تھی کہ خُداوند کے ساتھ با تیں کر نے کی وجہ سے اُسکا چہرہ چمک رہا تھا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور جب ہارون اور بنی اِسرائیل نے مُوسیٰ پر نظر کی اور اُسکے چہرہ کو چمکتے دیکھا تُو اُسکے نزدِیک آنے سے ڈرے ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "تب مُوسیٰ نے اُنکوُ بلا یا اور ہارُون اور جما عت کتے سب سردار اُسکے پا س لَو ٹ آئے اور مُوسیٰ اُن سے با تیں کرنے لگا۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور بعد میں سب بنی اِسرائیل نزدیک آئے اور اُس نے وہ سب احکام جو خُداوند نے کوہِ سئینا پر با تیں کر تے وقت اُسے دِئے تھے اُنکو بتائے۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور جب مُو سیٰ اُن سے باتیں کر چُکا تو اُس نے اپنے مُنہ پر نقاب ڈال ِ لیا۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور جب مُو سیٰ خُداوند سے باتیں کرنے کے لئے اُسکے سا منے جاتا تو با ہرنکلنے کے وقت نقاب کو اُتارے رہتا تھا اور جو حُکم اسے ملتا تھا وہ اُسے باہر آکر بنی اسرائیل کو بتا دیتا تھا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور بنی اسرائیل مُوسیٰ کے چہرہ کو دیکھتے تھے کہ اسکے چہرہ کی جلِد چمک رہی ہے اور جب تک مُوسیٰ خُداوند سے با تیں کرنے نہ جاتا تب تک اپنے مُنہ پر نقاب ڈالے رہتا تھا۔",
                    },
                    
                ],
            },
            {
                "chap_num": 35,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور مُوسیٰ نے بنی اسرائیل کی ساری جماعت کو جمع کر کے کہا جن باتوں پر عمل کرنے کا حُکم خُداوند نے تُم کو دیا ہے وہ یہ ہے",
                    },
                    {
                        "verse_num": 2,
                        "text": "چھ دن کام کاج کیا جائے لیکن ساتواں دن تُمہارے لئے روز ِمُقدس یعنی خُداوند کے آرام کا سبت ہو۔ جو کوئی اُس میں کُچھ کام کرے وہ مارا ڈالا جائے ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تُم سبت کے دن اپنے گھروں میں کہیں بھی آگ نہ جلانا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور موسیٰ نے بنی اسرائیل کی ساری جماعت سے کہا جس بات کا حُکم خُداوند نے دیا ہے وہ یہ ہے کہ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "تُم اپنے پاس سے خُداوند کے لئے ہدیہ لایا کرو ۔ جس کسی کے دل کی خُوشی ہو وہ خُداوند کا ہدیہ لائے ۔ سونا اور چاندی اور پیتل ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور آسمانی رنگ اور ارغوانی رنگ اور سُرخ رنگ کے کپڑے اور مہین کتان اور بکریوں کی پشم ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور مینڈھو ں کی سُرخ رنگی ہو ئی کھالیں اور تخس کی کھالیں اور کیکر کی لکڑی ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور جلانے کا تیل اور مسح کرنے کے تیل کےلئے اور خُوشبُودار بخور کے لئے مصالح۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور افُود اور سینہ بند کے لئے سلُیمانی پتھر اور اَورجراؤپتھر ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور تُمہارے درمیان جو روشن ضمیر ہیں وہ آکر وہ چیزیں بنائیں جنکا حُکم خُداوند نے دیا ہے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "یعنی مسکن اور اُسکا خیمہ اور غلاف اور اُسکی گھُنڈیاں اور تختے اور بینڈے اور اُسکے سُتون اور خانے ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "صندُوق اور اُسکی چوبیں ۔ سر پوش اور بیچ کا پردہ ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "میز اور اُسکی چوبیں اور اُسکے سب ظروف اور نذر کی روٹیاں ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور روشنی کے لئے شمعدان اور اُسکے برتن اور چراغ اور جلانے کا تیل ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور بخور جلانے کی قُر بانگاہ اور اُسکی چوبیں اور مسح کرنے کا تیل اور خُوشبُو دار بخور اور مسکن کے دروازہ کے لئے دروازہ کا پردہ ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور سوختنی قُربانی کا مذبح اور اُسکے لئے پیِتل کی جھنجری اور اُسکی چوبیں اور اُسکے سب ظروُف اور حوض اور اُسکی کُرسی ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور صحن کے پردے ستوُنوں سمیت اور اُنکے خانے اور صحن کے دروازہ کا پردہ ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور مسکن کی میخیں اور صحن کی میخیں اور اُن دونوں کی رسّیاں ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور مقدس کی خدمت کےلئے بیل بُوٹے کڑھے ہو ئے لباس اور ہارُون کاہن کے لئے مُقدس لباس اور اُسکے بیٹوں کے لِباس تاکہ وہ کاہن کی خدمت کو انجام دیں ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تب بنی اسرائیل کی ساری جماعت مُوسیٰ کے پاس سے رُخصت ہو ئی ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور جِس جِس کا جی چاہا اور جِس جِس کے دل میں رغبت ہو ئی وہ خیمہ اجتماع کے کام اور وہاں کی عبادت اور مُقدس لِباس کے لئے خُداوند کا ہدیہ لایا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور کیا مرد کیا عورت جِتنوں کا دل چاہا وہ سب جُگنو بالیاں انگشتریاں اور بازُو بند سب سونے کے زیور تھے لانے لگے ۔ اس طریقہ سے لوگو ں نے خُداوند کو سونے کا ہدیہ دیا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور جِس جِس کے پاس آسمانی رنگ اورارغوانی رنگ اور سُرخ رنگ کے کپڑے اور مہین کتان اور بکریاں کی پشم اور مینڈھوں کی سُرخ رنگی ہو ئی کھا لیں اور تخس کی کھالیں تھیں وی اُنکو لے آئے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "جِس نے چاندی یا پِیتل کا ہدیہ دینا چا ہا وہ ویسا ہی ہد یہ خُداوند کے لئے لا یا اور جِس کِسی کے پاس کیکر کی لکڑی تھی وہ اُسی کو لے آیا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور جِتنی عورتیں ہو شار تھیں اُنہوں نے اپنے ہاتھوں سے کاٹ کاتکرآسمانی ارغوانی اور سُرخ رنگ کے اور مہین کتان کے تار لاکر دئے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اورجِتنی عورتوں کے دل حکمت کی طرف مائل تھے اُنہوں نے بکریوں کی پشم کاتی ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور جو سردار تھے وہ افُود اور سِینہ سبند کے لئے سلُیمانی پتھر اور اَور جڑاؤ پتھر ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور روشنی اور مسح کر نے کے تیل اور خُوشبُو دار بخور کے لئے مصا لح اور تیل لائے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "یُوں بنی اسرائیل اپنی ہی خُوشی سے خُداوند کے لئے ہدئے لائے یعنی جِس جِس سمرد یا عورت کا جی چاہا کہ اِن کا موں کے لئے جِنکے بننے کا حکم خُداوند نے مُوسیٰ کی معرفت دیا تھا کُچھ دے وہ اُنہوں نے دیا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "ساور مُوسیٰ نے بنی اسرائیل سے کہا دِیکھو خُداوند نے بضلی ایل بِناوری بن حُور کو جو یہوداہ کے قبیلہ میں سے ہے نام لیکر بُلایا ہے ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور اُس نے اُسے حکمت اور فہم اور دانش اور ہر طرح کی صنعت کے لئے رُوح اللّٰد سے معمور کیا ہے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور صعنت کاری میں اور سونے چاندی اور پِیتل کے کام میں ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور جڑاؤ پتھر اور لکڑی کے تراشے میں غرض ہر ایک بادِرکام کے بنانے میں ماہر کیا ہے ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور اُس نے اُسے اخیسمک کے بیٹے اہلیاب کو بھی جو دان کے قبیلہ کا ہے ہُنر سکھانے کی قابلیت بخشی ہے ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اُنکے دِلو ں میں اَیسی حکمت بھر دی ہے جِس سے وہ ہر طرح کی صعنت میں ما ہر ہو ں او کندہ کار کا اور ما ہر اُستا د کا زردوز کا جو آسمانی ارغوانی اور سُرخ رنگ کے کپڑوں اور مہین کتا ن پر گُلکاری کر تا ہے اور جو لاہے کا اور ہر طرح کے دستکار کا کام کر سکیں اور عجیب اور نا دِرچیزیں اِیجاد کر یں ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 36,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "پس بضلی ایل اور اہلیاب اور سب روشن ضمیر آدمی کام کریں جنکو خُداوند نے حکمت اور فہم سے مالا مال کیا ہے تاکہ وہ مُقدس کی عبادت کے سب کام کو خُداوند کے حُکم کے مُطابق انجام دیں۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تب مُوسیٰ نے بضلی ایل اور اہلیاب اور سب روشن ضمیر آدمیوں کو بُلایا جنکے دِل میں خُداوند نے حِکمت بھر دی تھی یعنی جنکے دِل تحریک ہوئی کہ جا کر کام کریں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور جو جو ہدئے بنی اسرائیل لائے تھے کہ اُن سے مُقدس کی عبادت کی چیزیں بنائی جائیں وہ سب اُنہوں نے مُوسیٰ سے لے لئے اور لوگ پھر بھی اپنی خُوشی سے ہر صبح اُسکے پاس ہدیہ لاتے رہے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تب وہ سب عقل مند کار یگر جو مُقدس کے سب کام بنار ہے تھے اپنے اپنے کام کو چھوڑ کر مُوسیٰ کے پاس آئے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور مُوسیٰ سے کہنے لگے سکہ لوگ اِس کام کے سرانجام کے لئے جِسکے بنانے کا حُکم خُداوند نے دیا ہے ضرورت سے بُہت زیادہ لے آئے ہیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب موسیٰ نے جو حکم دیا اُسکا اِعلان اُنہوں نے تمام لشکرگاہ میں کرایا کہ کوئی مرد یا عورت اب سے مُقدس کے لئے ہدیہ دینے کی غرض سے کُچھ اور کام نہ بنائے ۔ یُون وہ لوگ اِور لانے سے روک دِئے گئے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "کیونکہ جو سامان اُنکے پاس پہنچ چُکا تھا وہ سارے کام کو تیا ر کر نے کے لئے نہ فقط کا فی بلکہ زیادہ تھا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور کام کر نے میں جِتنے روشن ضمیر تھے اُنہوں نے مَقدِس کے واسطے باریک بٹے ہو ئے کتان کے اور آسمانی اور ارگوانی اور سُرخ رنگ کے کپڑوں کے دس پردے بنائے جن پر ما ہر اُستاد کے ہاتھ کے کڑھے ہُوئے کر وبی تھے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "ہر پردے کی لمبائی اٹھائیس ہاتھ اور چوَڑائی چار ہاتھ تھی اور وہ سب پردے ایک ہی ناپ کے تھے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس نے پانچ پردے ایک دُوسرے کے ساتھ جوڑ دے اور دُوسرے پانچ پردے بھی ایک دُوسرے کے ساتھ جوڑ دے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُس نے ایک بڑے پردے کے حاشیہ میں اُسکے مِلانے کے رُخ پر آسمانی رنگ کے تُکمے بنا ئے ۔ اَیسے ہی تُکمے اُ س نے دُوسرے بڑے پردہ کی اُس طرف کے حاشیہ میں بنا ئے جد ھر مِلانے کا رُخ تھا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پچاس تُکمے اُس نے ایک پر دہ میں اور پچاس ہی دُوسرے پردہ کے حا شیہ میں اُسکے مِلا نے کے رُخ پر بنا ئے ۔ یہ تُکمے آپس میں ایک دُوسرے کے مقابِل تھے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اُس نے سونے کی پچاس گھُنڈیا ں بنا ئیں اوع اُن ہی گھُنڈیوں سے پر دوں کو آپس میں اَیسا جو ڑ دیا کہ مسکن مِل کر ایک ہو گیا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور مکری کی با لوں سے گیا رہ پر دے مسکن کے اُوپر کے خیمہ کے لئے بنا ئے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "ہر پر دے کی لمبا ئی تیس ہا تھ اور چوَڑائی چا ر ہا تھ تھی اور وہ گیا رہ پر دے ایک ہی نا پ کے تھے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس نے پانچ پر دے تو ایک ساتھ جو ڑے اور چھ ایک ساتھ ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور پچاس تُکمے اُن جُڑے ہو ئے پر دوں میں سے کنا رہ کے پر دہ کے حا شیہ میں بنا اور پچاس ہی تُکمے اُن دُوسرے جُڑے ہو ئے پر دوں میں سے کنا رہ کے پر دہ کے حا شیہ میں بنا ئے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اُس نے پِیتل کی پچاس گھُنڈ یاں بھی بنا ئیں تا کہ اُن سے اُس خیمہ کو اَیسا جو ڑدے کہ وہ ایک ہو جا ئے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور خیمہ کے لئے ایک غلاف مینڈھوں کی سُرخ رنگی ہو ئی کھا لوں کا اور اُسکے لئے غلا ف تخس کی کھالوں کا بنا یا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اُس نے مسکن کے واسطے کیکر کی لکڑی کے تختے بنا ئے کہ کھڑے کئے جا ئیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "ہر تختہ کی لمبا ئی دس ہا تھ اور چوَڑائی ڈیڑھ ہا تھ تھی ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور اُس نے ایک ایک تختہ کے لئے دو دو جُڑی ہُو ئی چُولیں ۔ مسکن کے سب تختوں کی چوُلیں اَیسی ہی بنائیں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور مسکن کے لئے جو تختے بنے تھے اُن میں سے بِیس تختے جنُوبی سمت میں لگا ئے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُس نے اُن بیسوں تختوں کے نیچے چاندی کے چا لیس خا نے بنا ئے یعنی ہر تختہ کی دونوں چوُلوں کے لئے دو دو خا نے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور مسکن کی دُوسری طرف یعنی شمالی سمت کے لئے بِیس تختے بنائے۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور اُنکے لئے بھی چا ند ی کے چا لیس ہی خا نے بنا ئے یعنی ایک تختہ کے نیچے دو دو خا نے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور مسکن کے پچھلے حصّہ یعنی مغربی سمت کے لئے چھ تختے بنا ئے ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور دو تختے مسکن کے دونوں کو نوں کے لئے پچھلے حصّہ میں بنا ئے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "یہ نیچے سے دُہر ے تھے اور اِسی طرح اُو پر کے سر ے تک آکر ایک ہی حلقہ میں مِلا دِئے گئے تھے ۔ اُس نے دونوں کو نو ں کے دونوں تختے اِسی ڈھب کے بنا ئے ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "پس آٹھ تختے تھے اور اُنکے لئے چاندی کے سولہ خانےیعنی ایک ایک تختہ کے لئے دو دو خانے ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور اُس نے کِیکر کی لکڑی کے بینڈے بنائے ۔ پانچ بینڈے مسکن کی ایک طرف کے تختوں کے لِئے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور پانچ بینڈے مسکن کی دُوسری طرف کے تختوں کے لئے اور پانچ بینڈے مسکن کے پچھلے حِصہ میں مغری طرف کے تختوں کے لئے بنائے ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور اُس نے وسطی بینڈے کو اَیسا بنایا کہ تختوں کے بِیچ میں سے ہو کر ایک سِرے سے دُوسرے سِرے تک پُہنچے۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور تختوں کو سونے سے منڈھا اور سونے کے کڑے بنائے تاکہ بینڈوں کے لئے خانوں کاکام دیں اوربینڈوں کو سونے سے منڈھا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اُس نے بِیچ کا پردہ آسمانی ارغوانی اور سُرخ رنگ کے کپڑوں اور بارِیک بٹے ہُوئے کتان کا بنایا جِس پر ماہر اُستاد کے ہاتھ کے کروبی کڑھے ہُوئے تھے۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور اُسکے لئے کیکر کے چارسُتُون بنائے اور اُنکو سونے سے منڈھا۔ اُنکے کُنڈے سونے کے تھے اور اُس نے اُنکے لئے چاندی کے چارخانے ڈھال کر نبائےس۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور اُس نے خیمہ کے دروازہ کے لئے ایک پردہ آسمانی ارغوانی اور سُرخ رنگ کے کپڑوں اور بارِیک بٹے ہُوئے کتان کا بنایا ۔ وہ بیل بُوٹے دار تھا ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور اُسکے لئے پانچ سُتُون کُنڈوں سمیت بنائے اور اُنکے سِروں اور پٹیوں کو سونے سے مندھا ۔ اُنکے لِئے جو پانچ خانے تھے وہ پِیتل کے بنے ہُوئے تھے ۔",
                    },
                ],
            },
            {
                "chap_num": 37,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "بضلی ایل نے وہ صندُوق کِیکر کی لکڑی کا بنایا ۔اُسکی لمبائی ڈھا ئی ہاتھ اور چوڑائی ڈیڑھ ہاتھ اور اُونچائی ڈیڑھ ہاتھ تھی ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اُس نے اُسکے اندر اور باہر حالِص سونا منڈھا اور اُسکے لئِے گرِداگرِد ایک سونے کا تاج بنایا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "س اور اُس نے اُسکے چاروں پایوں پر لگانے کو سونے کے چارکڑے ڈھالے۔دو کڑے تو اُسکی ایک طرف اور دو دُوسری طرف تھے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُس نے کِیکرکی لکڑی کی چوبیں بنا کر اُنکو سونے سے منڈھا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور چوبوں کو صندُوق کی دونوں طرف کے کڑوں میں ڈالا تاکہ صندُوق اُتھایا جائے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اُس نے سر پو ش خالِص سونے کا بنایا ۔ اُسکی لمبائی ڈھائی ہاتھ اور چوڑائی ڈیڑھ ہاتھ تھی ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے سرپوش کے دونوں سِروں پر سونے کے دو کروبی گھڑ کر بنائے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "ایک کروبی کو اُس نے ایک سِرے پر رکَھا اور دُوسرے کو دُوسرے سِرے پر۔دونوں سِروں کے کروبی اور سرپوش ایک ہی ٹکڑے سے بنے تھے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور کرویبوں کے بازُو اُوپر سے پَھیلے ہوئے تھے اور اُنکے بازُوؤں سے سرپوش ڈھکا ہؤا تھا اور اُن کروبیوں کے چہرے سرپوش کی طرف اور ایک دُوسرےکے مُقاِبل تھے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اُس نے وہ میرنکیکر کی لکڑی کی بنائی ۔ اُسکی لمبائی دو ہاتھ اور چوڑائی ایک ہاتھ اور اُنچائی ڈیڑھ ہاتھ تھی ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اُس نے اُسکو خالص سونے سے منڈھا اور اُسکے لئے گِرداگرد سونے کا ایک تاج بنایا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اُس نے ایک کنگنی چار اُنگل چوَڑی اُسکے چاروں طرف رکھیّ ساور اُس کنگنی پر گردا گرد سو نے کا تاج بنا یا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور اُس نے اُسکے لئے سونے کے چار کڑے ڈھا لکر اُنکو اُسکے چاروں پایوں کے چا روں کو نو ں میں لگا یا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "یہ کڑے کنگنی کے پاس تھے تا کہ میز اُٹھا نے کی چو بوں کے خا نوں کا کا م دیں ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اُس نے میز اُٹھا نے کی وہ چو بیں کیکر کی لکڑی کی بنا ئیں اور اُنکو سو نے سے منڈھا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس نے میز پر کے سب طروُف یعنی اُسکے طباق اور چمچے اور بڑے بڑے پیا لے اور اُنڈلینے کے آفتابے خالص سو نے کے بنا ئے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اُس نے شمعدان خالص سونے کا بنا یا ۔ وہ شمعدان اور اُسکا پا یہ اور اُسکی ڈنڈی گھڑے ہُو ئے تھے ۔ یہ سب اور اُسکی پیا لِیاں اور لٹوُ اور پھُول ایک ہی ٹُکڑے کے بنے ہُو ئے تھے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور چھ شا خیں اُسکی دونوں طرف سے نکلی ہو ئی تھیں ۔ شمعدان کی تین شا خیں تو اُسکی ایک طرف سے اور تین شا خیں اُسکی دُوسری طرف سے ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور ایک شا خ میں با دام کے پھُول کی شکل کی تین پیا لِیا ں اور ایک لٹوُ اور ایک پھُول تھا اور دُو سری شا خ میں بھی با دام کے پھُول کی شکل کی تین پیا لِیاں اور ایک لٹوُ اور ایک پھُول تھا ۔ غرض اُس شمعدان کی چھوں شا خوں میں سب کُچھ اَیسا ہی تھا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور خود شمعدان میں با دام کے پھُول کی شکل کی چار پیا لِیا ں اپنے اپنے لٹوُاور پھُول سمیت بنی تھیں ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور شمعدان کی چھؤں نکلی ہو ئی شاخوں میں سے دو دو شا خیں اور ایک لٹوُ ایک ہی ٹُکڑے کے تھے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اُنکے لٹوُ اور اُنکی شا خیں سب ایک ہی ٹُکڑے کے تھے ۔ سارا شمعدان خالص سونے کا اور ایک ہی ٹکُڑے کا گھڑا ہو ا تھا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُس نے اُسکے لئے سات چراغ بنائے اور اُسکے گُلِگیر اور گلُدان خا لص سع نے کے تھے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُس نے اُ سکو اور اُس کے سب ظروُف کو ایک قنطار خالص سونے سے بنا یا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور اُس نے بخور جلانے کی قُر بانگاہ کیکر کی لکڑی کی بنا ئی ۔ اُسکی لمبا ئی اُونچا ئی دو ہا تھ تھی اور وہ اور اُسکے سِینگ ایک ہی ٹُکڑے کے تھے ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور اُس نے اُسکے اُو پر کی سطح اور گردا گر د کی اطراف اور سینگو ں کو خا لص سو نے سے منڈھا اور اُسکے لئےسونے کا ایک تا ج گردا گرد بنایا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اُس نے اُس کی دونوں طرف کے دونو ں پہلُوؤں میں تا ج کے نیچے سو نے کے دو کڑے بنا ئے جو اُس کے اُٹھا نے کی چو بو ں کے لئے خا نو ں کا کا م دیں ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور چو بیں کیکر کی لکڑی کی بنا ئیں اور اُنکو سو نے سے منڈھا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور اُس نے مسح کر نے کا پا ک تیل اور خُوشُبودار مصالح کا خالص بخور گندھی کی حکمت کے مُطابق تیا ر کیا ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 38,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اُس نے سو ختنی قُر بانی کا مذبح کیکر کی لکڑی کا بنا یا ۔ اُس کی لمبائی پانچ ہاتھ اور چَوڑائی پانچ ہاتھ تھی ۔ وہ چوکھُوٹا تھا اور اُسکی اُونچائی تین ہاتھ تھی۔",
                    },
                    {
                        "verse_num": 2,
                        "text": " اور اُس نے اُسکے چاروں کو نوں پر سینگ بنا ئے ۔ سینگ اور وہ مذبح دونوں ایک ہی ٹُکڑے کے تھے اور اُس نے اُسکو پِیتل سے منڈھا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُس نے مذبح کے سب ظروُف یعنی ویگیں اور بیلچے اور کٹورے اور سیحیں اور انگیٹھیاں بنا ئیں ۔ اُسکے سب ظروُف پیتل کے تھے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور اُس نے مذبح کے لئے اُسکی چاروں طرف کنا رے کے نیچے پِیتل کی جا لی کی جھنجری اِس طرح لگائی کہ وہ اُسکی آدھی دُور تک پہنچتی تھی ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُس نے پیتل کی جھنجری کے چاروں کو نو ں میں لگا نے کے لئے چا ر کڑے ڈھا لے تا کہ چو بو ں کے لئے خانو ں کا کا م دیں ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور چو بیں کیکر کی لکڑی کی بنا کر اُنکو پِیتل سے منڈھا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے وہ چو بیں مذبح کی دو نو ں طرف کے کڑوں میں اُسکے اُٹھا نے کے لئے ڈال دیں ۔ وہ کھو کھلا تختوں کا بنا ہوا تھا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور جو خِدمت گذُار عورتیں خیمہ اِجتماع کے دروازہ پر خِدمت کر تی تھیں اُنکے آئینوں کے پِیتل سے اُس نے پِیتل کا حَوض اور پِیتل ہی کی اُسکی کُرسی بنائی ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": " پھر اُس نے صحن بنا یا اور جنوبی سمت کے لئے اُس صحن کے پردے باریک بٹے ہو ئے کتان کے تھے اور سب ملا کر ہاتھ لمبے تھے ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": " اُنکے لئے بیس ستُون اور اُنکے واسطے پِیتل کے بیس خا نے تھے اور سُتونوں کے کُنڈے اور پٹیاں چاندی کی تھیں ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": " اور شمالی سِمت میں بھی وہ سو ہاتھ لمبے اور اُنکے لِئے بیس سُتُون اور اُنکے واسطے بیس ہی پیتل کے خانے تھے اور سُتُونوں کے کُنڈے اور پٹیاں چاندی کی تھیں",
                    },
                    {
                        "verse_num": 12,
                        "text": " اور مغربی سمت کے لئے سب پردے مِلا کر پچاس ہاتھ کے تھے ۔ اُنکے لئے دس سُتُون اور دس ہی اُنکے خانے تھے اور سُتُونوں کے کُنڈے اور پٹیاں چاندی کی تھیں۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور مشرقی سمت میں بھی وہ پچاس ہی ہاتھ کے تھے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اُسکے دروازہ کی طرف پندرہ ہاتھ کے پردے اور اُنکے لئے تین سُتُون اور تین خانے تھے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور دوسری طرف بھی ویسا ہی تھا۔ پس صحن کے دروازہ کے اِدھر اُدھر پندرہ پندرہ ہاتھکے پردے تھے۔ اُنکے لئے تین تین سُتُون اور تین ہی تین خانے تھے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "صحن کے گردا گرد کے سب پردے باریک بٹے ہوئے کتان کے بنے ہوئے تھے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور سُتُونوں کے خانے پیتل کے اور اُنکے اور پٹیاں چاندی کی تھیں۔ اُنکے سرے چاندی سے منڈھے ہوئے اور صحن کے کُل سُتُون چاندی کی پٹیوں سے جڑے ہوئے تھے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور صحن کے دروازہ کے پردہ پر بیل بُوٹے کا کام تھا اور وہ آسمانی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور باریک بٹے ہوئے کتان ک بنا ہوا تھا ۔ اُسکی لمبائی بیس ہاتھ اور اُنچاوئی صحن کے پردوں کی چوڑائی کے مُطابق پانچ ہاتھ تھی ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اُنکے کُنڈے چاندی کے تھے اور اُنکے سروں پر چاندی منڈھی ہوئی اور اُنکی پٹیاں بھی چاندی کی تھیں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور مسکن کی اور صحن کے گردا گرد کی سب میخیں پیتل کی تھیں۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور مسکن یعنی مسکن شہادت کے جو سامان لاویوں کی خدمت کے لئے بنے اور جنکو مُوسیٰ کےحکم کے مطابق ہارون کاہن کے بیٹے اتمر نے گناہ انکا حساب یہ ہے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "بضلی ایل بن اُوری بن حُور نے جو یہوداہ کے قبیلہ کا تھا سب کُچھ جو خداوند نے مُوسیٰ کو فرمایا تھا بنایا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اسکے ساتھ دان کے قبیلہ کا اہلیاب بن اخیمک تھا جو کندہ کار اور ماہر کاریگر تھا اور آسمانی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور باریک کتان پر بیل بوٹے کاڑھتا تھا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "سب سونا جو مقدس کی چیزوں کے کام میں لگا یعنی ہدیہ کا سونا اُنتِیس قنطار اور مقدس کی مثقال کے حساب سے سات سو تیس مثقال تھا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور جماعت میں سے گنِے ہُوئے لوگوں کے ہدیہ کی چاندی ایک سُو قِنطار اور مقِدس کی مثقال کے حِساب سے ایک ہزار سات سُو پچھتر مثقال تھی ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "مَقِدس کی مِثقال کے حِساب سے فی آدمی جو نِکلکر شُمار کئِے ہُوئوں میں مِل گیا ایک بیکا یعنی نِیم مِثقال بِیسں برس اور اُس سے زیادہ عُمر کے لوگوں سے لِیا گیا تھا ۔یہ چھ لاکھ تِین ہزار ساڑھے پانچسو مرد تھے ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اِس سِو قِنطار چاندی سے مَقِدس کے اور بِیچ کے پردہ کے خانے ڈھالے گئے ۔ سو قِنطار سے سَوہی خانے بنے یعنی ایک ایک قِنطار ایک ایک خانے میں لگا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور ایک ہزار سات سُو پچھتر مِثقال چاندی سے سُتُونوں کے کُنڈے بنے اور اُنکے مِیرے منڈھے گئے اور اُنکے لئِےپٹیاں تیار ہُوئیں ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور ہدیہ کا پِیتل ستّر قِنطار اور دو ہزار چار سَو مِثقال تھا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اِس سے اُس نے خیمہ اجتماع کے دروازہ کے خانے اور پِیتل کا مذبح اور اُسکےلئِے پیتل کی جھنجری اور مذبح کے سب ظرُوف ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور صحن کے گِرداگِرد کے خانے اور صحن کے دروازہ کے خانے اور مسکن کی میخیں اور صحن کی چاروں طرف کی میخیں بنائیں ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 39,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اُنہوں نے مقدس میں خدمت کر نے کے لئے آسمانی اور ارغوانی اور سُر خ بیل بُو ٹے کڑے ہُو ئے لِباس اور ہارُون کے واسطے مُقدس لِباس جیسا خُداوند نے مُوسیٰ کو حُکم دیا تھا بنا ئے ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور اُس نے سو نے اور آسما نی اور ارغوانی اور سُر خ رنگ کے کپڑوں اور با ریک بٹے ہُو ئے کتان کا افُود بنا یا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُنہو ں نے سو نا پِیٹ پِیٹ کر پتلے پتلے پتّر اور پتّروں کو کا ٹ کا ٹکر تا ر بنا ئے تا کہ آسمانی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور با ریک بٹے ہُو ئے کتان پر ما ہر اُستاد کی طرح اُن سے زردوزی کر یں ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور افُود کو جو ڑنے کے لئے اُنہوں نے دو مونڈھے بنا اور اُنکے دونو ں سروں کو ملا کر با ندھ دیا ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اُسکے کسنے کے لئے کاریگری سے بنُا ہوا کمر بند اُسکے اُوپر تھا وہ بھی اُسی ٹکڑے اور بنا وٹ کا تھا یعنی سو نے اور آسما نی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور با ریک بٹے ہُو ئے کتا ن کا بنا ہوا تھا جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور انہوں نے سُلیمانی پتھر کا ٹکر صاف کئے جو سو نے کے خا نوں میں جڑے گئے اور اُن پر انگشتری کے نقش کی طرح بنی اِسرائیل کے نام کندہ تھے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اُس نے اُنکو افُود کے مونڈھوں پر لگایا تاکہ وہ بنی اِسرائیل کی یاد گاری کے پتھر ہوں جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اُس نے افُود کی بنا وٹ کا سینہ بند تیار کیا جو ماہر اُستاد کے ہاتھ کا کام تھا یعنی وہ سو نے اور آسما نی اور ارغوانی اور سُرخ رنگ کے کپڑوں اور با ریک بٹے ہُو ئے کتان کا بنا ہُوا تھا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "وہ چوکھُونٹاتھا ۔ انہوں نے اُس سینہ بند کو دُہرا بنا یا اور دُہرے ہو نے پر اُسکی لمبا ئی ایک با لشت اور چوڑائی ایک با لشت تھی ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اِس پر چا ر قطاروں میں اُنہوں نے جو اہر جڑے ۔ یا قُوت سُر خ اور پُکھراج اور زمرّد کی قطار تو پہلی قطا ر تھی ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور دُوسری قطار میں گوہر شب چراغ اور نِیلم اور ہیرا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تیسری قطار لشم اور یشم اور یا قُوت ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "چوتھی قطار میں فیروزہ اور سنگِ سُلیمانی اور زبرجد ۔ یہ سب الگ الگ سو نے کے سو نے کے خا نوں میں جڑے ہُو ئے تھے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور یہ پتھر اِسرائیل کے بیٹوں کے نا موں کے شُمار کے مُطابق با رہ تھے اور انگشتری کے نقش کی طرح با رہ قبیلوں میں سے ایک ایک کا نام الگ الگ ایک ایک پتھر پر کندہ تھا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اُنہو ں نے سینہ بند پر ڈوری کی طرح گُنڈھی ہُو ئی خا لص سو نے کی زنجیریں بنائیں ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُنہوں نے سو نے کے دو خا نے اور سو نے کے دو کڑے بنا ئے اور دونوں کڑوں کو سینہ بند کے دونوں سروں پر لگا یا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور سو نے کی دونوں گُنڈھی ہو ئی زنجیریں اُن کڑوں میں پہنا ئیں جو سینہ بند کے سروں پر تھے ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور دو نو ں گُنڈھی ہو ئی زنجیروں کے با قی دو نو ں سروں کو دونوں خا نوں میں جڑکر اُنکو افُود کے دونوں مونڈھوں پر سامنے کے رُخ لگایا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اُنہوں نے سو نے کے کڑے اور بنا کر اُنکو سینہ کے دونوں سروں کے اُس حاشیہ میں لگا یا جس کا رُخ اندر افُود کی طرف تھا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور اُنہو ں نے سو نے کے دو کڑے اَور بنا کر اُنکو افُود کے دو نوں مونڈھوں کے سامنے کے حصّہ میں اندر کے رُخ جہاں افُود جڑُا تھا لگا یا تاکہ وہ افُودکے کاریگری سے بُنےہُو ئے پٹکے کے اُوپر ر ہے ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور اُنہوں نے سینہ بند کو لیکر اُسکے کڑوں کو افُود کے کڑوں کے ساتھ ایک نیلے فیتے سے اِس طرح باندھا کہ وہ افُود کے کاریگری سے بُنے ہُوئے پٹکے کے اُوپر رہے اور سینہ بند ڈِھیلاہو کر افُود سے الگ نہ ہو نے پائے جیسا خُداوند نے مُوسیٰ کو حُکم دیا تھا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور اُس نے افُود کا جُبہّ بنُا کر بِالکل آسمانی رنگ کا بنا یا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُسکا گریباں زِرہ کے گریباں کی طرح بیچ میں تھا اور اُسکے گِردا گِرد گوٹ لگی ہُوئی تھی تاکہ وہ پھٹ نہ جائے ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اُنہوں نے اُس کے دامن کےگھیرمیں آسمانی اور ارغوانی اور سُرخ رنگ کے بٹے ہوئے تارے انار بنائے ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور خالص سونے کی گھنٹیاں بنا کر اُنکو جُبہّ کے دامن کے گھیر میں چاروں طرف اناروں کے درمیان لگایا ۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "پس جُبّہ کے دامن کے سارے گھیر میں خِدمت کر نے کے لئے ایک ایک گھنٹی تھی اور پھر ایک ایک انار جیسا خُداوند نے مُو سیٰ کو حُکم دیا تھا۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اُنہوں نے باریک کتان کے بُنے ہُو ئے کُرتے ہارُون اور اُسکے بیٹوں کے لئے بنا ئے ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور با ریک کتا ن کا عما مہ اور با ریک کتان کی خُوبصورت پگڑیاں اور با ریک بٹے ہُو ئے کتان کے پا جا مے ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور سُرخ رنگ کے کپڑوں کا بیل بُوٹے دار کمر بند بھی بنا یا جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور اُنہوں نے مُقدس تاج کا پتّر خالص سونے کا بناکر اپس پر انگشتری کے نقش کی طرح یہ کندہ کیا خُداوند کے لئے مُقدس ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور اُسے عمامہ کے ساتھ اُوپر باندھنے کے لئے اُس میں ایک نیلا فیتہ لگایا جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اِس طرح خیمہ اِجتماع کے مسکن کا سب کا م ختم ہو ا اور بنی اِسرائیل نے سب کُچھ جیسا خُداوند نے مُو سیٰ کو حُکم دیا تھا ویسا ہی کیا ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور وہ مسکن کو مُوسیٰ کے پاس لائے یعنی خیمہ اور اُسکا سارا سامان اُسکی گھُنڈیاں اور تکتے اور بینڈے اور سُتون اور خانے ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور گھٹا ٹوپ ۔ مینڈھوں کی سُرخ رنگی ہو ئی کھالوں کا غلاف اور تخس کی کھالوں کی غلاف اور بیچ کا پردہ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "شہادت کا صندوُق اور اُسکی چوبیں اور سر پوش ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور میز اور اُسکے سب ظروُف اور نذر کی روٹی ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "اور پاک شمعدان اور اُسکی سجاوٹ کے چراغ اور اُسکے سب ظروُف اور جلا نے کا تیل ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "اور زرّین قُربانگاہ اور مسح کر نے کا تیل اور خُوشبُو دار بخور اور خیمہ کے دروازہ کا پردہ ۔",
                    },
                    {
                        "verse_num": 39,
                        "text": "اور پیتل منڈھا ہو ا مذبح اور پیتل کی جھنجری اور اُسکی چو بیں اور اُسکے سب ظروُف اور حَوض اور اُسکی کُرسی ۔",
                    },
                    {
                        "verse_num": 40,
                        "text": "صحن کے پردے اور اُنکے سُتون اور خانے اور صحن کے دروازہ کا پردہ اور اُسکی رسّیاں اور میخیں اور خیمہ اِجتماع کے کام کے لئے مسکن کی عبادت کے سب سامان ۔",
                    },
                    {
                        "verse_num": 41,
                        "text": "اور پاک مقام کی خدمت کے لئے کڑھے ہوئے لِباس اور ہارُون کاہن کے مُقدس لِباس اور اُسکے بیٹوں کے لِباس جنکو پہن کر اُنکو کا ہن کی خدمت کو انجام دینا تھا ۔",
                    },
                    {
                        "verse_num": 42,
                        "text": "جو کُچھ خُداوند نے مُوسیٰ کو حُکمکیا تھا اُسی کے مُطابق بنی اِسرائیل نے سب کام بنا یا ۔",
                    },
                    {
                        "verse_num": 43,
                        "text": "اور مُوسیٰ نے سب کام کا مُلاحظہ کیا اور دیکھا کہ اُنہوں نے اُسے کر لیا ہے جیسا خُداوند نے حُکم دیا تھا اُنہوں نے سب کُچھ ویساہی کیا اور مُو سیٰ نے اُنکو بر کت دی ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 40,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوندنے مُوسیٰ سے کہا ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "پہلے مہینے کی پہلی تاریخ کو تُو خیمہ اِجتماع کے مسکن کو کھڑا کر دینا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور اُس میں شہادت کا صنُدوق رکھ کر صنُدوق پر بیچ کا پر دہ کھینچ دینا ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور میز کو اند ر لے جا کر اُس پر کی سب چیزیں ترتیب سے سجا دینا اور شمعدان کو اندر کر کے اُسکے چراغ روشن کر دینا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور بخُور جلا نے کی زرّین قُربانگاہ کو شہادت کے صنُدوق کے سامنے رکھنا اور مسکن کے دروازہ کا پر دہ لگا دینا ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور سو ختنی قُربا نی کا مذبح خیمہ اِجتماع کے مسکن کے دروازہ کے سامنے رکھنا ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور حَوض کو خیمہ اِجتماع اور مذبح کے بیچ میں رکھ کر اُس میں پا نی بھر دینا ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور صحن کو چاروں طرف سے گھیر کر صحن کے دروازہ میں پردہ لٹکا دینا ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور مسح کر نے کا تیل لیکر مسکن کو اور اُسکے اندر کی سب چیزوں کو مسح کر نا اور یُوں اُسے سب ظروُف کو مُقدس کر نا ۔ تب وہ مُقدس ٹھہر یگا ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور تُو سو ختنی قُربانی کے مذبح اور اُسکے سب ظروُف کو مسح کر کے مذبح کو مُقدس کر نا ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور مذبح نہایت ہی مُقدس ٹھہریگا۔اور تُو حَوض اور اُسکی کُرسی کو بھی مسح کر کے مُقدس کر نا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور ہا رُون اور اُسکے بیٹوں کو خیمہ اِجتماع کے دروازہ پر لا کر اُنکو پا نی سے غسل دلانا ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور ہارُون کو مُقدس لِباس پہنانا اور اُسے مسح اور مُقدس کر نا تا کہ وہ میرے لئے کا ہن کی خِدمت کو انجام دے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اُسکے بیٹوں کو لا کر اُنکو کُرتے پہنانا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جیسے اُنکے باپ مسح کرے ویسے ہی اُنکو بھی مسح کرنا تاکہ وہ میرے لئے کا ہن کی خدمت کو انجام دیں اور اُنکا مسح ہو نا اُنکے لئے نسل در نسل ابدی کہانت کا نشان ہو گا ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور مُوسیٰ نے سب کُچھ جیسا خُداوند نے اُسکو حُکم کیا تھا اُسی کے مُطابق کیا ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور دُوسرے سال کے پہلے مہینے کی پہلی تاریخ کو مسکن کھڑا کیا گیا ۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور مُوسیٰ نے مسکن کو کھرا کیا اور خانوں کو دھر اُن میں تختے لگا اُنکے بینڈے کھینچ دِئے اور اُسکے سُتونوں کو کھڑا کر دیا ۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور مسکن کے اُوپر خیمہکو تان دیا اور خیمہ پر اُسکا غلاف چڑھا دیا جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "اور شہا دت نامہ کو لیکر صنُدوق میں رکھّا اور چو بوں کو صنُدوق میں لگا کر سر پوش کو صنُدوق کے اُوپر دھرا ۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "پھر اُس صنُدوق کو مسکن کے اند لا یا اور بیچ کا پردہ لگا کر شہادت کے صنُدوق کو پردہ کے اندر کیا جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور میز کو اُس پردہ کے باہر مسکن کی شما لی سمت میں خیمہ اِجتماع کے اند رکھّا ۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور اُس پر خُداوند کے رُوبُرو روٹی سجا کر رکھّی جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور خیمہ اِجتماع کے اندر ہی میز کے سامنے مسکن کی جنُوبی سمت میں شمعدان کو رکھّا ۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور چراغ خُداوند کے رُوبُرو روشن کردئے جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور زرّین قُربا نگاہ کو خیمہ اِجتما ع کے اند پردہ کے سامنے رکھّا ۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اُس پر خُوشبُو دار مصالح کا بخُور جلایا جیسا خُداوند نے مُوسیٰ کو حُکم کیا تھا۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "اور اُس نے مسکن کے دروازہ میں پردہ لگایا ۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور خیمہ اِجتماع کے مسکن کے دروازہ پر سو ختنی قُر با نی کا مذبح رکھ کر اُس پر سو ختنی قُربا نی اور نذر کی قُر با نی چڑھا ئی جیس خُداوند نے مُو سیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور اُس نے حَوض کو خیمہ اِجتماع اور مذبح کے بیچ میں رکھ کر اُس میں دھونے کے لئے پا نی بھر دیا ۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور مُوسیٰ اور ہا رُون اور اُسکے بیٹوں نے اپنے اپنے ہاتھ پاؤں اُس میں دھو ئے ۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "جب وہ خیمہ اِجتما کے اندر داخل ہو تے اور جب جب وہ مذبح کے نزدیک جا تے تو اپنے آپ کو دھو کر جا تے تھے جیسا خُداوند نے مُو سیٰ کو حُکم کیا تھا ۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور اُس نے مسکن اور مذبح کے گردا گرد صحن کو گھیرکر صحن کے دروازہ کا پردہ ڈالدِیا ۔ یُوں مُوسیٰ نے اُس کام کو ختم کیا ۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "تب خیمہ اِجتماع پر ابرچھا گیا اور مسکن خُداوند کے جلال سے معمور ہو گیا ۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور مُوسیٰ خیمہ اِجتماع میں داخل نہ ہو سکا کیو نکہ وہ ابر اُس پر ٹھہرا ہو ا تھا اور مسکن خُداوند کے جلال سے معمور تھا ۔",
                    },
                    {
                        "verse_num": 36,
                        "text": "اور بنی اِسرائیل کے سارے سفر میں یہ ہو تا رہا کہ جب وہ ابر مسکن کے اُوپر سے اُٹھ جاتا تو وہ آگے بڑھتے ۔",
                    },
                    {
                        "verse_num": 37,
                        "text": "پر اگر وہ ابر نہ اُٹھتا تو وہ اُس دن تک سفر نہیں کر تے تھے جب تک وہ اُٹھ نہ جاتا ۔",
                    },
                    {
                        "verse_num": 38,
                        "text": "کیو نکہ خُداوند کا ابراِسرائیل کے سارے گھرانے کے سامنے اور اُنکے سارے سفر میں دِن کے وقت تو مسکن کے اُوپر ٹھہرا رہتا اور رات کو اُس میں آگ ر ہتی تھی ۔",
                    },
                    
                ],
            },
            
        ],
    },
    {
        "book_id": 3,
        "book_title": "احبار",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خُداوند نے خیمہِ اجتماع میں سے موسیٰ کو بُلا کر اُس سے کہا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "بنی اسرائیل سے کہہ کر جب تم میں سے کوئی خُداوند کے لئے چڑھاوا چڑھا ئے تو تم چوپاں یعنی گائے بیل اور بھیڑ مکری کا چڑھاوا چڑھانا ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اگر اُس کا چڑھاوا گائے بیل کی سوختنی قُربانی ہوتو وہ بے عیب نرکر لاکر اُسے خیمہ اجتماع کے دروازے پر چڑھائے تاکہ وہ خُود خُداوند کے حضور مقبول ٹھہرے ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور وہ سوختنی قُربانی کے جانور کے سر پر اپنا ہاتھ رکھے تب وہ اُس کی طرف سے مقبول ہوگا تاکہ اُس کے لئے کفارا ہو ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ اُس بچھڑے کوخُداوند کے حضور ذبح کرے اور ہارون کے بیٹے جو کاہن ہیں خون کو لاکر اُسے اُس مذبح پر گرداگرد چھڑکیں جو خیمہ اجتماع کے دروازہ پر ہے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تب وہ اس سوختنی قُربانی کے جانور کی کھال کھینچے اور اُس کے غضو عُضوکو کاٹ کر جداجدا کرے ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "پھر ہارُون کاہن کے بیٹے مذبح پر آگ رکھیں اور آگ پر لکڑیاں ترتیب سے چُن دیں ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اورہارُون کے بیٹے جو کاہن ہیں اُس کے اعضاکو اور سراورچربی کو اُن لکڑیوں پر جو مذبح کی آگ پر ہونگی ترتیب سے رکھ دیں ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "لیکن وہ اُس کی انتڑیوں اور پایوں کو پانی سے دھولے تب کاہن سب کو مذبح پر جلائے کہ وہ سوختنی قُربانی یعنی خُداوند کے لئے راحت انگیز خوشبو کی آتشین قُربانی ہو ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور اگر اُس کا چڑھاوار یوڑیں سے بھیڑ یا بکر ی کی سوختنی قُربانی ہو تو وہ بے عیب نرکو لائے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور وہ اُسے مذبح کی شمالی سمت میں خُداوند کے آگے ذبح کرے اور ہارون کے بیٹے جو کاہن ہیں اُس کے خُون کو مذبح پر گردا گرد چھڑکیں ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "پھر وہ اُس کے عُضو عُضو کو اور سراور چربی کاٹ کر جداجدا کرے اور کاہن ان کو ترتیب سے ان لکڑیوں پر جو مذبح کی آگ پر ہونگی چن دے ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "وہ انتڑیوں اور پایوں کی پانی سے دھولے تب کاہن سب کو لیکر مذبح پر جلادے ۔ وہ سوختنی قُربانی یعنی خُداوند کے لئے راحت انگیزخوشبوکی آتشین کی آتشین قُربانی ہے ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اگر اُس کا چڑھاوا خداوند کے لئے پرندوں کی سوختنی قربانی ہو تو وہ قمریوں یا کبُوتر کے بچوں کا چڑھاوا چڑھائے ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور کاہن اُس کا خُون مذبح کے پر لاکر اس کا سر مروڑ ڈالے اور اُسے مذبح پر جلادے اور اُس کا خُون مذبح کے پہلو پر گرجانے دے ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور اُس کے پوٹے کو آلایش سمیت لے جاکر مذبح کی مشرقی سمت میں راکھ کی جگہ میں ڈال دے ۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور وہ اُس کے دونوں بازوؤں کو پکڑ کر اسے چیرے پر الگ الگ نہ کرے ۔ تب کاہن اسے مذبح پر اُن لکڑیوں کے اوپر رکھ کر جو آگ پر ہونگی جلادے ۔ وہ سوختنی قُربانی یعنی خداوند کے لئے راحت انگیز خوشبو کی آتشین قُربانی ہے ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 2,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اگر کوئی خُداوند کے لئے نذرکی قُربانی کا چڑھاوا لائے تو اپنے چڑھاوے کے لئے میدہ لے اور اُس میں تیل ڈال کر اُس کے اوپر لبان رکھے ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور وہ اُ سے ہارون کے بیٹوں کے پاس جو کاہن ہیں لائے اور تیل ملے ہوئے میدہ میں سے اس طرح اپنی مٹھی بھر کر نکالے کہ سب لبان اُس میں آجائے تب کاہن اُسے نذر کی کی قُربانی کی یاد گاری کے طور پر مذبح کے اوپر جلائے ۔ یہ خُداوند کے لئے راحت انگیز خوشبو کی آتشین قُربانی ہو گی ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور جو کچھ اس نذر کی قُربانی میں سے باقی رہ جائے وہ ہارون اور اس کے بیٹوں کاہو گا ۔یہ خُداوند کی آتشین قُربانیوں میں پاکترین چیز ہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور جب تو تنور کا پکا ہوا نذر کی قربانی کا چڑھاوا لائے تو وہ تیل ملے ہوئے میدہ کے بے خمیری گردے یا تیل چپڑی ہوئی بے خمیری چپاتیاں ہوں ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور اگر تیری نذر کی قُربانی کا چڑھاوا توے کا پکا ہوا ہو تو تیل ملے ہوئے بے خمیری میدہ کا ہو ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اُس کو ٹکڑے ٹکڑے کر کے اُس پر تیل ڈالنا تو وہ نذر کی قُربانی ہو گی ۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اگر تیری نذر کی قُربانی کا چڑھاوا کڑاہی کا تلا ہوا ہو تو وہ میدہ سے تیل میں بنایا جائے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تو ان چیزوں کی نذر کی قربانی کا چڑھاوا خداوند کے پاس لانا ۔ وہ کاہن کو دیا جائے اور وہ اسے مذبح کے پاس لائے ۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور کاہن اُس نذر کی قُربانی میں سے اس کی یاد گاری کا حصہ اٹھا کر مذبح پر جلائے ۔ یہ خداوند کے لئے راحت انگیزخوشبوکی آتشین قُربانی ہوگی ۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور جو کچھ اُس نذر کی قربانی میں سے بچ رہے وہ ہارُون اور اُس کے بیٹوں کا ہو گا ۔ یہ خداوند کی آتشین قربانیوں میں پاکترین چیز ہے ۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "کوئی نذر کی قُربانی جو تم خداوند کے حضور چڑھاؤ وہ خمیر ملا کر نہ بنائی جائے تم کبھی آتشین قربانی کے طور پر خداوند کے حضور خمیر یا شہد نہ جلانا ۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "تم ان کو پہلے پھلوں کے چڑھاوے کے طور پر خداوند کے حضور لانا ۔ پر راحت انگیز خوشبو کے لیے وہ مذبح پر نہ چڑھائے جائیں ۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور تو اپنی نذر کی قُربانی کے ہر چڑھاوے کو نمکین بنانا اور اپنی کسی نذر کی قُربانی کو اپنے خدا کے عہد کے نمک بغیر نہ رہنے دینا ۔ اپنے سب چڑھاووں کے ساتھ نمک بھی چڑھانا ۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور اگر تُو پہلے پھلوں کی نذر کا چڑھاوا خداوند کے حضور چڑھائے تو اپنے پہلے پھلوں کی نذر کے چڑھاوے کے لئے اناج کی بھنی ہوئی بالیں یعنی ہری ہری بالوں مین سے ہاتھ سے ملکر نکالے ہوئے اناج کو چڑھانا ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور اس میں تیل ڈالنا اور اس کے اوپر لبان رکھنا تو وہ نذر کی قُربانی ہوگی ۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور کاہن اس کی یاد گاری کے حصہ کو یعنی تھوڑے سے ملکر نکالے ہوئے دانوں کو ارو تھوڑے سے تیل کو اور سارے لبان کو جلادے یہ خُداوند کے لئے آتشین قربانی ہوگی۔",
                    },
                    
                ],
            },
            {
                "chap_num": 3,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اگر اُس کا چڑھائے تو خواہ وہ نر ہو اور وہ گائے بیل میں سے کسی کو چڑھائے تو خواہ وہ نر ہو یا مادہ پر جو بے عیب ہو اسی کو وہ خداوند کے حضور چڑھائے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اور وہ اپنا ہاتھ اپنے چڑھاوے کے جانور کے سر پر رکھے اور خمیہ اجتماع کے دروازہ پر اسے ذبح کرے اور ہارون کے بیٹے و کاہن ہیں اُس کے خون کو مذبح پر گرداگرد چھڑکیں ۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور وہ سلامتی کے ذبیحہ میں سے خداوند کے لیےآتشین قُربانی گذرانے یعنی جس چربی سے انتڑیاں ڈھکی رہتی ہیں",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور وہ ساری چربی جو کمر کے پاس رہتی ہےاور جگر پر کی جھلی گردوں سمیت ان سبھوں کو وہ جدا کرے ۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور ہارون کے بیٹے انہیں مذبح پر سوختنی قُربانی کے اوپر جلائیں جو ان لکڑیوں پر ہوگی جو آگ کے اوپر ہیں ۔ یہ خداوند کے لئے راحت انگیز خوشبو کی آتشین قُربانی ہے ۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور اگر اس کا سلامتی کے ذبیحے کا چڑھاوا خداوند کے لئے بھیڑ بکری میں سے ہو تو خواہ نر ہو یا مادہ پر جو بے عیب ہو اسی کو وہ چڑھائے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اگر وہ برہ چڑھاتا ہو تو اسے خداوند کے حضور چڑھائے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "اور اپنا ہاتھ اپنے چڑھاوے کے جانور کے سر پر رکھے اور اسے خیمہ اجتماع کے سامنے ذبح کرے اور ہارون کے بیٹے اس کے خون کو مذبح پر گرداگرد چھڑکیں",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور وہ سلامتی کے ذبیحہ میں سے خداوند کے لئے آتشین قربانی گزرانے ینعنی اس کی پوری چربی بھری دم کو وہ ریڑھ کے پاس سے الگ کرے اور جس چربی سے انتڑیاں ڈھکی تہتی ہیں اور وہ ساری چربی جو انتڑیوں پر لپٹی رہتی ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور دونوں گردے اور انکے اوپر کی چربی جو کمرے پاس رہتی ہے اور جگر پر کی جھلی گردوں سمیت سبھوں کو وہ الگ کرے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور کاہن انہیں مذبح پر جلائے، یہ اس آتشین قربانی کی غذا ہے جو خداوند کو گذرانی جاتی ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "اور اگر وہ بکرایا بکری چڑھاتا ہو تو اسے خداوند کے حضور چڑھائے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اور وہ اپنا ہاتھ اس کے سر پر رکھے اور اسے خیمہ اجتماع کے سامنے ذبح کرے اور ہارون کے بیٹے اس کے خون کو ذبح پر گرداگرد چھڑکیں۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور وہ اس میں سے اپنا چڑھاوا آتشین قربانی کے طور پر خداوند کے حضور گذرانے یعنی جس چربی سے انتڑیاں ڈھکی رہتی ہیں اور وہ سب چربی جو انتڑیوں پر لپٹی رہتی ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور دونوں گردے اور ان کے اوپر کی چربی جو کمرے کے پاس رہتی ہے اور جگر پر کی جھلی گردوں سمیت ان سبھوں کو وہ الگ کرے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور کاہن ان کو مذبح پر جلائے۔ یہ اس آتشین قربانی کی غذا ہے جو راست انگیز خوشبو کے لئے ہوتی ہے۔ ساری چربی خداوند کی ہے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "یہ تمہاری سب سکونت گاہوں میں نسل درنسل ایک دائمی قانون رہگا کہ تم چربی یا خون مطلق نہ کھاؤ۔",
                    },
                    
                ],
            },
            {
                "chap_num": 4,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور خداوند نے موسی سے کہا کہ۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "بنی اسرائیل سے کہہ کہ اگر کوئی ان کاموں میں سے جنکو خداوند نے منع کیا ہے کسی کام کو کرے اور اس سے نادانستہ خطا ہو جائے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اگر کاہن ممسوح کے واسطے جو اس نے کی ہے ایک بے عیب بچھڑا خطا کی قربانی کے طور پر خداوند کے حضور گزرانے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "وہ اس بچھڑے کو خیمہ اجتماع کے دروازہ پر خداوند کے آگے لائے اور بچھڑے کے سر پر اپنا ہاتھ رکھے اور اس کو خدواند کے آگے ذبح کرے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور وہ کاہن ممسوح اس بچھڑے کے خون میں سے کچھ لیکر اسے خیمہ اجتماع میں لے جائے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور کاہن اپنی انگلی خون میں ڈبو ڈبو کر اور خون میں سے لے لیکر اسے مقدس کے پردہ کے سامنے سات بار خداوند کے آگے جھڑکے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور کاہن اسی خون میں سے خوشبع دار بخور جلانے کی قربانگاہ کے سینگوں پر جو خیمہ اجتماع میں ہے خدواند کے آگے لگائے اور اس بچڑے کے باقی سب خون کو سوختنی قربانی کے مذبح کے پایہ پر جو خیمہ اجتماع کے دروازہ پر ہے انڈیل دے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "پھر وہ خطا کی قربانی کے بچھڑے کی سب چربی کو اس سے الگ کرے یعنی جس چربی سے انتڑیاں ڈھکی رہتی ہیں اور وہ سب چربی جو انتڑیوں پر لپٹی رہتی ہے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور دونوں گردے اور ان کے اوپر کی چربی جو کمرکے پاس رہتی ہےاور دونوں گردے اور ان کے اوپر کی چربی جو کمرکے پاس رہتی ہے اور جگر پر کی جھلی گردوں سمیت ان سبھوں کو وہ ویسے ہی الگ کرے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "جیسے سلامتی کے ذبیحہ کے بچھڑے سے وہ الگ کئے جاتے ہیں اور کاہن ان کو سوختنی قربانی کے ذبح پر جلائے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اس بچھڑے کی کھال اور اس کا سب گوشت اور سر اور پائے اور انتڑیاں اور گوبر۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "یعنی پورے بچھڑے کو لشکر گاہ کے باہر کسی صاف جگہ میں جہان راکھ پڑتی ہے لیجائے اور سب کچھ لکڑیوں پر رکھ کر آگ سے جلائے۔ وہ وہیں جلایا جائے جہاں راکھ ڈالی جاتی ہے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "اگر بنی اسرائیل کی ساری جماعت سے انجانے چوک ہو جائے اور یہ بات جماعت کی آنکھوں سے چھپی تو ہو تو بھی وہ ان کاموں میں سے جنہیں خداوند نے منع کیا ہے کسی کام کو کرکے مجرم ہو گئی ہو۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "تو اس خطا کے جس کے وہ قصور وار ہوں معلوم ہو جانے پر جموعت ایک بچھڑا خطا کی قربانی کے طور پر چڑھانے کے لئے خیمہ اجتماع کے سامنے لائے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اور جماعت کے بزرگ اپنے اپنے ہاتھ خداوند کے آگے اس بچھڑے کے سر پررکھیں اور بچھڑا خداوند کے آگے ذبح کیاجائے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور کاہن ممسوح اس بچھڑے کے کون میں سے کچھ خیمہ اجتماع میں لے جائے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور کاہن اپنی انگلی اس خون میں ڈبو کر اسے پردہ کے سامنے سات بارخداوند کے آگےچھڑکے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور اسی خون میں سے مذبح کے سینگوں پر خداوند کے آگے خیمہ اجتماع میں ہے لگائے اور باقی سارا خون سوختنی قربانی کے مذبح کے پایہ پر جو خیمہ اجتماع کے دروازہ پر ہے اندیل دے۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اور اس کی سب چربی اس سے الگ کر کے اسے مذبح پر جلائے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "وہ بچھڑے سے یہی کرے یعنی جو کچھ خطا کی قربانی کے بچھڑے سے کیا تھا وہی اس بچھڑے سے کرے۔ یوں کاہن ان کے لئے کفارہ دے تو انہیں معافی ملے گی۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اور وہ اس بچھڑے کو لشکر گاہ کے باہر لے جا کر جلائے جیسے پہلے بچھڑے کو جلایا تھا۔ یہ جماعت کی خطا کی قربانی ہے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": "اور جب کسی سردار سے خطا سرزد ہو اور وہ ان کاموں میں سے جنہیں خداوند نے منع کیا ہے کسی کام کا نادانستہ کر بیٹھے اور مجرم ہو جائے۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "تو جب وہ خطا جو اس سے سرزد ہوئی ہے اسے بتادی جائے تو وہ ایک بے عیب بکرا اپنی قربانی کے واسطے لائے۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اور اپنا ہاتھ اس بکرے کے سر پر رکھے اور اسےاس جگہ ذبح کرے جہاں سوختنی قربانی کے جانور خداوند کے آگے ذبح کرتے ہیں۔ یہ خطا کی قربانی ہے۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اور کاہن خطا کی قربانی کا کچھ خون اپنی انگلی پر لیکر اسے سوختنی قربانی کے مذبح کے سینگوں پر لگائے اور اسکا باقی سب خون سوختنی قربانی کے مذبح کے پایہ پر انڈیل دے۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اور سلامتی کے ذبیحہ کی چربی کی طرح اس کی سب چربی مذبح پر جلائے۔یوں کاہن اس کی خطا کا کفارہ دے تو اسے معافی ملے گی۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "اور اگر کوئی عام آدمیوں میں سے نادانستہ خاطا کرے اور ان کاموں میں سے جنہیں خداوند نے منع کیا ہے کسی کام کو کر کے مجرم ہو جائ۔",
                    },
                    {
                        "verse_num": 28,
                        "text": "تو جب وہ خطا جو اس نے کی اسے بتادی جائے تو وہ اپنی اس خطا کے واسطے جو اس سے سرزد ہوئی ہے ایک بے عیب بکری لائے۔",
                    },
                    {
                        "verse_num": 29,
                        "text": "اور وہ اپنا ہاتھ خطا کی قربانی کے جانور کو سوختنی قربانی کی جگہ پر ذبح کرے۔",
                    },
                    {
                        "verse_num": 30,
                        "text": "اور کاہن اس کا کچھ خوناپنی انگلی پر لیکر اسے سوختنی قربانی کے مذبح کے سینگوں پر لگائے اور اسکا باقی سب خون مذبح کے پایہ پر انڈیل دے۔",
                    },
                    {
                        "verse_num": 31,
                        "text": "اور وہ اسکی ساری چربی کو الگ کرے جیسے سلامتی کے ذبحیہ کی چربی الگکی جاتی ہے اور کاہن اسے مذبح پر راحت انگیز خوشبو کے طور پر خداوند کے لیئے جلائے۔ یوں کاہن اس کے لئے کفارہ دے تو اسے معافی ملے گی۔",
                    },
                    {
                        "verse_num": 32,
                        "text": "اور اگر خطا کی قربانی کے لئے اس کا چڑھاوا برہ ہو تو وہ بے عیب مادہ لائے۔",
                    },
                    {
                        "verse_num": 33,
                        "text": "اور اپنا ہاتھ خطا کی قربانی کے جانور کے سرپر رکھے اور اسے خطا کی قربانی کے طور پر اس جگہ ذبح کرے جہاں سوختنی قربانی ذبح کرتے ہیں۔",
                    },
                    {
                        "verse_num": 34,
                        "text": "اور کاہن خطا کی قربانی کا کچھ خون اپنی انگلی پر لیکر اسے سوختنی قربانی کے مذبح کے سینگوں پر لگائے اور اسکا باقی سب خون مذبح کے پایہ پر انڈیل دے۔",
                    },
                    {
                        "verse_num": 35,
                        "text": "اور اسکی سب چربی کو الگ کرے جیسے سلامتی کے ذبحیہ کے برہ کی چربی الگ کی جاتی ہے اور کاہن اس کو مذبح پر خداوند کی آتشین قربانیوں کے اوپر جلائے۔یوں کاہن اس کے لئے اس کی خطا کا جو اس سے ہوئی ہے کفارہ دے تو اسے معافی ملے گی۔",
                    },
                ],
            },
            {
                "chap_num": 5,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اور اگر کوئی اس طرح خطا کرے کہ وہ گواہ ہو اور اسے قسم دی جائے کہ آیا اس نے کچھ دیکھا یا اسے کچھ معلوم ہے اور وہ نہ بتائے تو اسکا گناہ اسی کے سر لگیگا۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "یا اگ کوئی شخص کسی ناپاک چیز کو چھولے خواہ وہ ناپاک جانور یا ناپاک چوپائے یا ناپاک رینگنے والے جاندار کی لاش ہو تو چاہے اسے معلوم بھی نہ ہو کہ وہ ناپاک ہو گیا ہے تو بھی وہ مجرم ٹھہریگا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "یا اگر وہ انسان کی ان نجاستوں میں سے جن سے وی نجس ہو جاتا ہے کسی نجاست کو چھولے اور اسے معلوم نہ ہو تو وہ اس وقت مجرم ٹھہیگا جب اسے معلوم ہو جایئگا۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "یا اگر کوئی بغیرسوچے اپنی زبان سے برائی یا بھلائی کرنے کی قسم کھالے تو قسم کھا کر وہآدمی چاہے کیسی ہی بات بغیر سوچے کہدے بشرطیکہ اسے معلوم ہوجائیگا۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اور جب وہ ان باتوں میں سے کسی میں مجرم ہو تو جس امر میں اس سے خطا ہوئی ہے وہ اس کا اقرار کرے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "اور خداوند کے حضور اپنے مجرم کی قربانی لائے یعنی جو خطا اس سے ہوئی ہےاس کے کئے ریوڑ میں سے ایک مادہ یعنی ایک بھیڑیا بکری خطا کی قربانی کے طور پر گزرانے اور کاہن اس کی خطا کا کفارہ دے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اور اگر اسے بھیڑ دینے کا مقدور نہ ہو تو وہ اپنی خطا کے لئے جرم کی قربانی کے طور پر دو قمریاں یا بوتر کے دو بچے خداوند گزرانے۔ ایک خطا کی قربانی کے لئے اور دوسرا سوختنی قربانی کے لئے ۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "وہ انہیں کاہن کے پاس لے آئے جو پہلے اسے جو خطا کی قربانی کے لئے ہے گزرانے اور اس کا سر گردن کے پاس سے مروڑ ڈالے پر اسے الگ نہ کرے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اور خطا کی قربانی کا کچھ خون مذبھ کے پہلو پر چھڑکے اور باقی خون کو مذبح کے پایہ پر گر جانے دے۔ یہ خطا کی قربانی ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اوردوسرے پرندے کو حکم کے موافق سوختنی قربانی کے طور پر چڑھائے۔یوں کاہن اس کی خطا کا جو اس نے کی ہے کفارہ دے تو اسے معافی ملے گی۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اور اگر اسے دوقمریاں یا کبوتر کے دو بچے لانے کا بھی مقدور نہ ہو ہو تو اپنی خطا کے واسطے اپنے چڑھاوے کے طور پر ایفہ کے دسویں حصہ کے برابر میدہ خطا کی قربانی کے لئے لا۴ے۔ اس پر نہ تو وہ تیل ڈالے نہ لبان رکھے کیونکہ یہ خطا کی قربانی ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "وہ اسے کاہن کے پاس لائے اور کاہن اس میں سے اپنی مٹھی بھر کر اس کی یاد گاری کا حصہ مذبح پر خداوند کی آتشین قربانی کے اوپر جلائے۔یہ خطا کی قربانی ہے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "یوں کاہن اس کے لئے ان باتوں میں سے جس کسی میں سے خطا ہوئی ہے اس خطا کا کفارہ دے تو اسے معافی ملے گی اور جو کچھ باقی رہ جائے گا وہ نذر کی قربانی کی طرح کاہن کا ہو گا۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور خداوند نے موسی سے کہا کہ۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "اگر خداوند کی پاک چیزوں میں کسی سے تقصیر ہو اور وہ نادانستہ خطا کرے تو وہ اپنے جرم کی قربانی کے طور پر ریوڑ میں سے بے عیب مینڈھا خداوند کےحضور چڑھائے۔جرم کی قربانی کے لئے اس کی قیمت مقدس کی مثقال کے حساب سے چاندی کی اتنی ہی مثقالیں ہوں جیتنی تو مقرر کردے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور جس پاک چیز میں اس سے تقصیر ہوئی ہے وہ اس کا معاوضہ دے اور اس میں پانچواں حصہ اور بڑھا کر اسے کاہن کے حوالہ کرے۔یوں کاہن جرم کی قربانی کا مینڈھا چڑھا کر اس کا کفارہ دے تو اسے معافی ملے گی۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "اور اگر کوئی خطا کرے اور ان کاموں میں سے جنہیں خداوند نے منع کیا ہے کسی کام کو کرے تو چاہے وہ یہ بات جانتا بھی نہ ہو تو بھی مجرم ٹھہریگا اور اس کا گناہ اسی کے سر لگے گا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "پس وہ ریوڑ میں سے ایک بے عیب مینڈھا اتنے ہی دام کا جو تو مقرر کردے جرم کی قربانی کے طوور پر کاہن کے پاس لائے۔یوںٍکاہن اس کی اس بات کا جس میں اس سے نادانستہ چوک ہو گئی کفارہ دے تو اسے معافی ملے گی۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "یہ جرم کی قربانی ہے کیونکہ وہ یقینأ خداوند کے آگے جمرم ہے۔",
                    },
                    
                ],
            },
            {
                "chap_num": 6,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 7,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 8,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 9,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 10,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 11,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 12,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 13,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 14,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 15,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 16,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 17,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 18,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 19,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 20,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 21,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 22,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 23,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 24,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 25,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 26,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },
            {
                "chap_num": 27,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                    
                ],
            },

        ],
    },
    {
        "book_id": 4,
        "book_title": "گنتی",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 5,
        "book_title": "استثنا",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 6,
        "book_title": "یشوؔع",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 7,
        "book_title": "قضاة",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 8,
        "book_title": "رُوت",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 9,
        "book_title": "سموئیل 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 10,
        "book_title": "سموئیل 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 11,
        "book_title": "سلاطِین 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 12,
        "book_title": "سلاطِین 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 13,
        "book_title": "تواریخ 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 14,
        "book_title": "تواریخ 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 15,
        "book_title": "عزرا",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 16,
        "book_title": "نحمیاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 17,
        "book_title": "آستر",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 18,
        "book_title": "ایّوب",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 19,
        "book_title": "زبُور",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 20,
        "book_title": "اِمثال",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 21,
        "book_title": "واعظ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 22,
        "book_title": "غزلُ الغزلات",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 23,
        "book_title": "یسعیاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 24,
        "book_title": "یرمیاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 25,
        "book_title": "نَوحہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 26,
        "book_title": "حزقی ایل",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 27,
        "book_title": "دانی ایل",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 28,
        "book_title": "ہوسیع",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 29,
        "book_title": "یُوایل",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 30,
        "book_title": "عامُوس",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 31,
        "book_title": "عبدیاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 32,
        "book_title": "یُوناہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 33,
        "book_title": "میکاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 34,
        "book_title": "نا حُوم",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 35,
        "book_title": "حبقُوق",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 36,
        "book_title": "صفنیاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 37,
        "book_title": "حجَّی",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 38,
        "book_title": "زکریاہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 39,
        "book_title": "ملاکی",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 40,
        "book_title": "متّی",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 41,
        "book_title": "مرقس",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 42,
        "book_title": "لُوقا",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 43,
        "book_title": "یُوحنّا",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 44,
        "book_title": "اعمال",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 45,
        "book_title": "رومیوں",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 46,
        "book_title": "کُرنتھِیوں 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 47,
        "book_title": "کُرنتھِیوں 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 48,
        "book_title": "گلتیوں",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 49,
        "book_title": "افسیوں",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 50,
        "book_title": "فلپیوں",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 51,
        "book_title": "کُلسّیوں",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 52,
        "book_title": "تھِسلُنیکیوں 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 53,
        "book_title": "تھِسلُنیکیوں 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 54,
        "book_title": "تیمِتھُیس 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 55,
        "book_title": "تیمِتھُیس 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 56,
        "book_title": "طِطُس",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 57,
        "book_title": "فلیمون",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 58,
        "book_title": "عِبرانیوں",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 59,
        "book_title": "یعقُوب",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "خُدا کے اور خُداوند یِسُوع مسِیح کے بندہ یَعقُوب کی طرف سے اُن بارہ قبِیلوں کو جو جا بجا رہتے ہیں سَلام پہُنچے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "اَے میرے بھائِیو! جب تُم طرح طرح کی آزمایشوں میں پڑو۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تو اِس کو یہ جان کر کمال خُوشی کی بات سَمَجھنا کہ تُمہارے اِیمان کی آزمایش صبر پَیدا کرتی ہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اور صبر کو اپنا پُورا کام کرنے دو تاکہ تُم پُورے اور کامِل ہو جاؤ اور تُم میں کِسی بات کی کمی نہ رہے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "لیکِن اگر تُم میں سے کِسی میں حِکمت کی کم ہو تو خُدا سے مانگے جو بغَیر ملامت کِئے سب کو فَیّاضی کے ساتھ دیتا ہے۔ اُس کو دی جائے گی۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "مگر اِیمان سے مانگے اور کُچھ شک نہ کرے کِیُونکہ شک کرنے والا سَمَندَر کی لہر کی مانِند ہوتا ہے جو ہوا سے بہُتی اور اُچھلتی ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "اَیسا آدمِی یہ نہ سَمَجھے کہ مُجھے خُداوند سے کُچھ مِلے گا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "وہ شَخص دو دِلا ہے اور اپنی سب باتوں میں بے قیام ہے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "ادنٰے بھائِی اپنے اعلٰے مرتبہ پر فخر کرے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "اور دَولتمند اپنی ادنٰے حالت پر اِس لِئے کہ گھاس کے پھُول کی طرح جاتا رہے گا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "کِیُونکہ سُورج نِکلتے ہی سخت دھُوپ پڑتی اور گھاس کو سُکھا دیتی ہے اور اُس کا پھُول گِر جاتا ہے اور اُس کی خُوبصُورتی جاتی رہتی ہے۔ اِسی طرح دَولتمند بھی اپنی راہ پر چلتے چلتے خاک میں مِل جائے گا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "مُبارک وہ شَخص ہے جو آزمایش کی برداشت کرتا ہے کِیُونکہ جب مقبُول ٹھہرا تو زِندگی کا وہ تاج حاصِل کرے گا جِس کا خُداوند نے اپنے محبّت کرنے والوں سے وعدہ کِیا ہے۔",
                    },
                    {
                        "verse_num": 13,
                        "text": " جب کوئی آزمایا جائے تو یہ نہ کہے کہ میری آزمایش خُدا کی طرف سے ہوتی ہے کِیُونکہ نہ تو خُدا بدی سے آزمایا جا سکتا ہے اور نہ وہ کِسی کو آزماتا ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "ہاں ہر شَخص اپنی ہی خواہِشوں میں کھِنچ کر اور پھنس کر آزمایا جاتا ہے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": "پھِر خواہِش حامِلہ ہوکر گُناہ کو جنتی ہے اور گُناہ جب بڑھ چُکا تو مَوت پَیدا کرتا ہے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اَے میرے پیارے بھائِیو! فریب نہ کھانا۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "ہر اچھّی بخشِش اور ہر کامِل اِنعام اُوپر سے ہے اور نوروں کے باپ کی طرف سے مِلتا ہے جِس میں نہ کوئی تبدیلی ہوسکتی ہے اور نہ گردِش کے سبب سے اُس پر سایہ پڑتا ہے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": " اُس نے اپنی مرضی سے ہمیں کلامِ حق کے وسِیلہ سے پَیدا کِیا تاکہ اُس کی مخلُوقات میں سے ہم ایک طرح کے پہلے پھَل ہوں۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اَے میرے پیارے بھائِیو! یہ بات تُم جانتے ہو۔ پَس ہر آدمِی سُننے میں تیز اور بولنے میں دِھیرا اور قہر میں دھِیما ہو۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "کِیُونکہ اِنسان کا قہر خُدا کی راستبازی کا کام نہِیں کرتا۔",
                    },
                    {
                        "verse_num": 21,
                        "text": "اِس لِئے ساری نِجاست اور بدی کے فُضلہ کو دُور کر کے اُس کلام کو حلِیمی سے قُبُول کر لو جو دِل میں بویا گیا اور تُمہاری رُوحوں کو نِجات دے سکتا ہے۔",
                    },
                    {
                        "verse_num": 22,
                        "text": " لیکِن کلام پر عمل کرنے والے بنو نہ محض سُننے والے جو اپنے آپ کو دھوکہ دیتے ہیں۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "کِیُونکہ جو کوئی کلام کا سُننے والا ہو اور اُس پر عمل کرنے والا نہ ہو وہ اُس شَخص کی مانِند ہے جو اپنی قُدرتی صُورت آئِینہ میں دیکھتا ہے۔",
                    },
                    {
                        "verse_num": 24,
                        "text": "اِس لِئے کہ وہ اپنے آپ کو دیکھ کر چلا جاتا اور فوراً بھُول جاتا ہے کہ مَیں کَیسا تھا۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "لیکِن جو شَخص آزادی کی کامِل شَرِیعَت پر غور سے نظر کرتا رہتا ہے وہ اپنے کام میں اِس لِئے بَرکَت پائے گا کہ سُن کر بھُولتا نہِیں بلکہ عمل کرتا ہے۔",
                    },
                    {
                        "verse_num": 26,
                        "text": "اگر کوئی اپنے آپ کو دِیندار سَمَجھے اور اپنی زبان کو لگام نہ دے بلکہ اپنے دِل کو دھوکا دے تو اُس کی دِینداری باطِل ہے۔",
                    },
                    {
                        "verse_num": 27,
                        "text": "ہمارے خُدا اور باپ کے نزدِیک خالِص اور بے عَیب دِینداری یہ ہے کہ یتِیموں اور بیواؤں کی مُصِیبت کے وقت اُن کی خَبر لیں اور اپنے آپ کو دُنیا سے بے داغ رکھّیں۔",
                    },
                ],
            },
            {
                "chap_num": 2,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اَے میرے بھائِیو! ہمارے خُداوند ذُوالجلال یِسُوع مسِیح کا اِیمان تُم میں طرفداری کے ساتھ نہ ہو۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "کِیُونکہ اگر ایک شَخص تو سونے کی انگُوٹھی اور عُمدہ پوشاک پہنے ہُوئے تُمہاری جماعت میں آئے اور ایک غرِیب آدمِی مَیلے کُچیلے کپڑے پہنے ہُوئے آئے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "اور تُم اُس عُمدہ پوشاک والے کا لِحاظ کر کے کہو کہ تُو یہاں اچھّی جگہ بَیٹھ اور اُس غرِیب شَخص سے کہو کہ تُو وہاں کھڑا رہ یا میرے پاؤں کی چَوکی کے پاس بَیٹھ۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "تو کیا تُم نے آپس میں طرفداری نہ کی اور بدنِیّت مُنصِف نہ بنے؟",
                    },
                    {
                        "verse_num": 5,
                        "text": " اَے میرے پیارے بھائِیو! سُنوُ، کیا خُدا نے اِس جہان کے غرِیبوں کو اِیمان میں دَولتمند اور اُس بادشاہی کے وارِث ہونے کے لِئے برگُزِیدہ نہِیں کِیا جِس کا اُس نے اپنے محبّت کرنے والوں سے وعدہ کِیا ہے؟",
                    },
                    {
                        "verse_num": 6,
                        "text": "لیکِن تُم نے غرِیب آدمِی کی بے عِزّتی کی۔ کیا دَولتمند تُم پر ظُلم نہِیں کرتے اور وُہی تُمہیں عدالتوں میں گھسِیٹ کر نہِیں لے جاتے؟",
                    },
                    {
                        "verse_num": 7,
                        "text": "کیا وہ اُس بُزُرگ نام پر کُفر نہِیں بکتے جِس سے تُم نامزد ہو؟",
                    },
                    {
                        "verse_num": 8,
                        "text": "تَو ابھی اگر تُم اِس نوِشتہ کے مُطابِق کہ اپنے پڑوسِی سے اپنی مانِند محبّت رکھ اُس بادشاہی شَرِیعَت کو پُورا کرتے ہو تو اچھّا کرتے ہو۔",
                    },
                    {
                        "verse_num": 9,
                        "text": " لیکِن اگر تُم طرفداری کرتے ہو تو گُناہ کرتے ہو اور شَرِیعَت تُم کو قُصُوروار ٹھہراتی ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "کِیُونکہ جِس نے ساری شَرِیعَت پر عمل کِیا اور ایک ہی بات میں خطا کی وہ سب باتوں میں قُصُوروار ٹھہرا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "اِس لِئے کہ جِس نے یہ فرمایا کہ زِنا نہ کر اُسی نے یہ بھی فرمایا کہ خُون نہ کر۔ پَس اگر تُو نے زِنا تو نہ کِیا مگر خُون کِیا تو بھی تُو شَرِیعَت کا عُدُول کرنے والا ٹھہرا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": " تُم اُن لوگوں کی طرح کلام بھی کرو اور کام بھی کرو جِن کا آزادی کی شَرِیعَت کے مُوافِق اِنصاف ہوگا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "کِیُونکہ جِس نے رحم نہِیں کِیا اُس کا اِنصاف بغَیر رحم کے ہوگا۔ رحم اِنصاف پر غالِب آتا ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": " اَے میرے بھائِیو! اگر کوئی کہے کہ مَیں اِیماندار ہُوں مگر عمل نہ کرتا ہو تو کیا فائِدہ؟ کیا اَیسا اِیمان اُسے نِجات دے سکتا ہے؟",
                    },
                    {
                        "verse_num": 15,
                        "text": "اگر کوئی بھائِی یا بہن ننگی ہو اور اُن کو روزانہ روٹی کی کمی ہو۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "اور تُم میں سے کوئی اُن سے کہے کہ سَلامتی کے ساتھ جاؤ۔ گرم اور سیر رہو مگر جو چِیزیں تن کے لِئے درکار ہیں وہ اُنہِیں نہ دے تو کیا فائِدہ؟",
                    },
                    {
                        "verse_num": 17,
                        "text": "اِسی طرح اِیمان بھی اگر اُس کے ساتھ اعمال نہ ہوں تو اپنی ذات سے مُردہ ہے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "بلکہ کوئی کہہ سکتا ہے کہ تُو تو اِیماندار ہے اور مَیں عمل کرنے والا ہُوں۔ تُو اپنا اِیمان بغَیر اعمال کے تو مُجھے دِکھا اور میں اپنا اِیمان اعمال سے تُجھے دِکھاؤں گا۔",
                    },
                    {
                        "verse_num": 19,
                        "text": " تُو اِس بات پر اِیمان رکھتا ہے کہ خُدا ایک ہی ہے۔ خَیر، اچھّا کرتا ہے۔ شیاطِین بھی اِیمان رکھتے اور تھَر تھَراتے ہیں۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "مگر اَے نِکمّے آدمِی! کیا تُو یہ بھی نہِیں جانتا کہ اِیمان بغَیر اعمال کے بےکار ہے؟",
                    },
                    {
                        "verse_num": 21,
                        "text": "جب ہمارے باپ ابرہام نے اپنے بَیٹے اِضحاق کو قُربان گاہ پر قُربان کِیا تو کیا وہ اعمال سے راستباز نہ ٹھہرا؟",
                    },
                    {
                        "verse_num": 22,
                        "text": " پَس تُو نے دیکھ لِیا کہ اِیمان نے اُس کے اعمال کے ساتھ مِل کر اثر کِیا اور اعمال سے اِیمان کامِل ہُؤا۔",
                    },
                    {
                        "verse_num": 23,
                        "text": "اور یہ نوِشتہ پُورا ہُؤا کہ ابرہام خُدا پر اِیمان لایا اور یہ اُس کے لِئے راستبازی گِنا گیا اور وہ خُدا کا دوست کہلایا۔",
                    },
                    {
                        "verse_num": 24,
                        "text": " پَس تُم نے دیکھ لِیا کہ اِنسان صِرف اِیمان سے نہِیں بلکہ اعمال سے راستباز ٹھہرتا ہے۔",
                    },
                    {
                        "verse_num": 25,
                        "text": "اِسی طرح راحب فاحِشہ بھی جب اُس نے قاصِدوں کو اپنے گھر میں اُتارا اور دُوسری راہ سے رُخصت کِیا تو کیا اعمال سے راستباز نہ ٹھہری؟",
                    },
                    {
                        "verse_num": 26,
                        "text": "غرض جَیسے بَدَن بغَیر رُوح کے مُردہ ہے وَیسے ہی اِیمان بھی بغَیر اعمال کے مُردہ ہے۔",
                    },
                ],
            },
            {
                "chap_num": 3,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اے میرے بھائِیو! تُم میں سے بہُت سے اُستاد نہ بنیں گے کِیُونکہ جانتے ہو کہ ہم جو اُستاد ہیں زِیادہ سزا پائیں گے۔",
                    },
                    {
                        "verse_num": 2,
                        "text": " اِس لِئے کہ ہم سب کے سب اکثر خطا کرتے ہیں۔ کامِل شَخص وہ ہے جو باتوں میں خطا نہ کرے۔ وہ سارے بَدَن کو بھی قابُو میں رکھ سکتا ہے۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "جب ہم اپنے قابُو کرنے کے لِئے گھوڑوں کے مُنہ میں لگام دے دیتے ہیں تو اُن کے سارے بَدَن کو بھی گھُما سکتے ہیں۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "دیکھو، جہاز بھی اگرچہ بڑے بڑے ہوتے ہیں اور تیز ہواؤں سے چلائے جاتے ہیں تَو بھی ایک نِہایت چھوٹی سے پتوار کے ذرِیعہ سے مانجھی کی مرضی کے مُوافِق گھُمائے جاتے ہیں۔",
                    },
                    {
                        "verse_num": 5,
                        "text": "اِسی طرح زبان بھی ایک چھوٹا سا عضُو ہے اور بڑی شیخی مارتا ہے۔ دیکھو، تھوڑی سے آگ سے کِتنے بڑے جنگل میں آگ لگ جاتی ہے۔",
                    },
                    {
                        "verse_num": 6,
                        "text": " زبان بھی ایک آگ ہے۔ زبان ہمارے اعضا میں شرارت کا ایک عالم ہے اور سارے جِسم کو داغ لگاتی ہے اور دائرۂِ دُنیا کو آگ لگا دیتی ہے اور جہنّم کی آگ سے جلتی رہتی ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "کِیُونکہ ہر قِسم کے چَوپائے اور پرِندے اور کِیڑے مکَوڑے اور دریائی جانور تو اِنسان کے قابُو میں آ سکتے ہیں اور آئے بھی ہیں۔",
                    },
                    {
                        "verse_num": 8,
                        "text": " مگر زبان کو کوئی آدمِی قابُو میں نہِیں کر سکتا۔ وہ ایک بلا ہے جو کبھی رُکتی ہی نہِیں۔ زہرِ قاتِل سے بھری ہُوئی ہے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "اِسی سے ہم خُداوند اور باپ کی حمد کرتے ہیں اور اِسی سے آدمِیوں کو جو خُدا کی صُورت پر پَیدا ہُوئے ہیں بددُعا دیتے ہیں۔",
                    },
                    {
                        "verse_num": 10,
                        "text": " ایک ہی مُنہ سے مُبارکباد اور بددُعا نِکلتی ہے۔ اَے بھائِیو! اَیسا نہ ہونا چاہئے۔",
                    },
                    {
                        "verse_num": 11,
                        "text": " کیا چشمہ کے ایک ہی مُنہ سے مِیٹھا اور کھاری پانی نِکلتا ہے؟",
                    },
                    {
                        "verse_num": 12,
                        "text": " اَے میرے بھائِیو! کیا اِنجیر کے دَرخت میں زَیتُّون اور انگُور میں اِنجیر پَیدا ہو سکتے ہیں؟ اِسی طرح کھاری چشمہ سے مِیٹھا پانی نہِیں نِکل سکتا۔",
                    },
                    {
                        "verse_num": 13,
                        "text": "تُم میں دانا اور فہِیم کَون ہے؟ جو اَیسا ہو وہ اپنے کاموں کو نیک چال چلن کے وسِیلہ سے اُس حِلم کے ساتھ ظاہِر کرے جو حِکمت سے پَیدا ہوتا ہے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": " لیکِن اگر تُم اپنے دِل میں سخت حسد اور تفرقے رکھتے ہو تو حق کے خِلاف نہ شیخی مارو نہ جھُوٹ بولو۔",
                    },
                    {
                        "verse_num": 15,
                        "text": " یہ حِکمت وہ نہِیں جو اُوپر سے اُترتی ہے بلکہ دُنیوی اور نفسانی اور شَیطانی ہے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": " اِس لِئے کہ جہاں حسد اور تفرقہ ہوتا ہے وہاں فساد اور ہر طرح کا بُرا کام بھی ہوتا ہے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "مگر جو حِکمت اُوپر سے آتی ہے اوّل تو وہ پاک ہوتی ہے۔ پھِر مِلنسار۔ حلیم اور تربیت پذِیر۔ رحم اور اچھّے پھَلوں سے لدی ہُوئی۔ بے طرفدار اور بے رِیا ہوتی ہے۔",
                    },
                    {
                        "verse_num": 18,
                        "text": "اور صُلح کرانے والوں کے لِئے راستبازی کا پھَل صُلح کے ساتھ بویا جاتا ہے۔",
                    },
                ],
            },
            {
                "chap_num": 4,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "تُم میں لڑائیاں اور جھگڑے کہاں سے آگئے؟ کیا اُن خواہِشوں سے نہِیں جو تُمہارے اعضا میں فساد کرتی ہیں؟",
                    },
                    {
                        "verse_num": 2,
                        "text": "تُم خواہِش کرتے ہو اور تُمہیں مِلتا نہِیں۔ خُون اور حسد کرتے ہو اور کُچھ حاصِل نہِیں کرسکتے۔ تُم جھگڑتے اور لڑتے ہو۔ تُمہیں اِس لِئے نہِیں مِلتا کہ مانگتے نہِیں۔",
                    },
                    {
                        "verse_num": 3,
                        "text": "تُم مانگتے ہو اور پاتے نہِیں اِس لِئے کہ بُری نیّت سے مانگتے ہو تاکہ اپنی عَیش و عِشرت سے خرچ کرو۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "اَے زِنا کرنے والیو! کیا تُمہیں نہِیں معلُوم کہ دُنیا سے دوستی رکھنا خُدا سے دُشمنی کرنا ہے؟ پَس جو کوئی دُنیا کا دوست بننا چاہتا ہے وہ اپنے آپ کو خُدا کا دُشمن بناتا ہے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": " کیا تُم یہ سَمَجھتے ہو کہ کِتابِ مُقدّس بے فائِدہ کہتی ہے؟ جِس رُوح کو اُس نے ہمارے اَندر بسایا ہے کیا وہ اَیسی آرزُو کرتی ہے جِس کا انجام حسد ہو؟",
                    },
                    {
                        "verse_num": 6,
                        "text": " وہ تو زِیادہ تَوفِیق بخشتا ہے۔ اِسی لِئے یہ آیا ہے کہ خُدا مغرُوروں کا مُقابلہ کرتا ہے مگر فروتنوں کو تَوفِیق بخشتا ہے۔",
                    },
                    {
                        "verse_num": 7,
                        "text": " پَس خُدا کے تابِع ہو جاؤ اور اِبلِیس کا مُقابلہ کرو تو وہ تُم سے بھاگ جائے گا۔",
                    },
                    {
                        "verse_num": 8,
                        "text": " خُدا کے نزدِیک جاؤ تو وہ تُمہارے نزدِیک آئے گا۔ اَے گُناہگارو! اپنے ہاتھوں کو صاف کرو اور اَے دو دِلو! اپنے دِلوں کو پاک کرو۔",
                    },
                    {
                        "verse_num": 9,
                        "text": "افسوس اور ماتم کرو اور روؤ۔ تُمہاری ہنسی ماتم سے بدل جائے اور تُمہاری خُوشی اُداسی سے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": "خُداوند کے سامنے فروتنی کرو۔ وہ تُمہیں سربُلند کرے گا۔",
                    },
                    {
                        "verse_num": 11,
                        "text": " اَے بھائِیو! ایک دُوسرے کی بدگوئی نہ کرے۔ جو اپنے بھائِی کی بدگوئی کرتا یا بھائِی پر اِلزام لگاتا ہے وہ شَرِیعَت کی بدگوئی کرتا اور شَرِیعَت پر اِلزام لگاتا ہے اور اگر تُو شَرِیعَت پر اِلزام لگاتا ہے تو شَرِیعَت پر عمل کرنے والا نہِیں بلکہ اُس پر حاکِم ٹھہرا۔",
                    },
                    {
                        "verse_num": 12,
                        "text": "شَرِیعَت کا دینے والا اور حاکِم تو ایک ہی ہے جو بَچانے اور ہلاک کرنے پر قادِر ہے۔ تُو کَون ہے جو اپنے پڑوسِی پر اِلزام لگاتا ہے؟",
                    },
                    {
                        "verse_num": 13,
                        "text": " تُم جو یہ کہتے ہو کہ ہم آج یا کل فلاں شہر میں جا کر وہاں ایک برس ٹھہریں گے اور سَوداگری کر کے نفع اُٹھائیں گے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": "اور یہ جانتے نہِیں کہ کل کیا ہوگا۔ ذرا سُنو تو! تُمہاری زِندگی چِیز ہی کیا ہے؟ بُخارات کا سا حال ہے۔ ابھی نظر آئے۔ ابھی غائِب ہو گئے۔",
                    },
                    {
                        "verse_num": 15,
                        "text": " یُوں کہنے کی جگہ تُمہیں یہ کہنا چاہئے کہ اگر خُداوند چاہے تو ہم زِندہ بھی رہیں گے اور یہ یا وہ کام بھی کریں گے۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "مگر اَب تُم اپنی شَیخی پر فخر کرتے ہو۔ اَیسا سب فخر بُرا ہے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": " پَس جو کوئی بھلائی کرنا جانتا ہے اور نہِیں کرتا اُس کے لِئے یہ گُناہ ہے۔",
                    },
                ],
            },
            {
                "chap_num": 5,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "اَے دَولتمندو ذرا سُنو تو! تُم اپنی مُصِیبتوں پر جو آنے والی ہیں روؤ اور واوَیلا کرو۔",
                    },
                    {
                        "verse_num": 2,
                        "text": "تُمہارا مال بِگڑ گیا اور تُمہاری پوشاکوں کو کِیڑا کھا گیا۔",
                    },
                    {
                        "verse_num": 3,
                        "text": " تُمہارے سونے چاندی کو زنگ لگ گیا اور وہ زنگ تُم پر گواہی دے گا اور آگ کی طرح تُمہارا گوشت کھائے گا۔ تُم نے اخِیر زمانہ میں خزانہ جمع کِیا ہے۔",
                    },
                    {
                        "verse_num": 4,
                        "text": "دیکھو جِن مزدُوروں نے تُمہارے کھیت کاٹے اُن کی وہ مزدُوری جو تُم نے دغا کر کے رکھ چھوڑی چِلّاتی ہے اور فصل کاٹنے والوں کی فریاد ربّ اُلافواج کے کانوں تک پہُنچ گئی ہے۔",
                    },
                    {
                        "verse_num": 5,
                        "text": " تُم نے زمِین پر عَیش و عِشرت کی اور مزے اُڑائے۔ تُم نے اپنے دِلوں کو ذبح کے دِن موٹا تازہ کِیا۔",
                    },
                    {
                        "verse_num": 6,
                        "text": "تُم نے راستباز شَخص کو قُصُوروار ٹھہرایا اور قتل کِیا۔ وہ تُمہارا مُقابلہ نہِیں کرتا۔",
                    },
                    {
                        "verse_num": 7,
                        "text": "پَس اَے بھائِیو! خُداوند کی آمد تک صبر کرو۔ دیکھو۔ کِسان زمِین کی قِیمتی پَیداوار کے اِنتظار میں پہلے اور پِچھلےمینہ کے برسنے تک صبر کرتا رہتا ہے۔",
                    },
                    {
                        "verse_num": 8,
                        "text": "تُم بھی صبر کرو اور اپنے دِلوں کو مضبُوط رکھّو کِیُونکہ خُداوند کی آمد قرِیب ہے۔",
                    },
                    {
                        "verse_num": 9,
                        "text": " اَے بھائِیو! ایک دُوسرے کی شِکایت نہ کرو تاکہ تُم سزا نہ پاؤ۔ دیکھو مُنصِف دروازہ پر کھڑا ہے۔",
                    },
                    {
                        "verse_num": 10,
                        "text": " اَے بھائِیو! جِن نبِیوں نے خُداوند کے نام سے کلام کِیا اُن کو دُکھ اُٹھانے اور صبر کرنے کا نمُونہ سَمَجھو۔",
                    },
                    {
                        "verse_num": 11,
                        "text": "دیکھو صبر کرنے والوں کو ہم مُبارک کہتے ہیں۔ تُم نے ایُّوب کے صبر کا حال تو سُنا ہی ہے اور خُداوند کی طرف سے جو اِس کا انجام ہُؤا اُسے بھی معلُوم کر لِیا جِس سے خُداوند کا بہُت ترس اور رحم ظاہِر ہوتا ہے۔",
                    },
                    {
                        "verse_num": 12,
                        "text": " مگر اَے میرے بھائِیو! سب سے بڑھ کر یہ ہے کہ قَسم نہ کھاؤ۔ نہ آسمان کی نہ زمِین کی۔ نہ کِسی اَور چِیز کی بلکہ ہاں کی جگہ ہاں کرو اور نہِیں کی جگہ نہِیں تاکہ سزا کے لائِق نہ ٹھہرو۔",
                    },
                    {
                        "verse_num": 13,
                        "text": " اگر تُم میں کوئی مُصِیبت زدہ ہو تو دُعا کرے۔ اگر خُوش ہو تو حمد کے گیت گائے۔",
                    },
                    {
                        "verse_num": 14,
                        "text": " اگر تُم میں کوئی بِیمار ہو تو کلِیسیا کے بُزُرگوں کو بُلائے اور وہ خُداوند کے نام سے اُس کو تیل مل کر اُس کے لِئے دُعا کریں۔",
                    },
                    {
                        "verse_num": 15,
                        "text": " جو دُعا اِیمان کے ساتھ ہوگی اُس کے باعِث بِیمار بچ جائے گا اور خُداوند اُسے اُٹھا کھڑا کرے گا اور اگر اُس نے گُناہ کِئے ہوں تو اُن کی بھی مُعافی ہو جائے گی۔",
                    },
                    {
                        "verse_num": 16,
                        "text": "پَس تُم آپس میں ایک دُوسرے سے اپنے اپنے گُناہوں کا اِقرار کرو اور ایک دُوسرے کے لِئے دُعا کرو تاکہ شِفا پاؤ۔ راستباز کی دُعا کے اثر سے بہُت کُچھ ہو سکتا ہے۔",
                    },
                    {
                        "verse_num": 17,
                        "text": "ایلِیاہ ہمارا ہم طبِیعت اِنسان تھا۔ اُس نے بڑے جوش سے دُعا کی مینہ نہ برسے۔ چُنانچہ ساڑھے تِین برس تک زمِین پر مینہ نہ برسا۔",
                    },
                    {
                        "verse_num": 18,
                        "text": " پھِر اُس نے دُعا کی تو آسمان سے پانی برسا اور زمِین میں پَیداوار ہُوئی۔",
                    },
                    {
                        "verse_num": 19,
                        "text": "اَے میرے بھائِیو! اگر تُم میں کوئی راہِ حق سے گُمراہ ہو جائے اور کوئی اُس کو پھیر لائے۔",
                    },
                    {
                        "verse_num": 20,
                        "text": "تو وہ یہ جان لے کہ جو کوئی کِسی گُناہگار کو اُس کی گُمراہی سے پھیر لائے گا۔ وہ ایک جان کو مَوت سے بَچائے گا اور بہُت سے گُناہوں پر پردہ ڈالے گا۔",
                    },
                    {
                        "verse_num": 1,
                        "text": "",
                    },

                ],
            },
        ],
    },
    {
        "book_id": 60,
        "book_title": "پطرس 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 61,
        "book_title": "پطرس 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 62,
        "book_title": "یُوحنّا 1",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 63,
        "book_title": "یُوحنّا 2",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 64,
        "book_title": "یُوحنّا 3",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 65,
        "book_title": "یہُوداہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
    {
        "book_id": 66,
        "book_title": "مُکاشفہ",
        "chapters": [
            {
                "chap_num": 1,
                "chapterAudioUrl": "",
                "verses": [
                    {
                        "verse_num": 1,
                        "text": "",
                    },
                ],
            },
        ],
    },
]

// export const Books = [
//     {
//             "book_title": "پیَدایش",
//             "chapters": [
//                 "chap_id_1": {
//                     "chap_num": 1,
//                     "chapterAudioUrl": "",
//                     "verses": [
//                         "verse_id_1": "خُدا نے ابتدا میں زمین و آسمان کو پَیدا کیا۔",
//                         "verse_id_2": "اور زمین ویران اور سُنسان تھی اور گہراو کے اُوپر اندھیرا تھا اور خُدا کی روُح پانی کی سطح پر جُنبش کرتی تھی ۔",
//                         "verse_id_3": "اور خُدا نے کہا کہ روشنی ہو جا اور روشنی ہو گئی۔",
//                         "verse_id_4": "اور خُدا نے کہاکہ روشنی اچھی ہے اور خُدا نے روشنی کو تاریکی سے جُدا کیا",

//                     ]
//                 }
//             ]
//     }
// ]
// Function to search for a query in the Bible data
function searchBible(query) {
    const results = [];
  
    // Traverse through all books, chapters, and verses
    for (const book of bibleData.books) {
      for (const chapter of book.chapters) {
        for (const verse of chapter.verses) {
          // Check if the verse text contains the search query (case-insensitive)
          if (verse.text.toLowerCase().includes(query.toLowerCase())) {
            // Collect the matching verse along with book name, chapter number, and verse ID
            results.push({
              bookName: book.name,
              chapterNumber: chapter.id,
              verseId: verse.id,
              verseText: verse.text,
            });
          }
        }
      }
    }
    return results;
}